{
    "job_id": "3525697277",
    "title": "Business Analyst",
    "company": "Priceline",
    "location": "Mumbai, Maharashtra, India",
    "description": "This role is eligible for our five day flex office work model.\n\nBusiness Analyst\n\nFrom accounting and financial planning to risk/fraud analysis and payments, our Finance team ensures not only our company’s financial security, but also that our customers can buy from us with confidence.\n\nWhy This Job’s a Big Deal\n\nAs a business analyst, you will derive insights from numerous data sources, and should have ability to create visualization of data and presentation through dashboards. Collecting, analyzing, and sharing data with members of the Finance Operations will a big part of a typical work day.\n\nIn This Role You Will Get To\n\n\nProvide insights into Transactional fulfillment and declines and find opportunities to convert declines in orders by working with fintech and product team members.\nAnalyze Credit card downgrades and find opportunities to work with fintech to resolve the same and reduce cost of payments.\nDevelop KPI’s and dashboards to measure and report progress on payment reconciliation and other Strategic Finance Initiatives.\nCollaborative, agile mindset to drive speedy, creative and efficient use of technology and data to drive business value.\nWork with Fintech and Product teams to improve efficiency and profitability of Travel Transactions.\nAbility to analyze and document complex business processes.\nAbility to think analytically, a proactive problem solver.\nAbility to interpret relevant data and information.\nIntegrate high quality data sources to enable precise, near “real-time” decision making on all inbound customer transactions, Select, prioritize, and drive projects that will extend the capabilities of the payments processes.\n\n\nWho You Are\n\n\nMust be organized, positive, proactive, results-oriented, with excellent communication and problems solving skills.\n4+ years of data analysis experience.\nStrong proficiency in SQL (Oracle), Essbase and Hyperion or similar EPM tools.\nProven analytical ability and strong proficiency in Excel and/or Tableau.\nCapability to validate and accurately explain results of analysis.\nBachelor’s degree in math, economics, computer sciences, quantitative field, or related discipline.\nPassion for innovation and excellence.\n\n\nBeneficial Experience\n\n\nDeveloping and implementing new control processes.\nPlanning and forecast managing.\nBudgeting and actuals analysis using multi-dimensional data reporting tools.\nValidating and explaining trends and impact on financial performance.\n\n\nWho We Are\n\nWE ARE PRICELINE.\n\nOur success as one of the biggest players in online travel is all thanks to our incredible, dedicated team of talented employees. Priceliners are focused on being the best travel deal makers in the world, fueled by our passion to help everyone experience the moments that matter most in their lives. Whether it’s a dream vacation, your cousin’s graduation, or your best friend’s wedding - we make travel affordable and accessible to our customers.\n\nOur culture is unique and inspiring (that’s what our employees tell us). We’re a grown-up, startup. We deliver the excitement of a new venture, without the struggles and chaos that can come with a business that hasn’t stabilized.\n\nWe’re on the cutting edge of innovative technologies. We keep the customer at the center of all that we do. Our ability to meet their needs relies on the strength of a workforce as diverse as the customers we serve. We bring together employees from all walks of life and we are proud to provide the kind of inclusive environment that stimulates innovation, creativity and collaboration.\n\nPriceline is part of the Booking Holdings, Inc. (Nasdaq: BKNG) family of companies, a highly profitable global online travel company with a market capitalization of over $80 billion. Our sister companies include Booking.com, BookingGo, Agoda, Kayak and OpenTable.\n\nIf you want to be part of something truly special, check us out!\n\nFlexible work at Priceline\n\nWhen we return to the office we will be in a fully flex mode, meaning you decide when to come to the office when it makes sense for you to do so - no minimum number of days in the office. Until then we are all working from home and will return to our flex mode when it is safe to do so.\n\nDiversity and Inclusion are a Big Deal!\n\nTo be the best travel dealmakers in the world, it’s important we have a workforce that reflects the diverse customers and communities we serve. We are committed to cultivating a culture where all employees have the freedom to bring their individual perspectives, life experiences, and values-driven passion to work.\n\nPriceline is a proud equal opportunity employer. We embrace and celebrate the unique lenses through which our employees see the world. We’d love you to join us and add to our rich mix!\n\nApplying for this position\n\nWe're excited that you are interested in a career with us. For all current employees, please use the internal portal to find jobs and apply.\n\nExternal candidates are required to have an account before applying. When you click Apply, returning candidates can log in, or new candidates can quickly create an account to save/view applications.\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-priceline-3525697277?position=2&pageNum=65&refId=c7sH5y8Mkcxycc0ZQ9ncOA%3D%3D&trackingId=xgEkwX5m%2FjoBmv1SYppv0w%3D%3D"
}