{
    "job_id": "3627618777",
    "title": "Business Analyst",
    "company": "STREETMARK Info Solutions",
    "location": "Hyderabad, Telangana, India",
    "description": "Greetings.....!!!\n\nWe have a job opportunity for \"Business Analyst\" with one of our esteemed product development organization \"Vitech Systems Asia\"\n\nJob Description for Associate – Mid Solution Analyst:-\n\nExperience: 4 to 7 years\n\nJob Responsibilities\n\n\nResponsible for the analysis of the business needs and documenting the business rules across one or more client accounts.\nMeeting with the client for conducting initial foundational analysis and production of requirements documents, functional specification documents, process flows etc...\nResponsible for collection of client documents; for weekly review and management of reported issues and modification requests, including the testing of and confirmation of reported issues.\nResponsible for coordination, testing and deployment of client application releases.\nEffectively communicate functional requirements to development team.\nServe as liaison between development staff and user community during development, testing and implementation stages as well as for on-going modifications.\nDevelop significant application and related business requirements expertise.\nUndertake test script development and test script execution.\nAbility to create and own project deliverable documents such as solution configuration document (SDD), testing, training documentation or any other artifact needed for the project.\n\n\nRequirements\n\n\nA critical and analytical approach to problem solving\nAttention to detail, and excellent written and verbal communication skills\nDexterity with use cases and requirements management tools\nA strong understanding of relational databases and intermediate to advanced knowledge of PL/SQL or PostgreSQL and Java Script\nExcellent knowledge and understanding of industry standard SDLC methodologies such as Agile, Waterfall etc…\nKnowledge in Project Management, Issue management, Change management tools (Jira Suite)\nBA/BS degree in a Business-, Engineering-, or Computer Science-related field\n\n\nOther Skills And Experience\n\n\nPrior Development experience is a plus\nExcellence in the analysis of business processes, documentation presentations and testing scenarios\nExperience in ERP implementation or integration projects\nSuccessful track record of translating business requirements into functional specifications\n\n\nSkills:- Business Analysis, PL/SQL, Project Management and Analytical Skills\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-streetmark-info-solutions-3627618777?position=3&pageNum=82&refId=N2DJYUFis9K%2FPRID1uM14Q%3D%3D&trackingId=uihcJV2OxLGT5Kb7EHnVWA%3D%3D"
}