{
    "job_id": "3769257308",
    "title": "Business Analyst",
    "company": "Rezo.ai",
    "location": "Noida, Uttar Pradesh, India",
    "description": "About Us\n\nWe are an AI-Powered CX Cloud that enables enterprises to transform customer experience and boost revenue with our APIs by automating and analyzing customer interactions at scale. We assist across multiple voices and non-voice channels in 30+ languages whilst coaching and training agents with minimal costs.\n\nThe problem we are solving\n\nIn comparison to worldwide norms, customer support in traditional contact centers is quite appalling, due to a high number of queries, insufficient capacity of agents and inane customer support systems, businesses struggle with a multi-fold rise in customer discontent and bounce rate, resulting in connectivity failure points between them and customers. To address this issue, IITian couple Manish and Rashi Gupta founded Rezo's AI-Powered CX Cloud for Enterprises 2018 to help businesses avoid customer churn and boost revenue without incurring financial costs by providing 24x7 real-time responses to customer inquiries with minimal human interaction.\n\nRoles And Responsibilities\n\n\nAbility to synthesize complex data into actionable goals and act as the custodian for everything on data and insights.\nEnsuring data sanctity through instrumentation and monitoring data quality to meet the business needs of the company Developing and monitoring KPIs for each vertical of the business.\n(Revenue/Sales/Finance/Campaigns/Content/Marketing), and at an overall business level and constantly driving the company towards meeting the KPIs.\nGenerating product and user insights and working closely with the Product manager to make product and design decisions\nHaving a product out view towards problem-solving – Market and competitor research to understand the trends in product design, continuous A/B testing to grow the product KPIs, etc\nOwning and improving the core issues related to the product.\nCreate and maintain client relationships.\nStay up to date with new products/services and competitors\nInterpersonal skills to work closely with various stakeholders who may have competing interests\n\n\nRequirements\n\n\nPrevious experience in Business / Systems Analysis or Quality Assurance\n2-5 years of experience\nA degree in IT / Computer Science\nProven experience in eliciting requirements and testing\nExperience in analyzing data to draw business-relevant conclusions and in data visualization techniques and tools\nSolid experience in writing SQL queries\nBasic knowledge in generating process documentation\nStrong written and verbal communication skills including technical writing skills\n\n\nLife At Rezo.AI\n\n\nWe take transparency very seriously. Along with a full view of team goals, get a top-level view across the board with our regular town hall meetings.\nA highly inclusive work culture that promotes a relaxed, creative, and productive environment.\nPractice autonomy, open communication, and growth opportunities, while maintaining a perfect work-life balance.\nGo on company-sponsored offsites and blow off steam with your work buddies.\n\n\nPerks & Benefits\n\nLearning is a way of life. Unlock your full potential backed with cutting-edge tools and mentorship. Get the best-in-class medical insurance, programs for taking care of your mental health, and a Contemporary Leave Policy (beyond sick leaves)\n\nWhy Us?\n\nWe are a fast-paced start-up with some of the best talents from diverse backgrounds. Working together to solve customer services problems. We believe a diverse workforce is a powerful multiplier of innovation and growth, which is key to providing our clients with the best possible service and our employees with the best possible career. Diversity makes us smarter, more competitive, and more innovative.\n\nExplore More Here\n\nwww.rezo.ai\n\nSkills:- Business Analysis, SQL, Analytical Skills, KPI management, Business requirements, Requirement Analysis, Information gathering, Data Visualization and BRD\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-rezo-ai-3769257308?position=4&pageNum=85&refId=ohmj3hU0l5bjBc1GtOJ2OA%3D%3D&trackingId=naf5KwMpl5Nk63RpdiliWg%3D%3D"
}