{
    "job_id": "3809363099",
    "title": "Business Analyst_Remote_b_rf",
    "company": "CodersBrain",
    "location": "India",
    "description": "Dear Candidate,\n\nAbout us - Coders Brain is a global leader in its services, digital and business solutions that partners with its clients to simplify, strengthen and transform their businesses. We ensure the highest levels of certainty and satisfaction through a deep-set commitment to our clients, comprehensive industry expertise and a global network of innovation and delivery centers. We achieved our success because of how successfully we integrate with our clients.\n\nQuick Implementation - We offer quick implementation for the new onboarding client.\n\nExperienced Team - We’ve built an elite and diverse team that brings its unique blend of talent, expertise, and experience to make you more successful, ensuring our services are uniquely customized to your specific needs.\n\nOne Stop Solution - Coders Brain provides end-to-end solutions for the businesses at an affordable price with uninterrupted and effortless services.\n\nEase of Use - All of our products are user friendly and scalable across multiple platforms. Our dedicated team at Coders Brain implements keeping the interest of enterprise and users in mind.\n\nSecure - We understand and treat your security with utmost importance. Hence we blend security and scalability in our implementation considering long term impact on business benefit.\n\nExperience:-7+ yrsLocation:- Remote-WFHEducation: BE/B.TechNotice period – Immediate JoinersPosition: Business Analyst\n\nJob Description\n\nTechnical Skills:\n\n\nMust Have:\nProficient in SQL for data extraction and analysis.\nFamiliarity with Python for scripting and data manipulation.\nAdvanced proficiency in Excel, serving as a power user for complex data analysis.\nGood to Have:\nExperience with data visualization tools such as Tableau and PowerBI.\nDomain Expertise:Work in various areas including Asset Management Services (AMS), service business, installed base, warranty management, and service contracts.\nAnalyze and interpret data related to service operations and provide valuable insights.\nCollaborate with cross-functional teams to understand business requirements and translate them into actionable insights.\n\n\nCommunication Skills\n\n\nExcellent verbal and written communication skills.\nAbility to convey complex technical information to non-technical stakeholders.\n\n\nQualifications\n\n\nBachelor's degree in Engineering (BE/B.Tech) or related field.\n7-8 years of experience in business analysis roles.\nProven expertise in SQL, Python, and Excel.\nFamiliarity with Tableau and PowerBI is a plus.\nStrong domain knowledge in AMS areas, service business, installed base, warranty, and service contracts.\n\n\nSkills: sql,python,excel\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-remote-b-rf-at-codersbrain-3809363099?position=9&pageNum=92&refId=Cg5sPd6Nkk2JaEAHs4OCRg%3D%3D&trackingId=TvzE%2F%2FmLyi65Y4V4YrB56w%3D%3D"
}