{
    "job_id": "3950808750",
    "title": "Business Analyst",
    "company": "OpalForce",
    "location": "Bengaluru, Karnataka, India",
    "description": "About The Job\n\nOpalforce is hiring Mechanical Design Engineers\n\nKey Responsibilities\n\n\nCreate requirements and specifications for business solutions\nConduct business analysis and research to identify opportunities for improvement\nConsult with key stakeholders to determine business objectives and success factors\nCollaborate with team members to collect, analyze, and evaluate information from multiple sources including\nPresent findings and recommendations to stakeholders\nWrite and document business requirements, functional requirements, and design specifications\nWork with information technology professionals to develop a solution that meets business requirements\nContinuously improve existing business processes and strive to develop new ones to improve efficiency\nDevelop processes and procedures to ensure business solutions meet strategic goals\nEnsure business processes are running in accordance with Agile methodologies\n\n\nSkill Set\n\n\nStrong problem-solving and management skills\nExcellent communication and analytical skills\nTechnical writing\nWorking knowledge of SQL, relational databases, and basic computer science\nProficiency in Microsoft Excel and other\nData visualization and data analysis experience not required but preferred\nExperience with project management tools such as Jira, and Confluence is a plus\nExperience in project management is a plus\nBachelor's degree in business administration, finance, or related field (Add this if required).\n\n\nAbout Opalforce, Inc.\n\nOpalForce Inc is a renowned Google cloud partner. A global leader with more than 20 years of experience in providing enterprise-level solutions to industries sectors like Healthcare, Entertainment, Retail, Government, Education, and Manufacturing. OpalForce has proven expertise in Google Cloud Platform, Infrastructure Modernization, Cloud Migration, Scaling Production Workloads, Kubernetes on GCP, Production Machine Learning, Gsuite Licenses. OpalForce has started its journey in Santa Clara, California in the year 2000, and associated with Fortune 1000 companies to transform and innovate them with Data and machine intelligence, & Cloud consulting, and engineering.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-opalforce-3950808750?position=9&pageNum=60&refId=RBk3qTVB%2BCNiFfiLUXOVnA%3D%3D&trackingId=kEN6F%2BIhb9RARxPfDTBMfg%3D%3D"
}