{
    "job_id": "3964539704",
    "title": "Business Analyst",
    "company": "ICE",
    "location": "Pune, Maharashtra, India",
    "description": "Job Description\n\nJob Purpose\n\nDo You Want To Join An International Team Working To Expand On The Largest End To End US Mortgage Platform? This Is An Opportunity To Build a Career Building Out a Platform Focused On\n\n\nDeveloper enablement\nSecurity\nReusable tooling\nCommunication\n\n\nWe build the cool, stable foundation that helps our application, partner and lender developers build new and innovative products to help borrowers realize the dream of home ownership.\n\nResponsibilities\n\n\nWork under the direction of a product manager to break down requirements and author user stories with complete acceptance criteria for development and QA teams to execute\nAs new solutions are developed, work with product and engineering teams to author processes to define repeatable use of components\nWork with implementation team and product manager on go to market documentation for external consumption and integration\nWork with product manager to define priorities for scrum team work to accomplish commitments\nWork within one or more scrum teams, providing direction to teams working on implementation and testing of assigned features\nWork with implementation teams to estimate efforts associated with new work\nExperience with agile development methodologies and product management practices\n\n\nKnowledge And Experience\n\n\n5+ years of experience\nUndergraduate degree required - Computer science preferred, but can be combination of some CS knowledge with business\nGood technical writing skills - working with developers to be able to write documentation for developers to get rapid and high quality integration with platform APIs.\nGood interpersonal skills\nStrong problem-solving skills\nMortgage industry experience (preferred) or financial services industry experience\nFamiliarity with cloud-based platforms and technologies (preferred)\nExperience with agile development methodologies and product management practices (preferred)\n\n\nSchedule\n\nThis role offers work from home flexibility of one day per week.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-ice-3964539704?position=9&pageNum=77&refId=x7m7XCf9mecSRbX%2FzrmwDg%3D%3D&trackingId=WnCdzfJ62E1hRm8Vz%2B45wg%3D%3D"
}