{
    "job_id": "3970153109",
    "title": "Lead Business Analyst -Exchange Traded Derivative",
    "company": "EPAM Systems",
    "location": "Pune, Maharashtra, India",
    "description": "We are seeking a Lead Business Analyst with expertise in ETD/OTC to join our team.\n\nAs a Lead Business Analyst with expertise in Exchange Traded Derivatives (ETD) and Over-the-counter (OTC) traded financial instruments, you will play a critical role in analyzing and understanding the impact of market and regulatory changes on the IT F2B stack. With a focus on the clearing business, you will leverage your deep knowledge to contribute to the lifecycle and markets of ETD and OTC products.\n\nStart an exciting new chapter in your career with EPAM!\n\nResponsibilities\n\n\n\nAnalyze and interpret market and regulatory changes affecting ETD and OTC traded financial instruments\nContribute to the lifecycle and markets of ETD and OTC products\nUtilize strong stakeholder management and communication skills to collaborate effectively with internal and external partners\nQuery data sources using mid-level SQL skills for in-depth analysis\nProvide valuable inputs on modern software development processes like Agile and incremental delivery\n\n\n\nRequirements\n\n\n\n8-12 years of experience in Business Analysis with a focus on ETD and OTC\nDeep understanding of the Clearing business, specifically ETD (Must Have) and OTC (Ideally including products)\nAbility to analyze and interpret market and regulatory changes and their impact on the IT F2B stack\nProficiency in querying data sources with mid-level SQL skills\nExperience in modern software development processes such as Agile and incremental delivery\nStrong analytical and problem-solving skills\nEffective stakeholder management and communication skills\n\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/lead-business-analyst-exchange-traded-derivative-at-epam-systems-3970153109?position=10&pageNum=57&refId=a19Gt2bufEipNHhOPT%2FEtw%3D%3D&trackingId=oYWPdOtHaCGam8paOIeMnQ%3D%3D"
}