{
    "job_id": "3979317029",
    "title": "Business Analyst - Reconciliation",
    "company": "Nium",
    "location": "Mumbai, Maharashtra, India",
    "description": "Nium, the Leader in Real-Time Global Payments \n\n \n\nNium, the global leader in real-time, cross-border payments, was founded on the mission to deliver the global payments infrastructure of tomorrow, today. With the onset of the global economy, its payments infrastructure is shaping how banks, fintechs, and businesses everywhere collect, convert, and disburse funds instantly across borders.  \n\nIts payout network supports 100 currencies and spans 220+ markets, 100 of which in real-time. Funds can be disbursed to accounts, wallets, and cards and collected locally in 35 markets. Nium's growing card issuance business is already available in 34 countries. Nium holds regulatory licenses and authorizations in more than 40 countries, enabling seamless onboarding, rapid integration, and compliance – independent of geography. The company is co-headquartered in San Francisco and Singapore. \n\n\n\n\nAbout the Team:\n\n \n\nYou will be part of the Financial Reconciliation Team focusing on Development of the internal reconciliation tool (SPOC) for all the products of NIUM. \n\n\n\n\nKey Responsibilities\nIn your role you would need to –\nHave a strong understanding of bank reconciliation processes (Cross Border Remittances, Card Transactions, Wallet Transactions), implications, risks, and controls\nUnderstand reconciliation & accounting requirements and articulate the same to the technology team\nWriting and executing business requirement documents, functional specs, test cases\nWorking with technology team and business users for successful rollout of product features and processes\nWork with Nium’s Product and Platform teams for integrating with new banks, payment gateways, card schemes/processors and other data sources required for reconciliation\nDevelop & maintain the product roadmap for Nium’s Global Reconciliation Platform o Define, track and maintain project delivery timelines across various teams – Product,\nPlatform, Tech, Operations & Financeo Prepare weekly/monthly/annually reports on priorities and development rollouts.o Make exceptions visible to the Operational Leadership team on a timely basis is very\nkey to the success in the role. \n\n\n\n\n\nRequirements\nGood understanding of the nuances of a Reconciliation Platform and of accounting, reporting & internal controls\n5+ years of experience with existing/off-the-shelf reconciliation platforms e.g., Intellimatch, ReconArt, etc.\nStrong hands-on knowledge experience in Payments or Cards or Wallets or all in a multicurrency environment\nGood understanding of payment formats like SWIFT/ACH, currencies, payment gateways, operational risk around payments.\nWorked with Operations and Finance teams to meet their requirements within defined timelines.\nShould have actively worked on large and mid-sized technology projects\nShould have in-depth understanding of SDLC\nSelf-driven and a go getter who is comfortable in dealing with open ended problems.\nIs solution oriented and can come up with solution options for problem statements. \n\n\n\n\n\n\n\n\nWhat we offer at Nium  \n\n \n\nWe Value Performance: Through competitive salaries, performance bonuses, sales commissions, equity for specific roles and recognition programs, we ensure that all our employees are well rewarded and incentivized for their hard work. \n\nWe Care for Our Employees: The wellness of Nium’ers is our #1 priority. We offer medical coverage along with 24/7 employee assistance program, generous vacation programs including our year-end shut down. We also provide a flexible working hybrid working environment (3 days per week in the office). \n\nWe Upskill Ourselves: We are curious, and always want to learn more with a focus on upskilling ourselves. We provide role-specific training, internal workshops, and a learning stipend\n\nWe Constantly Innovate: Since our inception, Nium has received constant recognition and awards for how we approach both our business and talent opportunities.\n\n-2022 Great Place To Work Certification\n\n-2023 CB Insights Fintech 100 List of Most Promising Fintech Companies. \n\n- CNBC World’s Top Fintech Companies 2024.\n\nWe Celebrate Together: We recognize that work is also about creating great relationships with each other. We celebrate together with company-wide social events, team bonding activities, happy hours, team offsites, and much more!  \n\nWe Thrive with Diversity: Nium is truly a global company, with more than 33 nationalities, based in 18+ countries and more than 10 office locations. As an equal opportunity employer, we are committed to providing a safe and welcoming environment for everyone.  \n\n \n\nFor more detailed region specific benefits :  https://www.nium.com/careers#careers-perks \n\n \n\nFor more information visit www.nium.com \n\nDepending on your location, certain laws may regulate the way Nium manages the data of candidates. By submitting your job application, you are agreeing and acknowledging that you have read and understand our Candidate Privacy Notice located at www.nium.com/privacy/candidate-privacy-notice.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-reconciliation-at-nium-3979317029?position=10&pageNum=62&refId=9DAZTOuB47vYA4MZxFKVVA%3D%3D&trackingId=1klOkurK2mMx7MF0RzheMg%3D%3D"
}