{
    "job_id": "3979179420",
    "title": "Business Operations Analyst",
    "company": "Qualcomm",
    "location": "Bengaluru, Karnataka, India",
    "description": "Company\n\nQualcomm India Private Limited\n\nJob Area\n\nOperations Group, Operations Group > Business Operations\n\nQualcomm Overview\n\nQualcomm is a company of inventors that unlocked 5G ushering in an age of rapid acceleration in connectivity and new possibilities that will transform industries, create jobs, and enrich lives. But this is just the beginning. It takes inventive minds with diverse skills, backgrounds, and cultures to transform 5Gs potential into world-changing technologies and products. This is the Invention Age - and this is where you come in.\n\nGeneral Summary\n\nAbout GBFS Team: The Global Business and Finance Support (GBFS) team provide support to HQ and global regional team on Finance & Business Operation activities. This job role is for business operation related activities – Demand & Supply Planning, Inventory Analysis, system updates and data loaders, data validation and analytics, supply chain demand planning and basic analytics.\n\nJob Overview\n\n\nIndividual Responsibilities (transactional and analytics) - month-end activities and reporting, business units/revenue packages and reporting, system updates and data loaders for demand and supply units and supply chain units demand and forecast numbers preparation, HC tracking summary, project mapping, system updates.\nSupport stakeholders with weekly/monthly reports for inventory tracking, backlog and shipment reports, data gathering and reports submission.\nEnsure accurate and timely completion of activities with complete ownership and accountability.\nWorking closely with HQ and global region teams with regular interaction to reviews, drive transition calls, process documentation for all activities.\nIndividual will require to take evening calls for reviews and transition of activities.\nPerform additional ad hoc business operations activities from time to time.\n\n\n\nRequirements\n\n\n2 to 4 years relevant industry experience in business analyst & operations activities\nExcellent Advance Excel Skills\nAbility to focus on details, multitasking and perform activities timely with quality output.\nPositive attitude and willingness to learn and upskills with tools – Tableau, Power BI etc.\nFlexible for evening calls (8PM – 11PM IST) for HQ reviews and transition calls on regular basis.\nStrong analytical, problem solving and conceptual skills.\nStrong written and verbal communication skills.\n\n\n\nEducation Requirements\n\n\nBachelor's in science / B Tech / commerce / economics and/or,\nDiploma in Business Analytics\nBusiness Administration from reputed B-school.\n\n\n\nApplicants: Qualcomm is an equal opportunity employer. If you are an individual with a disability and need an accommodation during the application/hiring process, rest assured that Qualcomm is committed to providing an accessible process. You may e-mail myhr.support@qualcomm.com or call Qualcomm's toll-free number found here. Upon request, Qualcomm will provide reasonable accommodations to support individuals with disabilities to be able participate in the hiring process. Qualcomm is also committed to making our workplace accessible for individuals with disabilities.\n\nQualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and/or proprietary information, to the extent those requirements are permissible under applicable law.\n\nTo all Staffing and Recruiting Agencies: Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.\n\nIf you would like more information about this role, please contact Qualcomm Careers.\n\n3063714\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-operations-analyst-at-qualcomm-3979179420?position=9&pageNum=2&refId=dmyDsuYITNpOArSK52WyDg%3D%3D&trackingId=md1bkBOPmh%2FZXUHpAHaBWQ%3D%3D"
}