{
    "job_id": "3982666652",
    "title": "Lead Business Analyst [T500-11820]",
    "company": "Delta Air Lines",
    "location": "Bengaluru, Karnataka, India",
    "description": "About Delta Tech Hub:\n\nDelta Air Lines (NYSE: DAL) is the U.S. global airline leader in safety, innovation, reliability and customer experience. Powered by our employees around the world, Delta has for a decade led the airline industry in operational excellence while maintaining our reputation for award-winning customer service. With our mission of connecting the people and cultures of the globe, Delta strives to foster understanding across a diverse world and serve as a force for social good. Delta has fast emerged as a customer-oriented, innovation-led, technology-driven business. The Delta Technology Hub will contribute directly to these objectives. It will sustain our long-term aspirations of delivering niche, IP-intensive, high-value, and innovative solutions. It supports various teams and functions across Delta and is an integral part of our transformation agenda, working seamlessly with a global team to create memorable experiences for customers.\n\n\n\n\nRESPONSIBILITIES:\n\nWork cross functionally within IT and the business to understand end to end Ticketing processes that include but not limited to Internal and external ticketing processes, Change, Cancel, Refund, Credit card and settlement processes.\nSupport Strategic Initiatives and Epics/Features which impact Ticketing domain and provide support to other domains that depend on Ticketing.\nPartner with other teams internally and externally on technical set-up and readiness, ensure test systems are in sync and functioning and work to resolve any identified issues.\nGather, develop, coordinate, and maintain business requirements for various projects and/or systems from initial phase to final implementation, assuring requirements meet standards; troubleshoot issues, coordinate timelines, maintain and communicate project status reports and tracking\nInteract closely with internal/external customers to understand business processes, customer requirements, project schedules, and level of satisfaction\nResearch, analyze, and resolve ad-hoc customer problems and questions in a positive, timely and professional manner\nEffectively communicate status on activities and issues to customers and manager on a regular basis both verbally and in writing\nMaintain documentation of Meeting minutes, Design discussions, Planning notes, Dev status, test results, processes, known issues, etc. to facilitate communication and knowledge sharing across the team\nManage user stories and deliverables in Version One\n\n\n\n\nWHAT YOU NEED TO SUCCEED (MINIMUM QUALIFICATIONS):\n\n6-10 years of IT and/or business or any equivalent combination of experience, education, and/or training\n3-5 years’ experience working on TPF applications in an airline domain.\nPrior experience working with ticketing and/or GDS is a plus with an understanding of architectural flows and how technologies operate/integrate.\nHands on experience as a Business Analyst and writing Business Requirements.\nDemonstrated skills in process mapping, analytical, technical, and proven problem-solving skills\nAbility to create detailed, well-written documentation for a variety of audiences\nCandidate must have the ability to deliver quality work on time and translate planning into action as well as anticipate and address barriers\nStrong communication, relationship management and influencing skills needed to work in partnership with internal teams\nResearch, analyze, and resolve ad-hoc customer problems and questions in positive, timely and professional manner\n1st tier production triage/maintenance for Severity 3-5 defects.\nEffectively communicate status on activities and issues to customers and manager on a regular basis both verbally and in writing\nMaintain documentation of test results, processes, known issues, etc. to facilitate knowledge sharing across the team\nHigh level of motivation, drive and confidence to step outside comfort zones when placed in new environment.\nAbility to multi-task, and be detail oriented\nAbility to quickly adapt to new tools and evolving technologies.\nMust be performing satisfactorily in present position\n\n\n\n\nWHAT WILL GIVE YOU A COMPETITIVE EDGE (PREFERRED QUALIFICATIONS):\n\nExcellent written, oral and communication skills\nExperience working with diverse teams located in various countries\nMust be able to prioritize work on multiple project teams, with the overall goal of satisfying all deployment needs and effectively supporting diverse clients.\nKnowledge of the Agile development methodologies and corresponding tools (ex. VersionOne)\nProject Management experience and previous airline business experience is preferred\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/lead-business-analyst-t500-11820-at-delta-air-lines-3982666652?position=8&pageNum=5&refId=lj%2BaylP9Zxb0xcLPbmF98Q%3D%3D&trackingId=tLveSi2403efKR16Nomkyw%3D%3D"
}