{
    "job_id": "3987843038",
    "title": "Senior Business Analyst",
    "company": "Arcadis",
    "location": "Hyderabad, Telangana, India",
    "description": "Job Description\n\nDevelop and manage detailed business and functional requirements to scope out the ideas to detail needed by\n\nvarious teams.\n\n◊ Develop the product backlog with instructive to-do list and manage its priority.\n\n◊ Work with the product managers and stakeholders to create user story and ensure that the user stories map with\n\napproved business requirement.\n\n◊ Facilitate cross-functional meetings and discussions and create a channel of clear communication.\n\n◊ Ability to explain complex concepts simply and persuasively.\n\n◊ Ensure timely deliveries with effective co-ordination.\n\n◊ Create and maintain comprehensive project documentation.\n\n◊ Active participation in Sprint Planning, Backlog Grooming and Sprint Retrospective.\n\n◊ Conduct on-boarding sessions for new team members.\n\n◊ Provide analytical support to business team, testing team and development team by maintaining reports to track\n\nperformance\n\n◊ Coordinate with Design team to coordinate prototyping and verifying that prototypes meet business requirement.\n\n◊ Coordinate with QA team for product testing and quality management.\n\n◊ Develop and manage product documentation like technical manual, operational manual, configuration manual\n\nand maintenance manual.\n\n◊ Provide product training to end users and troubleshoot their challenges.\n\nQualifications\n\nAt least 5 to 8 years of experience as a Business Analyst preferably for a transportation/mobility product.\n\n◊ Experience in Agile Development methodologies with active participation in scrum management is a must.\n\n◊ Hands-on experience with Jira or similar project management software is a must.\n\n◊ Understanding of SDLC\n\n◊ Fluency in MS Office\n\n◊ Strong written and verbal communication skill\n\n◊ Strong problem solving and analytical skill\n\n◊ Experience in Agile methodology as a Scrum Master\n\nAdditional Information\n\nWhy Arcadis?\n\nWe can only achieve our goals when everyone is empowered to be their best. We believe everyone's contribution matters. It’s why we are pioneering a skills-based approach, where you can harness your unique experience and expertise to carve your career path and maximize the impact we can make together.\n\nYou’ll do meaningful work, and no matter what role, you’ll be helping to deliver sustainable solutions for a more prosperous planet. Make your mark, on your career, your colleagues, your clients, your life and the world around you.\n\nTogether, we can create a lasting legacy.\n\nOur Commitment to Equality, Diversity, Inclusion & Belonging:\n\nAs an Equal Opportunity Employer, we are proud to support the growth and equality of our people through initiatives like our Mentorship Program, Global Women’s Network, and Diversity & Inclusion Council. We welcome applications from all suitably qualified candidates regardless of age, race, disability, gender reassignment, marriage and civil partnership, pregnancy and maternity, religion or belief, sex and sexual orientation.\n\nJoin Arcadis. Create a legacy.\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-arcadis-3987843038?position=2&pageNum=15&refId=rYf7Kk8Eb63jO7gIoGSEug%3D%3D&trackingId=nGxht4rRHrU5%2FmlCqMdq%2BQ%3D%3D"
}