{
    "job_id": "4021232827",
    "title": "Business Operations Analyst",
    "company": "HighPoints Technologies India (P) Ltd",
    "location": "Bengaluru, Karnataka, India",
    "description": "Location: Bangalore\n\nScope\n\n Works as part of the Oracle University (OU) delivery operations team\n\n Reports to the Operations Manager\n\n Regularly provides status updates on progress of tasks/work\n\n Understanding and analysing reports for business need\n\n Collaborates with sales and operations organisations for any kind of business support\n\n Manage end to end Supplier change management job\n\nResponsibilities\n\n Maintain the integrity of sales records, working with sales and internal operations team\n\n Running reports for sales intelligence and forecasting by building analysis in Oracle\n\nBusiness Intelligence\n\n Review collected data for accuracy, and present findings to the Operations\n\nDirector/Manager\n\n Excellent understanding of all tools and applications to ensure that all business\n\ndeals are managed smoothly\n\n Provide support to sales member for structuring of deals and processing deals in the\n\nsystem\n\n Handle or escalate issues and queries connected to the data collection and\n\nprocessing process, quickly, accurately and professionally.\n\n Develop and maintain good working relationships with internal support groups\n\n(shared service centre), to ensure data processing is managed in a timely and\n\naccurate manner.\n\n Manage the flow of order booking, invoicing, revenue, in a timely fashion\n\n Manage the flow from Purchase request till Purchase Order closing on time.\n\n Operate in line with Oracle and OU business policies and procedures, ensuring sales\n\nadherence to business practices.\n\n Maintain documentation of the processes related to Sales transactions.\n\nProfile\n\n Experience in Essential functions – 5-7 years\n\n Highly computer literate - Essential\n\n Excellent English Verbal And Written Communication Skills – Essential\n\n Advanced MS Excel skills – Essential\n\n Experience in building analysis and dashboards in Oracle Business Intelligence (OBI\n\nEE) – Good to have\n\n Knowledge of SQL and experience of running SQL queries in Oracle SQL developer\n\n– Good to have\n\n Experience in using Oracle Sales Cloud (Fusion CRM) – Good to have\n\n Accuracy and attention to detail\n\n Excellent planning, Organising and Presentation skills, ability to prioritize\n\nworkload\n\n Team player\n\n Personal drive\n\n Professional attitude\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-operations-analyst-at-highpoints-technologies-india-p-ltd-4021232827?position=7&pageNum=45&refId=UbUFWb7IHPllL5XcmhINQg%3D%3D&trackingId=c4giwzbY0uJMiIe%2BX6WFaA%3D%3D"
}