{
    "job_id": "4021721982",
    "title": "Business Analyst-Manufacturing",
    "company": "AsalJobs",
    "location": "Pune, Maharashtra, India",
    "description": "Business Analyst - Manufacturing\n\nJob Description\n\nAs a Business Intelligence Analyst, you will play a pivotal role in analyzing business processes, identifying areas for improvement, and providing data-driven insights to support strategic decision-making. Working closely with cross-functional teams, you will understand business requirements, streamline operations, and contribute to organizational growth. The ideal candidate will possess a strong analytical mindset, excellent communication skills, and a proven track record of delivering actionable recommendations in a manufacturing setting.\n\nQualifications\n\n\nBachelor's degree in Mechanical Engineering or Statistics.\nMinimum 5 years of experience as a Business Analyst.\n\n\nSkills And Specialization\n\n\nDemonstrated experience as a Business Analyst in the manufacturing sector, particularly in the Indian market.\nProficiency in analyzing complex data sets using tools such as Excel, SQL, and statistical software.\nExcellent communication skills, with the ability to present findings and recommendations effectively.\nStrong problem-solving abilities and attention to detail.\nAbility to work collaboratively in a cross-functional team environment and manage multiple priorities. Responsibilities:\nGather and analyze data from various sources to generate insights and develop actionable recommendations.\nMonitor and evaluate key performance indicators (KPIs) to track manufacturing performance and identify improvement opportunities.\nCollaborate with stakeholders across departments to understand business needs and translate them into clear requirements.\nDevelop and maintain dashboards, reports, and performance metrics to track key business KPIs.\nAssist in the implementation of new systems, tools, and processes to enhance operational efficiency and productivity.\nProvide management with reports stating trends, patterns, and predictions using relevant data.\nParticipate in cross-functional projects and initiatives to drive continuous improvement and innovation.\n\n\nPlease Read the JD Carefully if it matches with your skill sets then apply.\n\nRegards\n\nGurpreet Kaur\n\nAsal Jobs\n\nSkills: excel,sql,statistical software\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-manufacturing-at-asaljobs-4021721982?position=6&pageNum=35&refId=Qg1XFYd2a5oBsKA4VCuZSA%3D%3D&trackingId=DxM4yfvjTmsAFV9hxhPmew%3D%3D"
}