{
    "job_id": "4037127359",
    "title": "Service Now Business Analyst",
    "company": "CodersBrain",
    "location": "Pune, Maharashtra, India",
    "description": "Hi,\n\nGreetings Of The Day,\n\nExperiance :8+YEars\n\nDuties And Responsibilities\n\nDemonstrate experience eliciting requirements using interviews, document analysis,\n\nrequirements workshops, surveys, business process reviews, and task and workflow\n\nanalysis. Analyze and de-conflict requirements, data and information from multiple\n\ndata sources and decompose into detailed requirements.\n\nDevelops/modifies application documentation for on-call, downtime and request\n\nprocessing as evidenced by maintaining updated and technically current Technology\n\nServices policies and procedures. Responds to and supports system issues/requests as\n\nevidenced by following documented on call, downtime, and request for service\n\nprocedures in accordance with Technology Services documentation standards.\n\nDefines modifications to application software or databases to address system\n\nfunctions, and enhancements and assists end users in developing system requirements\n\nin accordance with Technology Services standards.\n\nDesigns and prepares technical specifications, project documentation, workflow\n\nanalysis to meet system and project needs in accordance with Technology Services\n\nstandards.\n\nProvides application support and enhancements to existing applications, defines\n\nsystem requirements, priorities, and alternatives. Coordinates efforts of staff to install,\n\ntest and maintain computer software systems by following change control procedures.\n\nCoordinates system upgrades, conversions and interfaces.\n\nManages all phases of testing as evidenced by preparation of test scripts and\n\nconversion plans. Participates in testing and validation of test results and obtains end\n\nuser acceptance sign-off in accordance with Technology Services documentation\n\nstandards.\n\nCoordinates and directs project staff to assure projects/requests are completed within\n\ntime tables and objectives met as evidenced by project plan and status reports for\n\nproject oversight. Provides project management leadership as evidenced by project\n\nplanning, problem resolution, change control and quality assurance in accordance\n\nwith established policy.\n\nEvaluates impact present and or proposed systems have/will have on the organization\n\nas evidenced by detailed cost/benefit, statistical and impact analysis. Develops system\n\ndocumentation as evidenced by completed policy, procedures, and system\n\nspecifications, in accordance with Technology Services documentation standards.\n\nAssists end users in development of departmental policies and procedures as it relates\n\nto the application. Adheres to applications security and control procedures in\n\naccordance with departmental, vendor, and regulatory bodies. Educates end users on\n\nrequirements and policies as they relate to these procedures.\n\nFacilitates assignment, prioritization, and resolution of issues. Communicates status\n\nand closure with end users and escalates to manager as required.\n\nUses effective customer service skills to maintain vendor and user relationships and\n\ncommunicates accordance with Technology Services documentation standards.\n\nLeads project task force meetings or work groups. Creates meeting agendas, project\n\ncorrespondence and meeting minutes in accordance with Technology Services\n\ndocumentations standards.\n\nLeads in conducting system investigations to determine functional and technical\n\nrequirements, feasibility of application in our environment, cost, and\n\nsupport/maintenance as evidenced by end user and vendor discussions.\n\nidentifies the best fit for processes and systems through analysis of software packages,\n\nmaking appropriate recommendations for best fit, as evidenced by user approval\n\ndocumentation, in accordance with IS documentation standards.\n\nParticipates in vendor demos, site visits, and reference calls as evidenced by\n\ncompletion of demo scripts and reference call questionnaires, in accordance with\n\nTechnology Services documentation.\n\nRemains current on system tools/methodologies. Participates in in-services and\n\neducational programs for professional development. Transfers knowledge to staff and\n\nmakes recommendations for team/Analyst training programs to manager, in\n\naccordance with department budget and strategic plan.\n\nAssists in the initial screening of applicant by reviewing resumes, or conducting\n\ninterviews, reporting impressions/findings to the manager or Director.\n\nAssists in the orientation of staff by providing training and mentoring, as evidenced by the\n\ncompletion of the training program set forth by the Manager. Serves as a resource for\n\nother analysts in the resolution\n\nSkills:: ServiceNow Business Analyst\n\nService Now Integration and ServiceNow Implementation\n\nWork into ServiceNOw platform.\n\nSkills: servicenow,business analysis,integration\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/service-now-business-analyst-at-codersbrain-4037127359?position=8&pageNum=65&refId=c7sH5y8Mkcxycc0ZQ9ncOA%3D%3D&trackingId=WdF8mFELY6R5CjtUC7xTqQ%3D%3D"
}