{
    "job_id": "4037957787",
    "title": "Business Analyst – Trainer",
    "company": "Simplify Software Experts Pvt Ltd",
    "location": "Navi Mumbai, Maharashtra, India",
    "description": "Simplify Software Experts (www.simplifysoftwareexperts.com) is a rapidly growing information technology service company & fulfilling Recruitment and Contingent staffing (IT & Non-IT) Requirements on a Global Level. We serve you with a highly qualified team that is up-to-date with the latest technologies and operates from India, Germany, the USA, the UK, Canada, Mexico, and other Asian countries in Ecommerce, Finance, Healthcare, Banking, Insurance, and Product/Manufacturing.\n\n100% repeat business (Past 5 years)-Our customers keep coming back to us\n\n80% employee retention (Past 5 years)-Our employees succeed and grow with us\n\nSustained growth rate of 200% (Past 3 years)-Together we are all progressing\n\nWe are growing quickly and need to add dynamic, motivated and talented people to our world-class organization. A startup company; we are growing at an incredible pace and are looking to grow & build our team.\n\nWe have an urgent position with our client; below are the Job Details Kindly take a look & let us know your comfort level too.\n\nJob Title: Business Analyst – Trainer\n\nExp: 3 – 6 Years\n\nLocation: Navi Mumbai\n\nIndustry: Preferably from a Technology, ITES, Shared Services or Banking organization\n\nCertifications: PMI-BA, CBAP, CCBA, CSBA or similar will be desirable.\n\nJob Description\n\nExperience/ Qualifications\n\n\nMinimum of 2 years as a Business Analyst\nMaximum of 3 years of total experience.\n\n\nRoles & Responsibilities\n\n\nDevelop training modules and deliver training regarding the business application in both the training centre as well as online.\nReady to travel to various RBI locations across the country as per training requirements.\nPerform Requirement Management (Gathering, Analysis, Discussion with Stakeholders, Modelling and Documentation)\nPerform feasibility analysis, gap analysis, scope projects, and work with the project management team to prioritize deliverables and negotiate on product functionalities\nOwn BRD, SRS, User Story, Use Case, User Manual and similar SDLC artefacts\nDesign and validate functional workflows and write UAT Test cases\nReview of Functional documents, Test Plans and Test Cases from external teams\nParticipate in Integration Testing, User Acceptance Testing and Functionality Testing\nAct as a liaison between end-users, technical teams\nSufficient familiarity concerning Agile (SCRUM) and traditional waterfall projects\nPartner across stakeholders to identify and consolidate requirements into a single repository for tracking and change management\nProficient in MS Office Suite (Word, Excel, Project, PowerPoint and Visio)\nPerform other duties as assigned or requested by PMO or IT Project Manager\n\n\nSkills: it,training,business analysis,organization,projects,technology,teams,project\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-%E2%80%93-trainer-at-simplify-software-experts-pvt-ltd-4037957787?position=3&pageNum=50&refId=%2FVyrdZh82hXsETPuNBCAVQ%3D%3D&trackingId=cKf%2FpM6N7sRGVtUbfr0ueQ%3D%3D"
}