{
    "job_id": "4042554460",
    "title": "Business Analyst - Cross-Border Payments",
    "company": "YO IT CONSULTING",
    "location": "Bangalore Rural, Karnataka, India",
    "description": "Product Owner/Business Analyst\n\nLocations - Bangalore, Hyderabad, Pune\n\nExperience: 8 to 15 Years\n\nJob Description\n\nWe are looking for a highly skilled Product Owner/Business Analyst with deep expertise in Payments, particularly in Cross-Border Payments, RTP, RTGS, and message formats such as MT and ISO20022. This role involves working closely with business stakeholders and technology teams to deliver innovative payment solutions for global banks.\n\nAs a Product Owner/Business Analyst, you will be responsible for defining business requirements, translating them into technical solutions, and managing end-to-end project delivery in a fast-paced environment.\n\nKey Responsibilities\n\n\nLead the analysis and design of payment solutions with a focus on Cross-Border Payments, RTP (Real-Time Payments), and RTGS (Real-Time Gross Settlement).\nGather and document business requirements and translate them into functional specifications for payment systems.\nEnsure that payment solutions are compliant with MT message standards and ISO20022 messaging protocols.\nCollaborate with technology teams to ensure successful implementation of payment solutions and system enhancements.\nAct as a Product Owner, defining the product roadmap, prioritizing features, and ensuring alignment with business goals.\nAnalyze current payment processes and workflows, identifying opportunities for automation, optimization, and scalability.\nConduct impact analysis and ensure alignment with global banking regulations and industry standards.\nEngage with stakeholders from various global banking functions, including compliance, risk, and operations, to deliver integrated payment solutions.\nLead and participate in Agile ceremonies (such as sprint planning, retrospectives, and daily stand-ups) to ensure smooth project execution.\nProvide thought leadership on industry best practices in payments, offering strategic insights and innovative solutions.\n\n\nMandatory Skills & Experience\n\n\nMinimum 8 years of experience as a Product Owner or Business Analyst in the Payments domain, particularly with experience in Cross-Border Payments, RTP, and RTGS.\nStrong knowledge of payment message formats including MT standards and ISO20022.\nExperience working in global banks or financial institutions with a focus on payment systems.\nProven ability to define product vision, roadmap, and deliver end-to-end payment solutions.\nFamiliarity with regulatory and compliance requirements for payments in global banking environments.\nExcellent communication and stakeholder management skills, with the ability to collaborate across business and technology teams.\n\n\nDesired Skills\n\n\nExperience in working with Agile methodologies and frameworks as a Product Owner.\nStrong analytical skills with the ability to troubleshoot and solve complex payment-related issues.\nKnowledge of payment infrastructures, clearing and settlement mechanisms, and regulatory standards for global payments.\nCertifications such as Certified Scrum Product Owner (CSPO) or Certified Business Analysis Professional (CBAP) are an added advantage.\n\n\nQualifications\n\n\nBachelor’s degree in Finance, Business, Information Technology, or a related field.\nMinimum of 8 years of experience in the payments domain within global banks.\nProven track record of delivering payment solutions in a fast-paced, dynamic environment.\n\n\nSkills: cspo,stakeholder management,scrum product ownership,regulatory and compliance,rtp,product owner,communication skills,certified business analysis professional (cbap),finance,iso20022,business requirements,industry best practices,agile methodologies,analytical skills,payments,financial institutions,payment systems,certified scrum product owner (cspo),regulatory standards,agile ceremonies,cbap,rtgs,mt message standards,business analyst,global banking regulations,cross-border payments,mt standards,payment solutions,business analysis\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-cross-border-payments-at-yo-it-consulting-4042554460?position=3&pageNum=80&refId=A63P04dNUmAIICc%2BzvhEHA%3D%3D&trackingId=zs4%2FtI%2BHjqf38Vkaa72hTQ%3D%3D"
}