{
    "job_id": "4044732431",
    "title": "IN_Associate_Business Analysis & Project Consulting_Agriculture_Advisory_Noida",
    "company": "PwC India",
    "location": "Noida, Uttar Pradesh, India",
    "description": "Line of Service\n\nAdvisory\n\nIndustry/Sector\n\nNot Applicable\n\nSpecialism\n\nOperations\n\nManagement Level\n\nAssociate\n\nJob Description & Summary\n\nA career in our Government and Public Sector Transformation Management practice, within General Consulting services, will provide you with the opportunity to help clients seize essential advantages by working alongside business leaders to solve their toughest problems and capture their greatest opportunities. We work with some of the world’s largest and most complex companies to understand their unique business issues and opportunities in an ever changing environment. We help create sustainable change by stimulating innovation, unlocking data possibilities, navigating risk and regulatory complexity, optimising deals, and aligning costs with business strategy to create a competitive advantage.\n\nIn joining, you’ll help federal, state and local government clients solve complex business issues and manage jurisdiction related risk. You’ll help our clients assess their operational and security and data management strategies so they can continue to operate more efficiently and effectively, both today and tomorrow.\n\n\nWhy PWC\n\n\n\nAt PwC, you will be part of a vibrant community of solvers that leads with trust and creates distinctive outcomes for our clients and communities. This purpose-led and values-driven work, powered by technology in an environment that drives innovation, will enable you to make a tangible impact in the real world. We reward your contributions, support your wellbeing, and offer inclusive benefits, flexibility programmes and mentorship that will help you thrive in work and life. Together, we grow, learn, care, collaborate, and create a future of infinite experiences for each other. Learn more about us.\n\nAt PwC, we believe in providing equal employment opportunities, without any discrimination on the grounds of gender, ethnic background, age, disability, marital status, sexual orientation, pregnancy, gender identity or expression, religion or other beliefs, perceived differences and status protected by law. We strive to create an environment where each one of our people can bring their true selves and contribute to their personal growth and the firm’s growth. To enable this, we have zero tolerance for any discrimination and harassment based on the above considerations. \"\n\nJob Description & Summary: At PwC, our purpose is to build trust in society and solve important problems. We’re a network of firms in 157 countries with more than 300,000 people who are committed to delivering quality in Assurance, Advisory and Tax services. Within Advisory, PwC has a large team that focus on transformation in Government through Digital inclusion. The open position is for a candidate who desires to work with government clients and bring about a change in society. A successful candidate will be expected to work pro-actively and effectively on multiple client engagements over the period of time and take ownership of the entire project delivery he/she entrusted with.\n\nResponsibilities: The incumbent will primarily work under the overall guidance of Central\n\nPMU and report to the state-\n\nlevel authorities. The broad role typically entails the following activities -\n\n Identify Primary Agriculture Credit Society for computerization in the\n\nstate\n\n Liaise with stakeholders to gather state-specific needs and communicate\n\nthe same to Central\n\nPMU/System Integrators\n\n Provide management/technical support for project implementation and\n\npost-implementation,\n\nas well as prepare necessary MIS reports applicable to the state\n\n Monitor the implementation progress in the state and follow up with\n\nstakeholders as necessary\n\nfor issue resolution\n\n Facilitate capacity building for the state\n\nBroad Experience & Expertise Requirements\n\n The role requires a candidate with technology/ consulting/ business\n\nanalysis/ project\n\nmanagement / accounting experience of 3+ years\n\n Candidates with exposure to Cooperatives/ Rural Banking/ AgriTech or\n\nGovTech exposure in\n\nRural India will be preferred\n\n Candidates having Agri-specific academic qualification/ diploma from\n\ninstitutes like MANAGE\n\nHyderabad, Vamnicom Pune, NIAM Jaipur, and NAARM Hyderabad are\n\nPreferred\n\n Proficiency in the local language is preferred\n\nSpecific Past Work Experience Requirements\n\n 3+ years of Business Analysis/ Technology/ Consulting/ Project\n\nmanagement experience\n\n Experience in the Government sector and Agriculture domain is highly\n\nPreferred\n\n Experience in Financial Services (Credit/Lending) or in accounting will\n\nalso be considered\n\n Experience in Banking, knowledge of Common Banking systems\n\ntechnology modules will be an\n\nadvantage.\n\nPersonalitytraits(must)\n\n Strong communications skills, both written and verbal\n\n Ability to handle complex assignments independently\n\n Ability to work with ambiguity. Taking a systematic, structured view of\n\nsituations.\n\n Ability to interact with client (senior government officials)\n\n Demonstrating willingness to ‘get hands dirty’ and developing a\n\nproblem-solving attitude\n\n Strong personal and professional presence and self-confidence, capable\n\nof working effectively with\n\nsenior team as well as all other levels.\n\nMandatory skill sets: Government Consulting, Banking, Rural India, Agriculture Domain,\n\nCooperative System, Communication, Collaboration, Stakeholder\n\nManagement, Project Monitoring\n\nPreferred skill sets: Government Consulting, Banking, Rural India, Agriculture Domain,\n\nCooperative System, Communication, Collaboration, Stakeholder\n\nManagement, Project Monitoring\n\nYears of experience required: 3+years\n\nEducation qualification: Equivalent of BSc or MSc in Agriculture/ MBA in Rural\n\nManagement or Agri Business\n\nEducation (if blank, degree and/or field of study not specified)\n\nDegrees/Field of Study required: Master of Science, Master of Business Administration, Bachelor of Science\n\nDegrees/Field Of Study Preferred:\n\nCertifications (if blank, certifications not specified)\n\nRequired Skills\n\nAgriculture Industry, Banking, Cooperative Systems\n\nOptional Skills\n\nDesired Languages (If blank, desired languages not specified)\n\nTravel Requirements\n\nAvailable for Work Visa Sponsorship?\n\nGovernment Clearance Required?\n\nJob Posting End Date\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/in-associate-business-analysis-project-consulting-agriculture-advisory-noida-at-pwc-india-4044732431?position=1&pageNum=47&refId=al9nUfzCZGF%2B%2BRebT5L1EA%3D%3D&trackingId=nl59B9BWX3m%2BRpaycMdhVQ%3D%3D"
}