{
    "job_id": "4048227915",
    "title": "Business Analyst",
    "company": "HEXANIKA",
    "location": "Pune, Maharashtra, India",
    "description": "Job Description: We have a job opening for Business Analyst (BA / QA) in Finance Domain to join our growing team. You will be responsible for eliciting, analyzing and managing client requirements. In addition, you will be required to carry out Testing related tasks as well. We are looking for people who are committed and flexible and who possess the right attitude to be part of an innovative organization. Exposure to Cloud and Big Data technology will be added advantage.\n\nResponsibilities\n\nBusiness Analyst:\n\nElicit and understand regulatory reporting requirements from a compliance perspective\n\nWrite requirement specifications that are aligned to Use Cases and business scenarios\n\nDefine product requirements/roadmap by identifying milestones, phases, and elements\n\nDetermine operational objectives by studying business functions, gathering relevant information, evaluating output requirements and formats\n\nStudy system capabilities and create process models and workflow diagrams as required\n\nWork closely with development team to resolve their queries regarding requirements\n\nCreate user documentation, providing help desk support and train users as and when required\n\nGather and document requirements for customer projects / implementation and define product configuration or change requests if any\n\nMaintain Product backlog and feature prioritization for product development scrums\n\nTesting\n\nShould be able to estimate Test efforts from requirements\n\nDesign Test scenarios, Test cases as per the requirements and execute them\n\nPossess thorough knowledge of Back-end testing using SQL Queries\n\nShould be able to perform data validation testing of the product\n\nAble to upload test results and defects using Test Management Tools\n\nExperience: 3 years of work experience\n\nCandidate Profile\n\nPost Graduate in Banking and/or Finance.\n\n3 years of experience in Financial (preferably banking) domain with exposure to regulatory compliance for US/European market\n\nProficiency in MS excel. Strong conceptual understanding of data modelling and testing environment\n\nShould be familiar with Use Case documentation\n\nInnovative mindset and meticulous attention to details.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-hexanika-4048227915?position=10&pageNum=80&refId=A63P04dNUmAIICc%2BzvhEHA%3D%3D&trackingId=IPT%2BpXWKxCBDfnrsFGCdnA%3D%3D"
}