{
    "job_id": "4050501844",
    "title": "Lead Business Analyst",
    "company": "Qualtech Edge",
    "location": "Noida, Uttar Pradesh, India",
    "description": "Job Title – Lead System Analyst\n\nOverview\n\nThe Lead System Analyst will review, analyze and evaluate business systems and user needs\n\nWill document requirements, define scope and objectives and formulate systems to address the overall business strategies\n\nWill be working with and sharing ideas, information and innovation with our highly qualified team of technologists\n\nShould collaborate with high-performing teams and individuals throughout the organization to accomplish common goals\n\nRoles And Responsibilities\n\nDetermine operational objectives by studying business functions; gathering information; evaluating output requirements and formats\n\nInteract with different stakeholders (Client, multiple development team, testing team) to deliver project within stipulated time.\n\nClient interactions, requirement gathering and management\n\nConstruct workflow charts and diagrams; studying system capabilities; writing specifications\n\nDefine project requirements by identifying project milestones, phases and elements\n\nMonitor project progress by tracking activity; resolving problems; publishing progress reports; recommending actions\n\nPerform daily, weekly and monthly reviews and analyses of current processes using operational metrics and reports\n\nSuggest changes to senior management using analytics to support your recommendations. Actively participate in the implementation of approved changes\n\nAbility to lead a team of 3 to 4 people\n\nQualifications And Skills\n\nBachelor or Master degree in Computer Science, Information Technology or equivalent academics.\n\nAn Individual with min. 5 years of relevant experience in Business Analysis role\n\nWell-versed with process of understanding business requirement and converting it into Requirement Specification document\n\nHands-on in preparing Business Requirement Document, Functional Specification Document, Use Case, User Stories, Wireframes, Prototypes etc,\n\nTeam Leading experience\n\nTrack project deliverables using appropriate tools\n\nGood understanding of MS word and excel.\n\nExcellent communication, presentation and interpersonal skills.\n\nPositive outlook with problem solving attitude.\n\nSkills: prototypes,wireframes,analytics,tracking activity,resolving problems,ms word,writing specifications,define project requirements,publishing progress reports,track project deliverables,studying system capabilities\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/lead-business-analyst-at-qualtech-edge-4050501844?position=3&pageNum=57&refId=a19Gt2bufEipNHhOPT%2FEtw%3D%3D&trackingId=iFvhs%2BM6glSDdu2k7RTEMA%3D%3D"
}