{
    "job_id": "4050512330",
    "title": "Business Analyst/Project Manager",
    "company": "Gigmo Solutions",
    "location": "Greater Delhi Area",
    "description": "About Us\n\nGigmo Solutions Pvt. Ltd is a fast-growing organization with global experience in the Information Technology and Services industry. We have a presence in several countries across the Americas, Europe, Africa, and Asia. With expertise in languages such as Spanish, Portuguese, French, Italian, German, and global English, our aim is to transform the customer support domain by leveraging a curated Gig workforce and cutting-edge AI technologies. As a Microsoft Partner, we provide technical support to our clients.\n\nRole And Responsibilities\n\n\nAs a Business Analyst/ Project Manager, you will be responsible for conducting exploratory and evaluative research, including feature analysis, competitor analysis, and concept testing.\nProvide a clear and compelling product vision and strategy based on market understanding, customer needs, and business goals.\nFacilitate requirement gathering, solution design, and propose the best solutions for software development projects.\nContribute to iterative product development and finalization, ensuring the deliverables meet quality standards.\nWrite and own the project requirements, including functional specifications, use cases, user stories, and workflow/process diagrams.\nCreate work breakdown structures and timelines, evaluate risks, and conduct user acceptance testing.\nAct as a liaison between business stakeholders and the project team, ensuring effective communication and addressing concerns.\nMonitor project progress, manage deliverables, and resolve issues that may arise during the project.\nClose the project by ensuring all deliverables are completed, conducting a post-project review, and transitioning ongoing responsibilities.\n\n\nCandidate Qualifications\n\n\nExperience: 9 to 14 years in Project Management or Business Analysis roles.\nStrong communication, leadership, and decision-making skills.\nAbility to understand product, users, and business context.\nResearch skills, including requirements gathering, analysis, and wireframing.\nProficiency in Project Management tools like MS Project, JIRA, etc.\nStrong organizational and planning skills with the ability to multitask.\nHigh level of motivation and self-starting attitude.\nExperience in people management and issue resolution.\nPM certification like PMI or PRINCE2 is a plus.\n\n\nRequired Skills\n\n\nPassion\nDrive\nCommunication\nLeadership\nDecision-making\n\n\nSkills: leadership skills,product vision,pm certification,risk evaluation,communication skills,project closure,organizational skills,solution designing,user acceptance testing,developer,systematic approach,use cases,roadmap,competitor analysis,business analyst,workflow/process diagrams,research skills,communication facilitation,wireframing,market understanding,data flow/data model diagrams,testing and validation,exploratory research,business goals,people management skills,roadblock address,development,evaluative research,project management skills,work breakdown structures,software development,review processes,motivation,project management,business analysis,issue resolution,multitasking skills,user stories,feature analysis,action plan,technology assistance,product owner,quality standards,programming,functional specifications,self-starting attitude,customer needs,concept testing,decision-making skills,planning skills,requirement gathering\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-project-manager-at-gigmo-solutions-4050512330?position=7&pageNum=32&refId=VFsnRMMnT7hGO1gnBq9n6A%3D%3D&trackingId=B9QzOo%2FUSpzvLa9TryfF%2Fw%3D%3D"
}