{
    "job_id": "4056210238",
    "title": "Lead Business Analyst – Financial Securities",
    "company": "EPAM Systems",
    "location": "Pune, Maharashtra, India",
    "description": "We are in search of a skilled Lead Business Analyst – Financial Securities to join our team.\n\nYou will co-develop a clear product vision, strategy, and roadmap for financial securities, covering the full product development lifecycle. This includes creation, version and infrastructure upgrades, and eventual decommissioning. You will drive new products and product changes iteratively and continuously together with cross-functional team members in the pod, acting as a product owner within an agile team and ensuring the product requirements are clear to designers and engineers.\n\nResponsibilities\n\n\n\nCo-develop a clear product vision, strategy, and roadmap covering the full product development lifecycle\nDrive new products and product changes iteratively and continuously with a cross-functional team\nAct as product owner within an agile team, participating in agile ceremonies and ensuring the product requirements are clear to designers and engineers\nEnsure the product is being tested together with clients to gain insights and ensure readiness to launch before market entry\nSupport pod Objective and Key Results and provide relevant product measurements and metrics to meet overall business goals\nEnsure the quality and compliance of the product from a technical and non-functional requirement perspective\n\n\n\nRequirements\n\n\n\n8-12 years of experience in business and data analysis within the financial industry\nExperience as a Product Manager in the financial sector, ideally in the Investment Bank and Securities domain\nStrong understanding of agile delivery frameworks and product management\nExperience working with applications supporting Securities settlements & confirmations, preferably US securities settlements through DTCC etc.\nExperience working with settlement & confirmations business/operations stakeholders, documenting as-is and to-be business & process flows, process engineering, etc.\nAbility of setting and delivering on outcome-focused goals, such as using OKRs (Objectives and Key results)\nExcellent analytical and problem-solving skills\nStrong active listening and communication skills to build networks and partnerships at all levels\nB2+ English level proficiency\n\n\n\nTechnologies\n\n\n\nApplication Support Securities\nSecurities Settlement\nAmericas Securities\n\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/lead-business-analyst-%E2%80%93-financial-securities-at-epam-systems-4056210238?position=6&pageNum=82&refId=N2DJYUFis9K%2FPRID1uM14Q%3D%3D&trackingId=coek3SEt7tGx%2FpaNuUwqIg%3D%3D"
}