{
    "job_id": "4056563224",
    "title": "Business Analyst",
    "company": "Arena Investors, LP",
    "location": "Bengaluru, Karnataka, India",
    "description": "Arena is a global investment firm and merchant capital provider that seeks to generate attractive risk-adjusted and uncorrelated returns by investing in a highly diversified portfolio across the entire credit spectrum in areas where conventional sources of capital are typically scarce. Arena Investors, LP (an investment adviser) is part of Arena Group, which includes Arena Finance Company, Inc. (a commercial finance company). Arena, headquartered in New York, is managed by Dan Zwirn, who has originated, structured and managed over $10 billion in special situation financing and asset-oriented investments globally. Arena employs a team of approximately 35 professionals and was formed in partnership with The Westaim Corporation (\"Westaim\"), a publicly traded Canadian holding company focused on the financial services industry.\n\nOVERVIEW\n\n\n\n\nArena is looking to expand the Operations Team through the addition of Data Integrity associate. In this role, the individual will reconcile and ensure the accuracy of the data used by Arena's teams.\n\n\n\n\nKEY RESPONSIBILITIES\n\nWork closely with the Operations Team and IT Team to monitor data within the Arena Data Warehouse and Arena proprietary pipeline software\nReconcile data within the Arena Data Warehouse and pipeline to ensure accuracy\nCreate additional data reconciliations as required\nWork with internal Arena teams to ensure they input their data properly and rectify any errors\nWork with third parties (Fund Administrator, Prime Brokers, Custodians, etc.) as required to ensure the proper data is both received and sent\n\n\n\nRequirements\n\n\n\nThe individual will have demonstrated an ability to work in a fast-paced, performance-driven environment with an ability to think broadly about the business, incorporating continual improvement of processes and procedures with a goal of excellence while focusing on accuracy and efficiency.\n\nBachelor's degree from a top university, ideally in a quantitative area (e.g., finance, economics, accounting) is a must\n5-10 years of direct experience at a securities or investment firm\nExcellent Microsoft Excel (VBA a plus), PowerBI (or other query tools)\nSolid analytical and writing skills\nExperience with equity, debt and FX trading and settlements\nThe highest level of personal integrity and ethical standards\nA positive attitude, strong work ethic and a desire to work collaboratively across the organization\nStrong attention to detail\nShould be willing to work in US shifts\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-arena-investors-lp-4056563224?position=7&pageNum=75&refId=oawIpd1n3a%2BRa%2FbhSX9Nsw%3D%3D&trackingId=tqgEdvkbz5gIPljVbcDXyA%3D%3D"
}