{
    "job_id": "4063829983",
    "title": "Founders Team Analyst (0-1 yrs only)",
    "company": "ITILITE",
    "location": "Bengaluru, Karnataka, India",
    "description": "Company Overview:\n\n\n\n\nITILITE is a leading global brand in the Business Travel, Expense & Cards Management space.\n\nOur mission is to help companies simplify their travel and expense processes, making it an enjoyable experience for employees. We operate on a B2B SaaS model, with a strong presence in India and the USA, serving over 500 customers.\n\nWe are a Series C funded company, having raised over $45 million from Global Tier 1 VCs like Tiger Global, VY Capital, Greenoaks, and Z47 (Matrix Partners).\n\n\n\n\nFounder Profiles:\n\nMayank Kukreja (CEO) → Alumnus of IIT and IIM, with professional experience at McKinsey and Myntra.\nAnish Khadiya (CBO) → Alumnus of IIT and IIM, with a background in ITC, McKinsey, and Myntra.\n\n\n\n\nRole Overview:\n\n\n\n\nAs a Founders' team analyst, you will help the company leadership solve high-impact challenges, that drive the company forward. From the outset, you will get the opportunity to work across various functions, including Sales, Customer Success, Finance, Supply, and Product amongst others.\n\n\n\n\nWe empower you to pick up areas that require first-principles thinking and challenge the status quo, including what the leadership/founders may have built.\n\n\n\n\nWithin your first 6 months, you can expect to own problem statements like “How do we double our Ad CTRs?” where you take full ownership of efforts & outcomes.\n\nWithin 2 years, you will lead multiple cross-functional projects, ranging from new lead gen channels to new supplier evaluation.\n\n\n\n\nAlong the way, you will work directly with the founders and leadership team helping them prioritize areas that move the company forward.\n\n\n\n\nCareer Trajectory & Scope:\n\n\n\n\nThis role is highly cross-functional and you will get to contribute to every high-priority area in the company. Here’s what our current founders' team is working on:\n\n\n\n\nHitesh Awtaney (ex-Founder) → Associate to Director (4 yrs)\n\n0-1 leading Supply, Business Finance // 30% uptick in revenue\n10-100 in Customer Experience // Scaled operations to 4x in 5 months\n10-100 in demand generation // 40% drop in Cost per opportunity\nCurrently leading P&L growth and profitability for a business unit\n\nMrinal Ganapathy (Manipal, ex-Cred) → Analyst to Senior Associate (2 yrs)\n\n1-10 leading Customer experience & analytics // 15% uptick in revenue\n0-1 leading Customer Success for a new geo // 10x revenue in a year\n1-10 setting up Intent as a channel for lead generation // 25% uptick in pipeline\nCurrently scaling partnerships as a growth channel for our global business\n\n\n\n\nIdeal Candidate Profile:\n\n\n\n\n0-1 years of full-time experience, engineering undergrads, interest in sales & marketing.\n\n\n\n\nThe following mindset will make you successful in the role:\n\nOpenness to question, try new things, and the willingness to hustle\nSetting high-performance standards (and moving people to make it happen!)\nAbility to adapt (and thrive) when faced with new challenges\nComfortable with experimentation, testing, and learning from failures\n\n\n\n\nThis isn’t a role for people who want to specialize.\n\n\n\n\nIf you feel you can achieve great results in any area you pick, this is the role for you.\n\n\n\n\nIf you are looking for a non-linear growth trajectory, this role is definitely for you.\n\n\n\n\nApplication Process: LinkedIn only. No DMs.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/founders-team-analyst-0-1-yrs-only-at-itilite-4063829983?position=2&pageNum=45&refId=UbUFWb7IHPllL5XcmhINQg%3D%3D&trackingId=iMIAxwjEqwHPGoPx%2B9rWyg%3D%3D"
}