{
    "job_id": "4068439865",
    "title": "Senior Business Analyst",
    "company": "AXA XL",
    "location": "Bengaluru, Karnataka, India",
    "description": "Bangalore, Karnataka, India\n\nSenior Business Analysts bridge the gap between business and IT by being able to communicate effectively with all stakeholders.The Senior Business Analyst will be responsible for supporting an application or multiple applications within a Delivery Team and her/his core responsibilities include eliciting and documenting both business, functional and non-functional requirements, supporting quality assurance testing and UAT, and triaging incoming issues, defects, and enhancement requests.Senior Business Analysts will also provide senior-level support for projects that impact the application(s) s/he supports.\n\nDISCOVERyour opportunity\n\nWhat will your essential responsibilities include?\n\n\nCollect, challenge, facilitate and document business requirements in a business requirements specification & functional specification, or a set of Features, Epics & User stories.\nValidate the overall IT solution is aligned with the business requirements, walk through requirements with the business and then develop & test teams to ensure understanding.\nSupport development and system test queries, facilitate user acceptance testing and provide support for issues/changes in production.\nCollaborate with Transformation & Change Delivery resources to ensure requirements and solutions support the overall business process.\nHelp identify how requirements can help make the business process more efficient.\n\n\nYou will report to the Business Analyst lead.\n\nSHARE your talent\n\nWe’re looking for someone who has these abilities and skills:\n\nRequired Skills And Abilities\n\n\nRelevant years of proven experience in business analysis within the insurance market, with preference given to those who have worked in technology.\nSalesforce knowledge – good working knowledge of the Salesforce platform, with preference given to those with a Salesforce Business Analyst certification.\nMust possess excellent interpersonal skills, effective communication skills (written and verbal), and the ability to present information in an influencing manner at the leadership level.\nExcellent stakeholder management skills, with a proven ability to build trusting relationships with the business.\nAbility to extract and document business requirements, to support the delivery of a technical solution. This should include the ability to plan for and facilitate business requirements workshops.\n\n\nDesired Skills And Abilities\n\n\nWorking knowledge on policy admin / Rate quote bind systems\nInsurance background – Policy knowledge specifically\nMust have proficient experience with various Analyst techniques e.g., User interviewing / Workshop facilitation / Business Process Modelling / Writing a business requirement document or set of Epics & User Stories.\nSignificant experience in supporting all phases of the software development life cycle.\nExperience with different SDLC methodologies, with a preference for Agile Scrum.\nProven planning and organization skills, with an ability to work resiliently, planning their analysis work, prioritizing workload, preparing in advance, and setting realistic timescales.\nAdaptable to new/different strategies, programs, technologies, practices, cultures, etc.Comfortable with change, able to easily make transitions.\n\n\nFIND your future\n\nAXA XL, the P&C and specialty risk division of AXA, is known for solving complex risks. For mid-sized companies, multinationals and even some inspirational individuals we don’t just provide re/insurance, we reinvent it.\n\nHow? By combining a comprehensive and efficient capital platform, data-driven insights, leading technology, and the best talent in an agile and inclusive workspace, empowered to deliver top client service across all our lines of business − property, casualty, professional, financial lines and specialty.\n\nWith an innovative and flexible approach to risk solutions, we partner with those who move the world forward.\n\nLearn more at axaxl.com\n\nInclusion & Diversity\n\nAXA XL is committed to equal employment opportunity and will consider applicants regardless of gender, sexual orientation, age, ethnicity and origins, marital status, religion, disability, or any other protected characteristic.\n\nAt AXA XL, we know that an inclusive culture and a diverse workforce enable business growth and are critical to our success. That’s why we have made a strategic commitment to attract, develop, advance and retain the most diverse workforce possible, and create an inclusive culture where everyone can bring their full selves to work and can reach their highest potential. It’s about helping one another — and our business — to move forward and succeed.\n\n\nFive Business Resource Groups focused on gender, LGBTQ+, ethnicity and origins, disability and inclusion with 20 Chapters around the globe\nRobust support for Flexible Working Arrangements\nEnhanced family friendly leave benefits\nNamed to the Diversity Best Practices Index\nSignatory to the UK Women in Finance Charter\n\n\nLearn more at axaxl.com/about-us/inclusion-and-diversity . AXA XL is an Equal Opportunity Employer.\n\nSustainability\n\nAt AXA XL, Sustainability is integral to our business strategy. In an ever-changing world, AXA XL protects what matters most for our clients and communities. We know that sustainability is at the root of a more resilient future. Our 2023-26 Sustainability strategy, called “Roots of resilience”, focuses on protecting natural ecosystems, addressing climate change, and embedding sustainable practices across our operations.\n\nOur Pillars\n\n\nValuing nature: How we impact nature affects how nature impacts us. Resilient ecosystems - the foundation of a sustainable planet and society – are essential to our future. We’re committed to protecting and restoring nature – from mangrove forests to the bees in our backyard – by increasing biodiversity awareness and inspiring clients and colleagues to put nature at the heart of their plans.\nAddressing climate change: The effects of a changing climate are far reaching and significant. Unpredictable weather, increasing temperatures, and rising sea levels cause both social inequalities and environmental disruption. We're building a net zero strategy, developing insurance products and services, and mobilizing to advance thought leadership and investment in societal-led solutions.\nIntegrating ESG: All companies have a role to play in building a more resilient future. Incorporating ESG considerations into our internal processes and practices builds resilience from the roots of our business. We’re training our colleagues, engaging our external partners, and evolving our sustainability governance and reporting.\nAXA Hearts in Action : We have established volunteering and charitable giving programs to help colleagues support causes that matter most to them, known as AXA XL’s “Hearts in Action” programs. These include our Matching Gifts program, Volunteering Leave, and our annual volunteering day – the Global Day of Giving.\n\n\nFor more information, please see axaxl.com/sustainability.\n\nFlexible Work Eligible\n\nNone\n\nAXA XL is an Equal Opportunity Employer.\n\nLocation\n\nIN-IN-Bangalore East\n\nJob Field\n\nInformation Technology\n\nSchedule\n\nFull-time\n\nJob Type\n\nStandard\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-axa-xl-4068439865?position=1&pageNum=80&refId=A63P04dNUmAIICc%2BzvhEHA%3D%3D&trackingId=LNYgF7gNQtMv0y%2BW9cpBlg%3D%3D"
}