{
    "job_id": "4070723414",
    "title": "Business Analyst II , EU INTech",
    "company": "Amazon",
    "location": "Hyderabad, Telangana, India",
    "description": "Description\n\nAt Amazon, we strive to be the most innovative and customer centric company on the planet. Come work with us to develop innovative products, tools and research driven solutions in a fast-paced environment by collaborating with smart and passionate leaders, program managers and software developers. This role is based out of our Hyderabad corporate office and is for an passionate, dynamic, analytical, innovative, hands-on, and customer-obsessed Business Analyst. Your team will be comprised of Business Analysts, Data Engineers, Business Intelligence Engineers based in Hyderabad, Europe and the US.\n\nKey job responsibilities\n\nThe ideal candidate will have experience working with large datasets and distributed computing technologies. The candidate relishes working with large volumes of data, enjoys the challenge of highly complex technical contexts, and, is passionate about data and analytics. He/she should be an expert with data modeling, ETL design and business intelligence tools, has hand-on knowledge on columnar databases such as Redshift and other related AWS technologies. He/she passionately partners with the customers to identify strategic opportunities in the field of data analysis & engineering. He/she should be a self-starter, comfortable with ambiguity, able to think big (while paying careful attention to detail) and enjoys working in a fast-paced team that continuously learns and evolves on a day to day basis.\n\nA day in the life\n\nKey Job Responsibilities\n\nThis role primarily focuses on deep-dives, creating dashboards for the business, working with different teams to develop and track metrics and bridges.\n\n\nDesign, develop and maintain scalable, automated, user-friendly systems, reports, dashboards, etc. that will support our analytical and business needs\nIn-depth research of drivers of the Localization business\nAnalyze key metrics to uncover trends and root causes of issues\nSuggest and build new metrics and analysis that enable better perspective on business\nCapture the right metrics to influence stakeholders and measure success\nDevelop domain expertise and apply to operational problems to find solution\nWork across teams with different stakeholders to prioritize and deliver data and reporting\nRecognize and adopt best practices in reporting and analysis: data integrity, test design, analysis, validation, and documentation\nMaintain BI architecture including our AWS account, database and various analytics tools.\n\n\nBasic Qualifications\n\n\nSQL mastery is a must\nSome scripting knowledge (python, R, scala)\nStakeholder management\nDashboarding (Excel, Quicksight, Power BI)\nData analysis and statistics\nKPI design\n\n\nPreferred Qualifications\n\n\nPower BI and Power Pivot in Excel\nAWS fundamentals (IAM, S3, ..)\nPython\nApache Spark / Scala\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI HYD 13 SEZ\n\nJob ID: A2823457\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-ii-eu-intech-at-amazon-4070723414?position=5&pageNum=72&refId=Mz5LEAf7jSU4t3WBJ4sgJQ%3D%3D&trackingId=vR%2BmoBqOgK31MKdoQAvF%2FQ%3D%3D"
}