{
    "job_id": "4070279280",
    "title": "Business Analyst, Operations",
    "company": "TMB (Trusted Media Brands)",
    "location": "Gurgaon, Haryana, India",
    "description": "About Us\n\nTMB is the community-driven entertainment company engaging more than 250 million consumers worldwide across streaming TV, social media, web and print. Our portfolio of brands including FailArmy, Family Handyman, People Are Awesome, Reader's Digest, Taste of Home, The Healthy, and The Pet Collective, is powered by content that's inspired and created by our fans. Together our community sparks curiosity, fuels laughter, and inspires people to live big, full, fantastic lives. Learn more about our brands, our data-driven marketing solutions, our award-winning licensing services, and much more at trustedmediabrands.com.\n\nAbout The Role\n\nWe are seeking a highly skilled and organized Business Analyst to join the Publishing Operations team. This person will be responsible for the day-to-day support of our Asset Management, Content Creation and Workflow Management tools, with a focus on the implementation and support of our new Video DAM. This role will require the ability to complete system administrative tasks, business analysis and managing projects.\n\nAbout The You\n\nYou are detail-oriented with an interest in data management, end user support and triaging system issues. You are experienced in configuring Data Asset Management systems with a focus on video and image management. You are quick to learn new software, applications and processes and are experienced in a fast-pasted, high-volume environment.\n\nThis is a hybrid position out of Gurgaon location and requires you to be in the office multiple days a week. Your workday is expected to overlap 4 hours with US CST time zone.\n\nResponsibilities: your day-day:\n\n\nAct as a liaison between end-users, stakeholders and third-party vendor representatives\nConfigure and update system settings (permissions/meta data) based on end user requirements\nMaintain and establish consistency of organizational structures in our DAMs\nDevelop and maintain meta data structures within supported DAMs while ensuring consistency and accuracy\nTriage and resolve support tickets, escalating to vendors when issues cannot be resolved internally\nOversee the ingestion, archival and deletion of assets (video, image, text) across our DAMs\nResearch and test new system features or upgrades prior to deployment to end-users\nCollaborate with stakeholders to establish, maintain and enforce asset and folder naming conventions\nReview in-house processes and procedures for all tools to ensure best practices are being applied\nIdentify inefficiencies and work with teams to create/update workflows and procedures to improve\nAssist in eliciting requirements to understand stakeholder needs and opportunities to enhance our DAMs\nAssist in writing requirements or defect tickets based on information provided by stakeholders\nCreate process diagrams and other supportive materials based on information provided by stakeholders\nImplement new features and functionalities to improve DAM system efficiency and effectiveness\nComplete vendor analysis based on elicited requirements to identify potential solutions to meet user needs\nDesign end user trainings to onboard new team members or host user refresher trainings\nDevelop procedural documentation and establish best practices for enterprise-wide systems\nCommunicate updates, enhancements and changes to supported applications to all stakeholders\n\n\n\nQualifications: you have:\n\n\n5+ year of relevant experience executing business analysis competencies\nExperience with Adobe Creative Cloud applications, specifically Premiere and InDesign\nExperience with Microsoft Applications, including Teams and Outlook and AirTable and Jira\nUnderstanding of APIs and system integrations\nExperience with DAM/SAAS platforms and integrations with other systems\nExperience in triaging applications/end user issues and collaborating with vendors to resolve issues\nFamiliarity with Remote Desktop\nExperience with both MAC and PC platforms\nStrong written and verbal communication skills\nAbility to explain technical concepts to non-technical employees\nAbility to work independently and collaboratively in a fast-paced environment\nDetail oriented with strong organizational and project management skills\nCapable of effectively working on multiple, concurrent projects\nExperience working with global organizations and remote teams\n\n\n\nOur Benefits:\n\nWe value our people and offer a collaborative and engaging culture. As a Trusted Media Brands employee, you will enjoy work/life balance, generous time off and comprehensive benefits and programs. Learn more about what life is like working at Trusted Media Brands at https://www.trustedmediabrands.com/careers/.\n\nIndia Specific Benefits\n\n\nComprehensive Time Off policies\nMaternity and Paternity Time off\nHealth Insurance & Wellness Benefits including access to OPD consultations*, Gym/Yoga studios, Teleconsultation/Telemedicine*\nAccess to Mental Health Reimbursement\nAnnual Sport Reimbursement and Home Office Reimbursement\nOffice with in-house kitchenette\n\n\n\nTrusted Media Brands embraces inclusivity and values our diverse community. We are committed to building a team based on qualifications, merit and business need. We are proud to be an equal opportunity employer and do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\nThis role is offered by TMB through Jukin Media India Private Limited.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-operations-at-tmb-trusted-media-brands-4070279280?position=3&pageNum=12&refId=0qwF5I591Ogz%2FBtLFZTetg%3D%3D&trackingId=0ta94J%2Bt3S0f7u0xMTsYvQ%3D%3D"
}