{
    "job_id": "4073403035",
    "title": "Business Analyst, Software Operations & Analytics",
    "company": "Emerson",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Description\n\nIn this Role, Your Responsibilities Will Be:\n\n\nBuild effective relationships and partnerships with business stakeholders and team members, proactively exploring business needs and drive complex analyses to address business questions as part of larger cross-functional projects\nPartner with analysts and data engineers to create data products in support of Software business analytics across Emerson T&M, driving toward a single-source-of-truth for all cross-functional datasets\nOwn definition, documentation, training, and actively participate in governance of data-driven performance management frameworks, and metrics to enable better decision making and recommendations to optimize business strategies\nPerform analysis using both existing and new datasets that you will create, summarizing findings in presentation format, including both qualitative and quantitative commentary\nCreate and maintain dashboards used by the Software business to diagnose and track performance\nCreate and maintain business models for scenario planning, goal setting, and sales forecasting\nCollaborate within the Software Operations & Analytics team to identify and define key issues, gather requirements, design and develop insight solutions, communicate findings and make recommendations to translate strategic goals into actionable reports and solutions based on data\nExplore, understand, and communicate data-driven insights to explain the impact of business, product, and/or operational decisions\nDemonstrate a deep understanding of software business strategies, processes, operations, and the resulting data that is needed to drive improvements\nActs as an inspiring leader, proposing innovative analytical solutions to solve business challenges\n\n\nWho You Are:\n\nYou are a leader who is self- driven, shows tremendous amount of initiative and gracefully handles ambiguity. You possess strong leadership and skills and have a consistent track record of developing and implementing strategies to achieve organizational objectives.\n\nFor This Role, You Will Need:\n\n\nBS degree in a relevant Engineering or Business field; Master’s is a plus\n5+ years of successful analytics, reporting, and data transformation experience\n4+ years of experience working independently and alongside cross-functional teams in support of Sr. Leadership\nExpertise in analytics & presentation software, particularly Tableau, Power BI, Excel, and PowerPoint\nProven experience working in a dynamic environment, comfortable with ambiguity, and demonstrated ability to devise and implement project plans aligned with business objectives\nAdvanced English communication skills (oral and written)\n\n\nPreferred Qualifications that Set You Apart:\n\n\nExperience with database and programming tools like Snowflake, DBT, Qubole (Hive/Spark/Presto), Python, R, are a plus\n\n\nOur Offer To You:\n\nBy joining Emerson, you will be given the opportunity to make a difference through the work you do.\n\nEmerson's compensation and benefits programs are designed to be competitive within the industry and local labor markets. We also offer a comprehensive medical and insurance coverage to meet the needs of our employees.\n\nWe attract, develop, and retain exceptional people in an inclusive environment, where all employees can reach their greatest potential. We are dedicated to the ongoing development of our employees because we know that it is critical to our success as a global company.\n\nWe have established our Remote Work Policy for eligible roles to promote Work-Life Balance through a hybrid work set up where our team members can take advantage of working both from home and at the office.\n\nSafety is paramount to us, and we are relentless in our pursuit to provide a Safe Working Environment across our global network and facilities.\n\nThrough our benefits, development opportunities, and an inclusive and safe work environment, we aim to create an organization our people are proud to represent.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-software-operations-analytics-at-emerson-4073403035?position=9&pageNum=80&refId=A63P04dNUmAIICc%2BzvhEHA%3D%3D&trackingId=UncVfxCyyGcrh6Rn2Ct%2BJw%3D%3D"
}