{
    "job_id": "4076459800",
    "title": "Business Analyst , Shared Services, SPS Finance",
    "company": "Amazon",
    "location": "Hyderabad, Telangana, India",
    "description": "Description\n\nOur mission at Finance Analytics is to provide complete and accurate data for financial and business reporting and analytics. As such, Finance Analytics designs, builds, maintains and enhances scalable systems that provide accurate data as well as actionable insights to the business.\n\nAs a Business Analyst in Finance Analytics, you will be responsible for working with terabytes of data to develop automated and self service solutions for Finance and Business Partners. You will be responsible for building a robust set of operational, financial and business metrics and will utilize metrics to determine improvement opportunities.\n\nResponsibilities\n\nGather requirements from stakeholders to build a suite of analytical and reporting solutions using the Amazon data lake\n\nDesign and develop highly available dashboards and metrics in Quicksight\n\nProvide wing-to-wing project lifecycle execution (project planning, execution, risk assessment and system availability)\n\nExecute cross functional, high impact projects to improve operations performance\n\nPerform business analysis and data queries using SQL, R etc\n\nBasic Qualifications\n\n\n3+ years of Excel (including VBA, pivot tables, array functions, power pivots, etc.) and data visualization tools such as Tableau experience\n3+ years of tax, finance or a related analytical field experience\n3+ years of business or financial analysis experience\nExperience defining requirements and using data and metrics to draw business insights\nExperience making business recommendations and influencing stakeholders\nExperience with Excel\n\n\nPreferred Qualifications\n\n\n5+ years of business analyst, data analyst or similar role experience\n\n\n\nCompany - Amazon Dev Center India - Hyderabad - A85\n\nJob ID: A2830234\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-shared-services-sps-finance-at-amazon-4076459800?position=7&pageNum=87&refId=KM8cdGPQyPT7yvIRKZCULw%3D%3D&trackingId=SE%2BSHmRZnCS8D5ZomSmHQA%3D%3D"
}