{
    "job_id": "4079336541",
    "title": "Business Analyst",
    "company": "PinnacleU",
    "location": "Haryana, India",
    "description": "About The Organisation\n\nOur client is a new-age business school offering industry-immersive business education where the classes are led by top industry leaders and practitioners. It is a first-of-its-kind institute where distinguished leaders from different walks of life have re-imagined business education in order to create effective business professionals for the ever-changing economy. Our leadership consists of alumni from IITs, IIMs, and Ivy League Schools like Stanford and Upenn.\n\nThe institute is strategically located in the very heart of Gurugram's business district, flanked by several Fortune 500 companies, in order to provide the ultimate industry immersive and hands-on learning experience from day one. The most ground-breaking feature of its Programme is that the courses are taught by CXOs, MDs, Eminent Public Leaders, and even Members of Parliament, apart from distinguished global faculty from top B-schools who regularly consult with Fortune 500 companies.\n\nIn its 3 years of run, Our flagship Post Graduate Program in Technology and Business management has already surpassed the placement records of IIM Ahmedabad and ISB with top-notch recruiters (including Amazon, CitiBank, Microsoft, Unacademy, Razorpay, BCG, Bain) hiring our graduates.\n\nPost our stellar success in the post-graduate program, we are now launching the undergraduate program on similar lines where leading executives from the industry will come and teach our students and teach them the new age in-demand skills in technology and business.\n\nJob Summary: We are looking for a motivated and detail-oriented Business Analyst to join our team. The ideal candidate will have a passion for analyzing data, understanding business processes, and providing actionable insights to drive the organization’s success. As a fresher, you will receive training and guidance to develop your skills and grow in the role.\n\nKey Responsibilities\n\n\nData Analysis: Collect, analyze, and interpret data to identify trends, patterns, and insights that can help drive business decisions.\nProcess Improvement: Work with various departments to understand business processes and recommend improvements.\nDocumentation: Prepare and maintain detailed documentation of business requirements, processes, and workflows.\nReporting: Generate reports and dashboards to provide insights to stakeholders.\nStakeholder Communication: Collaborate with stakeholders to gather requirements and ensure alignment on project goals.\nProject Support: Assist in the planning and execution of projects, ensuring they meet business objectives and timelines.\n\n\nSkills\n\n\nStrong analytical and problem-solving skills.\nProficiency in Microsoft Office Suite (especially Excel).\nBasic knowledge of data analysis tools (e.g., SQL, Power BI, Tableau) is a plus.\nExcellent verbal and written communication skills.\nAbility to work independently and in a team environment.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-pinnacleu-4079336541?position=10&pageNum=12&refId=0qwF5I591Ogz%2FBtLFZTetg%3D%3D&trackingId=CxIj%2BXevHtz%2BlSgUJhHw2A%3D%3D"
}