{
    "job_id": "4080972797",
    "title": "Business Analyst II",
    "company": "Amazon",
    "location": "Hyderabad, Telangana, India",
    "description": "Description\n\nAt Amazon.com, we strive to be Earth’s most customer-centric company. To support this vision, we need talented, bright, and driven people. If you would like to help us build the place to find and buy anything online, this is your chance to work hard, have fun, and make history.\n\nKey job responsibilities\n\nAn Ideal Candidate For This Role\n\n\nWill have relevant experience in data analytics working with large data sets and to extract and transform data using various tools and technologies\nWill transform data into actionable business information, and will make it readily accessible to stakeholders worldwide\nWill use data to support ideas, drive actionable outcomes, and provide unique ways to present data and information in an easy to consume format\nWill be passionate about finding root causes, trends, and patterns and how they impact business.\nWill draw inferences and conclusions, create dashboards and visualizations of processed data\nWill have good business and communication skills to be able to work with product owners to understand key business questions to build reports that enable product owners to answer those questions quickly and accurately\nWill be very comfortable juggling competing priorities and handling ambiguity\nWill thrive in an agile and fast-paced environment on highly visible projects and initiatives\n\n\nA day in the life\n\nAs a Business Analyst, you will help develop an analytic solution to drive deep dives, provide insights into the health and state of the Operations and measure business impact. You will transform data into actionable business information, and will make it readily accessible to stakeholders worldwide. You will own the design, creation, and management of extremely large datasets. From Day 1, you will be challenged with a variety of tasks, ranging from creating datasets, reports, dashboards to metadata modeling, pipeline monitoring. You will interact with internal program and product owners, and technical teams to gather requirements, structure scalable and perform data solutions, and gain a deep understanding of key datasets. You will design, implement and drive adoption of new analytic technologies and solutions and promote industry standard best practices. You will be responsible to tune query performance against large and complex data sets. You will help translate analytic insights into concrete, actionable recommendations for business or product improvement.\n\nAbout The Team\n\nOur team strives to make Amazon the best way for Partners to reach customers locally and globally and to operate their businesses, driven by the accurate and efficient support and solutions we provide them. We are looking for a Business Analyst for its compliance team. The team is being grown to provide insights and provide analytical solutions to help drive operational efficiencies, uncover the hidden risks and trends, reduce investigation errors, improve customer experience and predict & recommend the optimizations for future state.\n\nBasic Qualifications\n\n\n3+ years of tax, finance or a related analytical field experience\n3+ years of Excel (including VBA, pivot tables, array functions, power pivots, etc.) and data visualization tools such as Tableau experience\n3+ years of business or financial analysis experience\nBachelor's degree or equivalent\nExperience defining requirements and using data and metrics to draw business insights\nExperience with Excel\nExperience with SQL\nExperience making business recommendations and influencing stakeholders\n\n\nPreferred Qualifications\n\n\nExperience using very large datasets\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI - BLR 14 SEZ\n\nJob ID: A2795939\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-ii-at-amazon-4080972797?position=3&pageNum=10&refId=I3x5Bv9xaOmHYCAjSz8m9w%3D%3D&trackingId=lQdGqF7YOMNSCVh%2BDDp0QA%3D%3D"
}