{
    "job_id": "4083141922",
    "title": "Lead Business Analyst – Operations Analytics & AI",
    "company": "AstraZeneca India",
    "location": "Bengaluru East, Karnataka, India",
    "description": "Job Title - Lead Business Analyst – Operations Analytics & AI\n\nCareer Level: E\n\nWe are looking for experienced business analysts who can lead delivery of a transformative roadmap of analytics and AI requirements.\n\nAbout AstraZeneca\n\nAstraZeneca is a global, science-led, patient-focused biopharmaceutical company that focuses on the discovery, development and commercialisation of prescription medicines for some of the world’s most serious diseases. At AstraZeneca we’re dedicated to being a Great Place to Work.\n\nAbout Our Team\n\nAstraZeneca is in a period of strong growth and our employees have a united purpose to make a difference to patients around the world who need both our medicines and the ongoing developments from our science. The ambition, size and complexity of the organisation, coupled with the opportunities afforded by new technology, has led the Board to approve a large-scale transformation programme – Axial.\n\nAxial will be powered by S/4HANA a new Enterprise Resource Planning system which will be implemented across the organisation. We will be transforming the way we work through our entire supply chain, from bench to patient.\n\nThe new system will be used by more than 20,000 employees daily and will be central to most core business processes. This is a once in a generation programme for AstraZeneca and will shape our ways of working globally.\n\nThe Axial Insights & Analysis team is leading the roadmap and delivery of analytics and AI delivery from an end-user perspective.\n\nJob Role Details\n\nWhat you will do:\n\n\n\nCollaborate with multiple business teams and senior leaders within Operations groups, to lead the collection of requirements, existing challenges, and business opportunities; working with our delivery partners to make sure the Axial program is writing requirements and specifications at scale and pace, to a high quality. You will need to get hands-on too, writing requirements yourself.\nLead the integration of analytics and AI into business processes, where possible automating decision making.\nBe engaged in data management work such as: design of an analytics catalogue, promoting data literacy, participating in analytics governance forums and being the champion for citizen data services.\nDevelop & embed standards and guidelines for the business intelligence lifecycle.\nBe responsible for navigation of interim states and solving the problems they generate.\nPrepare material, tools, sample data, and processes for Fit-2-Standard workshops.\nContribute to the analytics and AI operating model.\nIdentify learning and development needs.\n\n\n\nEssential Qualifications:\n\n\n\nStrong business analysis experience and knowledge of analytics.\nExcellent communication and stakeholder management\nExperience working with Senior stakeholders and in management level presentations.\nExperience working in bigger project and implementations\nInfluencing design and user experience.\nConsiderable experience and expertise to one or more business processes in Operations:\nManufacturing and Warehouse management,\nTransportation management\nExperience in working with large and sophisticated data sets in commonly used BI tools like SAP Analytics Cloud, Qlik & PowerBI.\nStrong drive to learn new concepts in business processes, tools and applications.\nA strong ability to convey complex information through analytics, catering from Top-Floor to Shopfloor.\n\n\nDesirable Qualifications:\n\n\n\nExperience in one or more full S/4 HANA implementation cycle/s in Analytics using embedded analytics, SAP Analytics Cloud and understanding of SAP B/W4 HANA or SAP Datasphere\nExperience in Business Process Management Tools like BIC or Nimbus or Signavio\nRegulatory experience, e.g. GxP and SOx.\nExposure to more than one of the SAP modules such as: MM, PP, IM, EWM, QM, TM, or Controlling etc from business side. Technical or configurations skills are not required for this position.\nFamiliarity with data science, AI/ML concepts and use cases in Operations.\nBio-Tech, Pharmaceutical or Life Sciences experience.\nLeading teams of analysts and testers.\nUX experience.\nExperience in Planning tools like Hyperion, SAP BPC or SAC Planning.\nCertifications in SAP, Project Management, Business Intelligence, Data Management, Lean Framework or Operations.\nExperience in large scale, complex & multi-year projects.\n\n\n\nNext steps\n\nAre you already envisioning yourself joining our team? Good, because we’d love to hear from you! Click the link to apply and we’ll be in touch as soon as we can.\n\nFor more information\n\nOur Social Media, Follow AstraZeneca on LinkedIn https://www.linkedin.com/company/1603/\n\nIf you would like to be notified about future job opportunities, you can set up a job alert! Click on the Career icon on the Workday homepage and select Manage job alerts.\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status.\n\nAstraZeneca embraces diversity and equality of opportunity. We are committed to building an inclusive and diverse team representing all backgrounds, with as wide a range of perspectives as possible, and harnessing industry-leading skills. We believe that the more inclusive we are, the better our work will be. We welcome and consider applications to join our team from all qualified candidates, regardless of their characteristics. We comply with all applicable laws and regulations on non-discrimination in employment (and recruitment), as well as work authorization and employment eligibility verification requirements.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/lead-business-analyst-%E2%80%93-operations-analytics-ai-at-astrazeneca-india-4083141922?position=2&pageNum=97&refId=HcfnYd3BMGIT%2FuoEZTo%2FBg%3D%3D&trackingId=J%2F5A%2B7c2DLc6EmAV6HAiDw%3D%3D"
}