{
    "job_id": "4087056683",
    "title": "Business Analyst (Job ID - 2322)",
    "company": "KANINI",
    "location": "Greater Chennai Area",
    "description": "Job Description\n\nWant to join KANINI?\n\nWe are looking for a Business Analyst who will be communicating with all stakeholders & to elicit, analyse and validate the requirements for changes to business processes, information systems, and policies. You will play a big role in moving an organization toward efficiency, productivity, and profitability.\n\nYou Are All Set To\n\nBridge the gap in understanding between the management of an organization, and the complex data and technical systems businesses use in hopes of improving processes and helping impact decision-making.\n\nYou Are Someone Who Can\n\n\nCollaborate with stakeholders to understand and anticipate their needs and translate them into product requirements.\nTranslate product roadmap features into well-defined product requirements including features, user stories, and acceptance test criteria. Hand off user stories to development and testing teams as a part of the sprint planning meeting.\nLiaison continuously with engineering teams to ensure teams are equally aligned in product requirements and goals.\nParticipate in Scrum meetings and product sprints.\nPrioritize and maintains the sprint backlog for assigned products, balancing the requirements of stakeholders.\nWork in an Agile environment and continuously reviews the business needs, refines priorities, and identifies opportunities and risks.\nWork with cross-functional teams and various stakeholders, including analytics, design/user experience and engineering.\nReview of test scenarios & test results\nWork with Business Stakeholders in organizing UAT.\n\n\nYou Bring In\n\n\n5+ Years of experience working as a Business Analyst.\nRequirement gathering\nCreating, analysing, and validating detailed functional and business specifications (BRD / SRS Preparation)\nknowledge of software development life cycles including agile development and testing.\nCreate Slide Decks required for explaining Business Solutions & Approach\nFacilitating, creating proposals and other relevant documents, negotiation of requirements.\nExcellent written and verbal communications, organization, analytical, planning and leadership skills.\nAbility to effectively conduct technical discussions directly with Project/Product management, and clients.\nTeam Collaboration Skills.\nFosters a climate conducive to establishing positive working relationships with clients (internal and external\nStrong relationship building and maintaining skills.\nKnowledge transfer, clarifications to Development & Testing teams\nExperience in dealing with multiple projects and cross-functional teams, and ability to coordinate across teams in a large matrix organization environment.\nManagement, communication, technical and remote collaboration skill.\n\n\nYour Qualification Is\n\n\nB.E/B.Tech/M.C.A/MSc (preferably in Computer Science/IT)\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-job-id-2322-at-kanini-4087056683?position=1&pageNum=75&refId=oawIpd1n3a%2BRa%2FbhSX9Nsw%3D%3D&trackingId=MdeoM8QTZCf92WY9eOKJNQ%3D%3D"
}