{
    "job_id": "4088156863",
    "title": "Software - Business Analyst",
    "company": "Dayal Group",
    "location": "Meerut, Uttar Pradesh, India",
    "description": "The roles of a business analyst are to gather, review and analyze data regarding the business and its operations; prepare models and process maps for improvements; and communicate findings and suggestions to key stakeholders.\n\nResponsibilities\n\nRequirements Gathering:\n\nProficient in reviewing/inventing processes or systems of a Business. Understand customers' diverse, specific business needs.\n\n\nCollaborate with stakeholders to understand business requirements.\nConduct interviews to gather detailed requirements.\nDocument and validate requirements to ensure they meet business needs.\n\n\nStakeholder Communication\n\n\nAct as a bridge between business units and IT teams.\nPrepare and present reports, presentations, and proposals to stakeholders.\nManage stakeholder expectations and address any concerns or issues.\n\n\nProcess Improvement\n\n\nEvaluate existing business processes and identify areas for improvement.\nDevelop and propose solutions to enhance efficiency and effectiveness.\nImplement process changes and monitor their impact.\n\n\nDocumentation\n\n\nCreate and maintain comprehensive documentation for business processes, requirements, and solutions.\nEnsure documentation is accurate, up-to-date.\nCreate High Level Documents (System Architecture Diagram, Activity Diagrams, Wire-frames)\n\n\nSkills And Competencies\n\n\nAnalytical Thinking: Ability to analyze complex data and processes to identify problems and solutions.\nCommunication: Strong verbal and written communication skills to interact effectively with stakeholders and team members.\nProblem-Solving: Ability to develop innovative solutions to business challenges.\nTechnical Proficiency: Familiarity with data analysis tools, databases, and software development processes.\nProject Management: Skills in managing projects, including planning, execution, and monitoring.\nAttention to Detail: Precision in documenting requirements and specifications to ensure accuracy.\nAdaptability: Ability to adjust to changing business needs and priorities.\n\n\nProficiency In Tools\n\n\nAnalyse Customer Requirements and record them efficiently as Customer Notes & FRD (Feature Requirements Document).\nCreate System Architecture Diagram, Activity Diagrams, Wire-frames using Figma, Whimsical, etc.\nCompetent in writing reports and making presentations to highlight the requirements: Usage of PPT\nExcellent knowledge of Google Spreadsheet/Ms-Excel.\n\n\nEducation\n\n\nBachelor’s Degree in Information Technology or Computer Science or MCA or BCA\nCertifications: CBAP, PMI-PBA, Agile, etc. (optional but valuable)\nPostgraduate Education like an MBA or Master’s in Information Systems (optional but valuable).\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/software-business-analyst-at-dayal-group-4088156863?position=6&pageNum=87&refId=KM8cdGPQyPT7yvIRKZCULw%3D%3D&trackingId=vu8vRhn1hWnqI%2FR1N%2BWDRw%3D%3D"
}