{
    "job_id": "4093042179",
    "title": "Volody - Business Analyst",
    "company": "Volody",
    "location": "Mumbai Metropolitan Region",
    "description": "Volody Products Pvt Ltd. Business Analyst.\n\nVolody is an enterprise software product company helping businesses to digitize their legal contract management processes by providing them with a smart Contract Lifecycle Management Software.\n\nVolody is expanding aggressively and looking for a Business Analyst & Customer Success Manager for its Product Delivery division.\n\nThe Candidate Should Have Following Experience\n\n\nEvaluating business processes, anticipating requirements, uncovering areas for improvement, and developing and implementing solutions.\nLeading ongoing reviews of business processes and developing optimization strategies.\nPerforming requirements analysis.\nDocumenting and communicating business requirement analysis.\nEffectively communicating insights and plans to cross. functional team members and management.\nGathering critical information from meetings with various stakeholders and producing useful reports.\nWorking closely with clients, tech team, and managerial staff.\nProviding leadership, training, coaching, and guidance to junior staff.\nAllocating resources and maintaining cost efficiency.\nEnsuring solutions meet business needs and requirements.\nGetting the user acceptance testing done from clients.\nPerforming user acceptance testing for internal standard products.\nManaging projects, developing project plans, and monitoring performance.\nUpdating, implementing and maintaining procedures.\nPrioritizing initiatives based on business needs and requirements.\nServing as a liaison between stakeholders and users.\nManaging competing resources and priorities.\nMonitoring deliverables and ensuring timely completion of projects.\nCreating project / product road map, communicating it with the client and get it implemented\nClient Support for technical or functional requirements\n\n\nSkills Required\n\n\nAnalytical Problem. Solving capabilities\nInterpersonal and consultative skills\nOral and written communication proficiency - English language.\nBasic software knowledge and skills\nBusiness structure understanding\nCost-Benefit Analysis\n\n\n(ref:hirist.tech)\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/volody-business-analyst-at-volody-4093042179?position=1&pageNum=12&refId=0qwF5I591Ogz%2FBtLFZTetg%3D%3D&trackingId=cbq%2Bu0%2FQABKGcqpP7ssw0g%3D%3D"
}