{
    "job_id": "4094840226",
    "title": "Business Analyst - Electronics Manufacturing Services",
    "company": "YO IT CONSULTING",
    "location": "Surat, Gujarat, India",
    "description": "Business Analyst - EMS\n\nLocation: Surat\n\nExperience: 2 to 5 Years\n\nRole Summary\n\nReport to the Program Manager & Promoter\n\n\nResponsible for development & execution of operational work plan\nOwn the execution of modules for a new business build.\nDrive complete ownership of module across plant setup, portfolio strategy, sales strategy and execution etc.\n\n\nIndustry Experience\n\n\nExperience in program management role – Relevant roles: Consultant, Associate, Jr. Program Manager\n2+ years experience in a Big 4/Similar management consultancy roles\nExperience in EMS is a plus Skills, Abilities & Know-how Generalist Profile\nAbility to drive varied modules & ramp-up quickly\nStrong track record of performance across different projects/executing multiple project modules\n\n\nProject Management\n\n\nExperience of project management in cross functional environment with multiple dependencies\nKnow how of operational aspects of SMT (Surface Mount Technology) line setup\nExperience of establishing processes and improving them to enable smooth ramp up\nStrong Track record in executing roadmaps and project to success\nExceptional communication, people skills\n\n\nStakeholder Management\n\n\nWorking closely with the promoter to drive new business execution. Work in startup mode by managing a small team to drive results\nManage & work with team to achieve milestones Project Management:\nRunning forums and conducting regular check ins and tracking project progress by defining KPIs and driving accountability\nOwnership of business process analysis, process and system strategy definition, requirement documentation, and execution planning\nImplementing frameworks to enable enforcement and alignment of project timelines, milestones & objectives across functions to deliver high quality results\n\n\nSkills: business analysis,communication,stakeholder management,team management,project management,communication skills,process improvement,management,business process analysis,project,ems,operational planning,operational management\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-electronics-manufacturing-services-at-yo-it-consulting-4094840226?position=3&pageNum=72&refId=Mz5LEAf7jSU4t3WBJ4sgJQ%3D%3D&trackingId=XrfpqWKlr%2FS0a1Nh5kPJ9A%3D%3D"
}