{
    "job_id": "4095580165",
    "title": "Business Analayst",
    "company": "Miko",
    "location": "Mumbai Metropolitan Region",
    "description": "Summary\n\nMiko is an advanced consumer robotics company passionate about bringing the best of technology to young learners everywhere. Our robots use playful, conversational learning to educate, engage and entertain kids. Our robots have been designed for ages 5+, and we actively sell in the US, UK, UAE, India, along with 140 other countries.\n\nWe are looking for a Business analyst for our team. The person would be involved in identifying complex fuzzy problems, breaking them down into smaller parts and implementing creative, data-driven solutions. You would be responsible for defining, tracking and improving key metrics and communicating business trends to stakeholders.\n\nResponsibilities\n\n\nModel data in order to create reporting infrastructure/dashboards for business process management and data mining\nClosely work with the business/product teams to enable data driven decision making.\nExecute quantitative analysis that translates data into actionable insights\nDrive data driven decision making through the stakeholders\nInfluence new opportunities for business based on internal/ external data\nTranslate and analyze inefficiencies in current business process, research solution alternatives, and drive the team to adopt new and innovative ways of solving business problems\n\n\nWhat To Bring\n\n\nBachelors in Engineering, Computer Science, Math, Statistics, or related discipline from top tier college.\nMin 1-4 Years of experience in relevant role\nExperience in Analytics tools such as Mixpanel, Google analytics, Clevertap etc.\nExperience in analysing very large, complex, multi-dimensional data sets\nData Driven thinking, Sharp aptitude and excellent numerical acumen; ability to sift through large volumes of data.\n“Problem-solving is an important form of critical thinking”. Ability to understand the problem from all the perspectives (i.e. business, technical and end-user), analyze the available options and constraints and then, recommend possible solutions\nSelf-starter with ability to work in a fast-paced environment\nAbility to multitask and work on a diverse range of requirement\nKnowledge of statistical tools and techniques. Advanced Excel proficiency including Pivot tables, vlookup / hlookup, graphs etc.\nProficiency in data visualization and presentation; (Power BI, Tableau, Qlikview, Datastudio, etc)\n\n\nPreferred Technical Capabilities\n\n\nExpertise in SQL, Excel, other scripting languages (R, Python, etc.) and with experience in manipulating large data sets in a database.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analayst-at-miko-4095580165?position=1&pageNum=77&refId=x7m7XCf9mecSRbX%2FzrmwDg%3D%3D&trackingId=%2B2Djo2Hp6bi0f9BLErtomw%3D%3D"
}