{
    "job_id": "4096501034",
    "title": "Innovation Operations – Business Analyst Staff",
    "company": "Blackbaud India",
    "location": "Hyderabad, Telangana, India",
    "description": "As a member of the Innovation Operations Team, the Innovation Operations Business Analyst, Staff will monitor processes to make sure timely generation of customer-facing communications, run exception reports, queries and provide analytical support for new go to market strategies that have not yet been automated, identify opportunities to improve customer experience, support Order to Cash management in implementation of new and improved business systems and billing operations and quality assurance customer transactions. This role researches and identifies business needs, and then determines solutions to business problems. Solutions often include a software-systems development component, but may also consist of process improvement, planning, and policy development. The Business Analyst, Staff works closely with the business and technical teams and is a contributor to the requirements specification deliverable, writes the business and functional requirements, support external audit and ad hoc projects as required, including documentation of the existing flow.\n\nThe Business Analyst, Staff also monitor and maintain standard and reporting in Salesforce CPQ, Workday financials and internal / customer-related payment processing platforms and provide advice and recommendations to leadership team based on data and trends. In addition to Salesforce CPQ reporting, this role will analyze and standardize large data sets using data analytic tools such as Alteryx and Qlik, identify trends and exceptions and highlight potential areas of concern, identify control issues, ensure compliance with the organization’s standards, and automate analytic testing and time-sensitive transitions. The ideal candidate can undertake a variety of tasks and work diligently under pressure. This person is comfortable working with a high degree of attention to detail as well as incorporating new and effective ways to achieve better results.\n\nThe Business Analyst works collaboratively and independently to provide business analyst support for continuous improvements in our back office operations to enhance our customers’ experience, renewals performance and productivity while managing costs.\n\n\n\n\nWhat You'll Be Doing:\n\nRun reports, queries and provide analytical support innovative go to market strategies using tools like Alteryx and Qlik\nReview CPQ opportunities, quotes, orders, and contracts for completeness and accuracy\nOwn and analyze the customer data, look for insights, trends and provide data driven recommendations as frequently as needed\nWork with Contracts & Billing Team, Payments Accounting and other leadership teams to provide feedback on required changes, representing business impact and requirements\nUnderstand strategic business needs and plans for growth\nWork with various teams across the organization\nParticipate in different functionality testing scenarios for integration, system, and end user requirements\nLeads the overall drafting of the business requirements / use cases, test scripts / acceptance criteria, and training materials for various transformation initiatives\nParticipate in critical data clean-up and special projects\n\n\n\n\nWe're Looking For A Team Member Who:\n\nA passion for technology and an ability to identify new opportunities for efficiency and productivity\nDetail oriented during data processing to ensure accurate and timely transaction reporting\nWilling and able, to take an assertive role in contributing to the management of day-to-day activities of both internal and external team members for associated projects\nExperience having large datasets in Excel\nA team player and positive attitude\nAble to manage self-study training, including the ability to explore existing business operations and procedures as learning materials\nExhibits composure while in the spotlight, conveys information eloquently and effectively connects with a variety of audiences\nCoursework in Finance or Accounting preferred\nSalesforce CPQ and Workday Financials experience preferred\nBasic knowledge in Alteryx to write scripts and perform searches is a plus\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/innovation-operations-%E2%80%93-business-analyst-staff-at-blackbaud-india-4096501034?position=2&pageNum=35&refId=Qg1XFYd2a5oBsKA4VCuZSA%3D%3D&trackingId=tHuy0z9t3TzWamgmVkQPZQ%3D%3D"
}