{
    "job_id": "4096506776",
    "title": "Business Analyst, Amazon",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nAmazon and MX Player recently joined forces to accelerate premium free entertainment for 250 million users in India. With this acquisition, Amazon merged two of India’s most popular free AVOD (or ad-supported video on demand) services – MX Player and Amazon miniTV into one service - Amazon MX Player. Amazon MX Player is Amazon India’s big bet in terms of shaping the future of the free AVOD landscape in India. We are looking for senior creative leader, who can help shape our brand and creatives for our new exciting show slate. This is an exciting opportunity for someone who wants to work in a start-up like environment and is passionate about building clutter breaking creatives / marketing campaigns to build viewer interest for our new shows.\n\nYou Can Read About The Service Here\n\nhttps://www.aboutamazon.in/news/entertainment/amazon-minitv-mx-player-merger\n\nhttps://economictimes.indiatimes.com/industry/media/entertainment/amazon-merges-minitv-with-mx-player-to-create-a-free-streaming-giant/articleshow/114007982.cms\n\nWe are looking for someone with expertise in data analytics skills, strong business acumen, an ownership mindset and ability to clearly communicate. A successful candidate will develop a strong understanding of our business and make data-driven conclusions. They will be comfortable with ambiguity while working in a fast-paced dynamic environment. They will also continuously learn new systems, tools, and industry best practices to help design new tools that help our team automate, and accelerate analytics. In this role, you will leverage our data to drive insights around video viewership, advertising and content for the broader Amazon MX Player team. You will also support building metrics and reporting on them to senior leadership.\n\nKey job responsibilities\n\nKey job responsibilities\n\n\nOwn business and finance reporting and analytics\nGenerate actionable insights through the metrics, dashboards and deep dive analyses\nCommunicate data (written and verbal) in a clear, concise, and unambiguous manner\nInfluence critical business decisions with data\n\n\nBasic Qualifications\n\n\nBachelor's degree or equivalent\n2+ years of business analyst, data analyst or similar role experience\nExperience with data visualization using Tableau, Quicksight, or similar tools\nExperience with SQL\nExperience making business recommendations and influencing stakeholders\n\n\nPreferred Qualifications\n\n\nExpert-level knowledge of SQL\nStrong interpersonal, written, and oral communication skills\nAdvanced financial modeling & analytical skills\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ASSPL - Karnataka\n\nJob ID: A2849644\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-amazon-at-amazon-4096506776?position=17&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=rP6qkiL9yc%2FR52ilnD8Bag%3D%3D"
}