{
    "job_id": "4100936170",
    "title": "Senior Strategy & Operations Analyst",
    "company": "Wati",
    "location": "India",
    "description": "Wati is a rapidly growing CPaaS (Communication Platform as a Service) that offers innovative business messaging solutions for both SMBs and large enterprises. Our mission is to simplify business communication, starting with WhatsApp.\n\nBacked by global investors Sequoia, DST Global, and Tiger Global, we proudly stand as Shopify's first investment in Asia. Additionally, we're one of the industry's top Meta BSPs (Business Solution Providers).\n\nWe serve 12000+ customers across 100+ countries. As a remote-first company, we prioritize adaptability and inclusivity. Our talented team spans the globe, working collaboratively to drive innovation and empower businesses through WhatsApp.\n\nWe are growing fast, and we are now looking for a Sr. Strategy & Operations Analyst.\n\nAbout The Founders' Office\n\nThe Founders' Office plays a critical role in driving the strategic direction and operational excellence of Wati. We work closely with the founders to:\n\n\nDefine and execute on key strategic initiatives\nDevelop and monitor key performance indicators (KPIs) across the company\nDrive operational efficiency and improve processes\nConduct in-depth market research and competitive analysis\nSupport the founders in decision-making across various crucial aspects of the business\n\n\n\nRole & Responsibilities:\n\nWe are seeking a highly motivated and talented Senior Strategy and Operations Analyst to join our dynamic team. In this role, you will:\n\n\nStrategic Planning & Execution:\nSupport the development and execution of strategic plans and initiatives\nConduct market research, competitive analysis, and industry trend analysis\nDevelop and track key performance indicators (KPIs) and analyze data to identify areas for improvement\nOperational Excellence:\nAnalyze existing business processes and identify opportunities for improvement\nDevelop and implement new processes and workflows to enhance efficiency and productivity\nCollaborate with cross-functional teams to drive operational excellence across the organization\nProject Management:\nManage and execute high-impact projects from inception to completion\nDefine project scope, timelines, and any other key parameters needed to set up the project to succeed\nTrack project progress and ensure timely delivery of results\nData Analysis & Insights:\nCollect, analyze, and interpret data from various sources (e.g., databases, internal dashboards, surveys, market research reports)\nDevelop data-driven insights and recommendations to inform business decisions\nCommunication & Collaboration:\nEffectively communicate complex information to stakeholders at all levels\nBuild strong relationships with cross-functional teams across the organization\nInfluence stakeholders and drive consensus on key decisions\n\n\nRequirements\n\n\n3-5 years of experience in strategy, operations, management consulting, or a related field\nStrong analytical and problem-solving skills with the ability to break down complex problems into actionable steps and effectively communicate with stakeholders\nExcellent data analysis and interpretation skills with proficiency in Excel and data visualization tools.\nHighly motivated and results-oriented with a strong work ethic and the ability to thrive in a fast-paced environment\nA strong sense of ownership and the ability to independently drive projects to completion\nA passion for learning and a desire to continuously improve\n\n\n\nBonus Points:\n\n\nExperience in the SaaS industry\nExperience working in a high-growth startup environment\nSQL proficiency is a plus\nExperience with data analysis and visualization tools such as Google LookerStudio.\n\n\n\nKey Traits of a Successful Candidate:\n\n\nContext Switching: Ability to seamlessly transition between different tasks and priorities based on changing business needs\nLearning Agility: Willingness to learn new skills, technologies, and processes quickly and effectively\nProblem-Solving: Ability to break down complex problems into smaller, manageable components and develop effective solutions\nProcess Improvement: Ability to identify and analyze existing processes, identify areas for improvement, and implement new, more efficient workflows\nAdaptability: Comfortable with ambiguity and the constant evolution of priorities in a fast-paced startup environment\nProactive Contribution: Eager to identify opportunities to contribute beyond assigned tasks and proactively seek out new challenges\nData-Driven Decision Making: Ability to analyze data, draw meaningful insights, and use those insights to inform strategic decisions\nOwnership & Accountability: Takes full responsibility for assigned tasks and ensures their successful completion within agreed-upon timelines\nInfluence & Communication: Ability to effectively communicate and collaborate with stakeholders across different departments to achieve desired outcomes\nGrowth Mindset: Desire to continuously learn and grow alongside talented individuals in a dynamic and challenging environment\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-strategy-operations-analyst-at-wati-4100936170?position=3&pageNum=55&refId=rCPSt2W60wSZDZdAR5hPHw%3D%3D&trackingId=uqmNCh%2BvMBFz%2F34Dj2PtCA%3D%3D"
}