{
    "job_id": "4101162210",
    "title": "Lead Business Analyst – Wealth Management",
    "company": "EPAM Systems",
    "location": "Hyderabad, Telangana, India",
    "description": "We are looking for a dedicated and experienced Lead Business Analyst to join our Wealth Management team.\n\nThe successful candidate will play a crucial role in collaborating with both onshore and offshore teams to ensure the successful delivery of our wealth management solutions. Working within the 12 PM to 9 PM IST schedule, the analyst will act as a bridge between the product owners and development teams, driving the product vision and ensuring alignment with business goals.\n\nResponsibilities\n\n\n\nCollaborate with onsite proxy product owners to understand product vision and roadmap\nIdentify product capabilities, features, and functions\nDefine epics, stories, and success criteria\nElaborate stories, outline business logic, and expected business results\nManage product scope and prioritize capabilities, epics, and stories\nProvide feedback during sprint review demos\nTrack feedback to ensure inclusion in the backlog and prioritization\nAssist in incident triaging\nServe as the primary contact for business-related questions and clarifications\nConduct application user testing post-production deployment\nSet up test data as required by the development team\nOccasionally take on Scrum master responsibilities\n\n\n\nRequirements\n\n\n\nAt least 10-12 years of relevant experience\nProficiency in SQL for database queries\nBackground in financial services, preferably with expertise in wealth management\nStrong business acumen with the ability to provide business and end-customer perspectives\nExcellent communication and presentation skills\nExceptional attention to detail\nCapability to manage multiple tasks simultaneously\nDynamic individual with flexibility to adapt to changing business needs\n\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/lead-business-analyst-%E2%80%93-wealth-management-at-epam-systems-4101162210?position=4&pageNum=57&refId=a19Gt2bufEipNHhOPT%2FEtw%3D%3D&trackingId=UGa4NPhljFKUitTbYu3DIw%3D%3D"
}