{
    "job_id": "4101952618",
    "title": "Business analyst",
    "company": "Plugzmart",
    "location": "Chennai, Tamil Nadu, India",
    "description": "We are looking for a skilled and detail-oriented Business Analyst to join our team. The ideal candidate will act as a bridge between business stakeholders and technical teams, analysing business needs, defining requirements, and ensuring that solutions meet business objectives. The role requires strong analytical skills, excellent communication, and a deep understanding of business processes and technology.\n\nKey Responsibilities\n\nRequirement Gathering and Analysis\n\n\nCollaborate with stakeholders to gather, analyze, and document business requirements.\nTranslate business needs into detailed functional and technical specifications.\nIdentify gaps and areas of improvement in existing processes.\n\n\nSolution Development\n\n\nWork closely with developers, designers, and project teams to ensure solutions align with requirements.\nSupport the development and implementation of business solutions.\n\n\nStakeholder Communication\n\n\nAct as a liaison between business units, technology teams, and support teams.\nFacilitate workshops, meetings, and presentations with stakeholders.\n\n\nTesting and Quality Assurance\n\n\nDevelop and execute test plans to ensure solutions meet business requirements.\nConduct user acceptance testing (UAT) and document results.\n\n\nData Analysis and Reporting\n\n\nAnalyse data to identify trends, insights, and areas for improvement.\nDevelop reports, dashboards, and visualizations to support decision-making.\n\n\nProject Management Support\n\n\nAssist in project planning, tracking, and documentation.\nEnsure deliverables are completed on time and meet quality standards.\n\n\nKey Qualifications\n\n\nEducational Background: Bachelor’s degree in business administration, Information Technology, Computer Science, or a related field.\nExperience: 2–5 years of experience as a Business Analyst or in a similar role.\nTechnical Skills:\nProficiency in business analysis tools (e.g., JIRA, Confluence).\nStrong understanding of SQL and data analysis tools (e.g., Tableau, Power BI).\nFamiliarity with software development methodologies (Agile, Scrum).\nSoft Skills:\nExcellent communication and interpersonal skills.\nStrong problem-solving and critical-thinking abilities.\nAbility to prioritize and manage multiple tasks effectively.\n\n\nPreferred Skills\n\n\nCertifications such as CBAP (Certified Business Analysis Professional) or PMI-PBA.\nExperience with process modeling tools (e.g., BPMN, Visio).\nKnowledge of specific industries or business domains (e.g., finance, healthcare, retail).\n\n\nSkills: communication,data analysis,agile,jira,business analysis,visio,scrum,tableau,bpmn,sql,problem-solving,critical thinking,requirement gathering,power bi,confluence\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-plugzmart-4101952618?position=5&pageNum=45&refId=UbUFWb7IHPllL5XcmhINQg%3D%3D&trackingId=MZe5BtvL%2FEZli81diuJpJg%3D%3D"
}