{
    "job_id": "4102773395",
    "title": "Business Analyst",
    "company": "Cloudesign",
    "location": "Mumbai Metropolitan Region",
    "description": "Job Title: Sr. Business Analyst\n\nTeam: Data Science and AI\n\nLocation: Mumbai(Kalina)\n\nEducation Qualification: MBA, MTech. in Quantitative Streams\n\nWe are a multi-national logistics . Our Data Science function started in Apr, 2021. It Currently constitutes high performing individuals with rich experience from IITs, Tier 1 Institutions and Foreign Universities As part of the Digital Transformation Journey across the group, the Organization believes the DS Team is critical in harnessing better customer delight and competitive advantage. A long-term roadmap on critical DS initiatives has been established across the Group to achieve the targeted impact\n\nPreferred Technical Skills\n\nPython and SQL programming skills\n\nExperience with one of the data visualization and BI tool such as Tableau or Power BI ,Excel, and Presentation Skills\n\nRoles And Responsibilities\n\nActionable Insights: Utilizing available data and dashboards to extract relevant information that aligns with business goals and strategic objectives, providing leadership with clear recommendations for action.\n\nData Storytelling: Crafting compelling visual narratives that effectively communicate insights, making complex data accessible and understandable to stakeholders.\n\nCommunication and Presentation: Preparing and delivering presentations to leadership, ensuring clarity and relevance to drive informed decision-making.\n\nData-Driven Problem Solving: Analyzing business challenges by gathering and preparing data and developing data-driven solutions to address specific problem statements.\n\nCross-Functional Collaboration: Collaborating with teams across various departments (e.g., sales, finance, operations) to understand business challenges, gather data, and validate insights, fostering a holistic approach to analytics.\n\nDesired Candidate’s Profile\n\n\nPractical Experience: At least 3 years of hands-on experience in leveraging data to solve business problems and drive decision-making.\nInsight Development: Demonstrated ability to identify business challenges, gather and prepare data, create actionable insights, and present findings to management to facilitate informed actions.\nTechno-Functional Expertise: Strong understanding of business KPIs, coupled with technical skills in data analysis, statistics and visualization, to provide effective solutions that align with organizational goals.\nIndustry Knowledge: Experience in the logistics and transportation industry is desirable, enabling a better understanding of specific challenges and operational metrics within the sector.\nAnalytical Mindset: Strong problem-solving skills, with the ability to think critically and analytically to derive insights from complex data sets.\nCommunication Skills: Excellent verbal and written communication skills, capable of translating technical information into clear, actionable insights for diverse audiences.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-cloudesign-4102773395?position=8&pageNum=77&refId=x7m7XCf9mecSRbX%2FzrmwDg%3D%3D&trackingId=QKt%2FLQMUuSFGgPzLBid4QQ%3D%3D"
}