{
    "job_id": "4103692477",
    "title": "Business Analyst",
    "company": "UD Trucks",
    "location": "Bengaluru, Karnataka, India",
    "description": "Business Analyst\n\nDepartment : Connected Solutions site India (BP15059)\n\nBusiness Analyst\n\nAs a Business Analyst, you will be the interface between business stakeholders in International markets and product areas in UD Connected Solutions.\n\nCore responsibilities\n\n\nUnderstanding of As-Is Business process / solution and visualizing the to-be business process /solution\nResponsible for eliciting requirements from business stakeholders and conveying the same in form of user stories to product area teams\nGood to have knowledge of latest trends in technology\nBuild good relationship with business stakeholders in international markets\nAlways have end-user’s perspective and convey the same to product area teams\nHandle/ facilitate all contact with business stakeholders required by product area teams\nEnsure that requirements/ user stories are correctly understood and used by product area teams\nSupport prioritization of scope based on business stakeholder needs and business value\nSupport the product owner to secure and maintain complete solution documentation for its usage, deployment, and training\nInform/receive information about application disturbances, both internally and externally\nUnderstand business demands for information security and IT Security Directive\nAlways strive to make solutions efficient and user friendly\nSupport quality assurance activities of end user support, for example root cause analysis end-to-end support quality etc\nSupport and provide input regarding run-time budget and enhancement budget for solution(s)\nPerform Functional verification and Support Business stakeholders to perform UAT\nSupporting recruitment team in taking technical interviews for junior-level positions.\n\n\nQualifications & Competencies\n\n\nEngineering Degree in IT area, preferably in B.E/B.Tech or any masters.\nMinimum of 6 years’ experience related to IT Business Analyst role\nStrong listening skills and ability to articulate customer’s needs for solution development\nUnderstanding of how to make technical solutions based on customer requirements\nExperience working in AWS environment with micro-services architecture\nExposure to development of IoT or cloud-based solutions in automotive/ transportation/ logistics domain is an added advantage\nAbility in agile or in a fast-changing environment (proven knowledge in SAFe methodology considered a merit)\nExposure to Jira & confluence is considered a merit\nGood computer skills in using Word, Power Point.\nGood communication skills, both in writing and verbally, English mandatory\nExperience working as a scrum master in Agile or SAFe methodology\n\n\nAbout UD Trucks\n\nPart of the Isuzu group, UD Trucks is a global leading international commercial vehicle solutions provider headquartered in Japan. At UD Trucks, we are defining the next generation of smart logistics solutions through advanced innovations in automation, electro mobility and connectivity. UD Trucks develops, manufactures and sells a wide range of heavy, medium and light-duty trucks, operating in more than 60 countries across all continents. Our trucks and people go the extra mile for our customers and business partners, day in and day out.\n\nWe are an 8,000+ strong team of colleagues with 40 nationalities who bring diversity and passion in delivering our products and services. We trust each other, work collaboratively and embrace change. At UD Trucks, our purpose is Better Life – to make life better for people and the planet. We have developed a culture that promotes:\n\nDiverse and friendly culture – Strong culture of diversity and inclusion, organizing annual events, daily activities and open communication platforms including various internal voluntary networks.\n\nEmpowered growth – Global exposure and growth opportunities across functions and countries through internal mobility system and self-driven career opportunities, building a learning organization by enabling self-managed learning supported by the UD Academy.\n\nFlexibility with trust – We continue to fully support both remote working (where and when applicable) and flexible working hours, we actively encourage our colleagues to maintain a good work/life balance. You will have the autonomy and flexibility to split your working time between both our wonderful, modern and equipped HQ and remotely.\n\nBe part of our journey to create Better Life for society, for our customers and for yourself. UD Trucks is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all our colleagues.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-ud-trucks-4103692477?position=5&pageNum=77&refId=x7m7XCf9mecSRbX%2FzrmwDg%3D%3D&trackingId=dy7ZgqaUR0%2BBnn%2BdxhXXjQ%3D%3D"
}