{
    "job_id": "4103372319",
    "title": "Business Operations Analyst, Staff",
    "company": "Qualcomm",
    "location": "Bengaluru, Karnataka, India",
    "description": "Company\n\nQualcomm India Private Limited\n\nJob Area\n\nOperations Group, Operations Group > Business Operations\n\nGeneral Summary\n\nProvides operational support based on knowledge of relevant business systems, products, processes, and procedures and supports operational activities for business growth. Contributes to and updates plans and monitors, collects, and analyzes program/product metrics (e.g., forecasts, budgets, demands, KPIs). Establishes market baselines and contributes to forecasting analyses, processes, and reports, and addresses supply/demand related issues. Contributes to pricing execution and resolves pricing and rebate issues. Formally presents and communicates key metrics and findings\n\nMinimum Qualifications\n\n\nBachelor's degree in Business Administration, Engineering, Finance, Marketing, or related field and 5+ years of business operations or related experience.\n\n\n\nOR\n\nAssociate's degree in Business Administration, Engineering, Finance, Marketing, or related field and 7+ years of business operations or related experience.\n\nAbout GBFS Team: The Global Business and Finance Support (GBFS) team provide support to HQ and global regional team on Finance & Business Operation activities. This job role is for Sales operations related activities – Company Master data updates, Pipeline health management, pipeline opportunities reporting, New Channel Partner Onboarding in Salesforce system for Compute GTM, Support annual Channel Program renewal process activities within Salesforce, handling JIRA tickets, data updation & validation and analytics, and basic analytics.\n\nGeneral Job Summary: The role is responsible for internal support to HQ, Sales Teams and customer service to enabling them in facing any issues or update them using Salesforce tool and provide world-class support regarding Qualcomm’s products and services. The ideal candidate will be passionate about delivering and cultivating excellent internal support throughout the organization. Responsibilities include, but not limited to the following activities: Qualcomm support Ticket Processing (JIRA), Manage iProc submission (new, change), approvals progress, communications based on approved Program Funding and GCI forecast information, provide timely readiness status for all Channel Partners undergoing the onboarding and agreement process and other key duties. Must be savvy and quick to learn and adjust to all Qualcomm business applications such as Salesforce, Advance Excel, Oracle ERP, SAP, Agile (JIRA) and others as they are integrated into the business, as well as effectively adapt to new processes as they are rolled-out.\n\nJob Overview\n\nUtilizing Qualcomm systems, manages delegated support to HQ, Sales team and customer service and support activities including but not limited to:\n\n\nEnsure timely updates of company master data like EPR request, customer billing, shipping address, etc.\nDevelop and maintain a centralized, globally scalable Channel Partner onboarding process\nSupport annual Channel Program renewal process activities within Salesforce\nMaintain onboarding dashboards content, for leadership and cross-functional team awareness, alignment – Tableau, Power BI, VBA Macros\nEngage with existing Channel Partners to confirm banking and tax information is unchanged (“Inactive” partner engagement)\nMaintain process guide for iProc creation, inclusive of correct charge accounts per region and approval requirements.\nDevelop a reporting process to mitigate risk and drive quality engagements for all cross functional compute teams\nIntegrate existing data reports to minimize delays from manual report updates and email communication.\nExpand budget management process to include Co-Marketing and Incremental budgets.\nSetup controls and validations to ensure accuracy\nTransition to full Salesforce and Tableau management\nMap and define data requirements to create a new Agreement management workflow in Salesforce\nHas thorough knowledge of all business systems, processes and procedures and should be able to provide training to other team members, when requested\nPerforms other related duties as delegated from HQ Team\n\n\n\nJob Specifications\n\n\nExperience of Salesforce, Oracle ERP, SAP is an advantage\nCan identify issues and root causes and uses own judgement to provide feedback solutions to complex problems and can identify the potential solutions\nEffectively and quickly adapts to new systems, processes, and policies\nAbility to remain calm under pressure\nExercises analytical skill within generally defined practices using a variety of sources in order to find solutions\nBe results oriented with great attention to detail\nStrong multitasking skills with the ability to prioritize own work and respond to ad hoc requests as needed; able to make quick and accurate decisions\nCollaborates openly, respectfully, and inclusively creating trusting relationships within own and wider teams and to customers in order to explain issues, gain insights and develop connections.\nCandidate should be available to work shifts from 2:30 PM to 11:30 PM IST.\n\n\n\nEducation/Experience\n\n\n10+ years related experience in Sales Operations and in a technology-oriented industry. Semiconductor industry preferred.\nExcellent in Salesforce with Salesforce Admin Certified preferred, VALORX, VBA Macros Power BI and Tableau\nExcellent in Advanced Excel knowledge\nMaster’s degree in business management / analytics, operations\nAbility to focus on details, multitasking, Process reviewer of activities timely & quality\nPlanning & prioritization of work assigned.\nPositive attitude and willingness to learn and upskills with tools - Tableau, Power BI etc.\nStrong analytical, problem solving and conceptual skills.\nStrong written and verbal communication skills.\n\n\n\nApplicants: Qualcomm is an equal opportunity employer. If you are an individual with a disability and need an accommodation during the application/hiring process, rest assured that Qualcomm is committed to providing an accessible process. You may e-mail disability-accomodations@qualcomm.com or call Qualcomm's toll-free number found here. Upon request, Qualcomm will provide reasonable accommodations to support individuals with disabilities to be able participate in the hiring process. Qualcomm is also committed to making our workplace accessible for individuals with disabilities. (Keep in mind that this email address is used to provide reasonable accommodations for individuals with disabilities. We will not respond here to requests for updates on applications or resume inquiries).\n\nQualcomm expects its employees to abide by all applicable policies and procedures, including but not limited to security and other requirements regarding protection of Company confidential information and other confidential and/or proprietary information, to the extent those requirements are permissible under applicable law.\n\nTo all Staffing and Recruiting Agencies: Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.\n\nIf you would like more information about this role, please contact Qualcomm Careers.\n\n3069510\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-operations-analyst-staff-at-qualcomm-4103372319?position=6&pageNum=22&refId=0jgrzIiQy2IEpj2UlbmQnQ%3D%3D&trackingId=5PBHNp95IHvldy%2BKqCO5MQ%3D%3D"
}