{
    "job_id": "4104735898",
    "title": "Business Analyst - I, Selling Partner Support",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nHave you ever thought about what it takes to detect and prevent fraudulent activity among hundreds of millions of eCommerce transactions across the globe? What would you do to increase trust in an online marketplace where millions of buyers and sellers transact? How would you build systems that evolve over time to proactively identify and neutralize new and growing fraud threats?\n\nDo you enjoy working in an entrepreneurial, fast paced environment, solving complex problems and delivering innovative solutions? Do you like to innovate and simplify?\n\nOur mission in Customer Trust and Partner Support (CTPS) is to make Amazon.com the safest place to transact online. CTPS safeguards every financial transaction across all Amazon sites, while striving to ensure that these efforts are transparent to our legitimate customers. As such, CTPS designs and builds the software systems, risk models and operational processes that minimize risk and maximize trust in Amazon.com.\n\nAs a Business Analyst in CTPS, you will be responsible for modeling forecasting problems, discovering insights and identifying opportunities through the use of statistical, machine learning, algorithmic, data mining and visualization techniques. You will need to collaborate effectively with internal stakeholders and cross-functional teams to analyse forecast variances, identify opportunities to improve operational efficiencies, and deliver successfully against high organizational standards. The candidate should be able to apply a breadth of tools, data sources and analytical techniques to answer a wide range of high-impact business questions and present the insights in concise and effective manner. Additionally, the candidate should be an effective communicator capable of independently driving issues to resolution and communicating insights to non-technical audiences. This is a high impact role with goals that directly impacts the bottom line of the business.\n\nYou will be responsible for analyzing and identify specific instances of risk, broader risk trends and points of customer friction, developing scalable solutions for prevention. You will need to collaborate effectively with business and within CTPS and cross-functional teams to solve problems, create operational efficiencies, and deliver successfully against high organizational standards. You should be able to apply a breadth of tools, data sources, and analytical techniques to answer a wide range of high-impact business questions and proactively present new insights in concise and effective manner. In addition you will be responsible for building a robust set of operational and business metrics and will utilize metrics to determine improvement opportunities.\n\nYou should be an effective communicator capable of independently driving issues to resolution and communicating insights to non-technical and technical audiences. This is a high impact role with goals that directly impacts the bottom line of the business.\n\nBasic Qualifications\n\n\n1+ years of tax, finance or a related analytical field experience\n2+ years of complex Excel VBA macros writing experience\nExperience defining requirements and using data and metrics to draw business insights\nExperience with SQL or ETL\n\n\nPreferred Qualifications\n\n\nExperience working with Tableau\nExperience using very large datasets\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI - Karnataka\n\nJob ID: A2856167\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-i-selling-partner-support-at-amazon-4104735898?position=10&pageNum=47&refId=al9nUfzCZGF%2B%2BRebT5L1EA%3D%3D&trackingId=l1cTwJpwp8M79i2goN%2BMSg%3D%3D"
}