{
    "job_id": "4110432450",
    "title": "Business Analyst, Mobile App",
    "company": "E.L.F. BEAUTY",
    "location": "Ahmedabad, Gujarat, India",
    "description": "About The Company\n\ne.l.f. Beauty, Inc. stands with every eye, lip, face and paw. Our deep commitment to clean, cruelty free beauty at an incredible value has fueled the success of our flagship brand e.l.f. Cosmetics since 2004 and driven our portfolio expansion. Today, our multi-brand portfolio includes e.l.f. Cosmetics, e.l.f. SKIN, pioneering clean beauty brand Well People, Keys Soulcare, a groundbreaking lifestyle beauty brand created with Alicia Keys and Naturium, high-performance, biocompatible, clinically-effective and accessible skincare.\n\nIn our Fiscal year 24, we had net sales of $1 Billion and our business performance has been nothing short of extraordinary with 24 consecutive quarters of net sales growth. We are the #2 mass cosmetics brand in the US and are the fastest growing mass cosmetics brand among the top 5. Our total compensation philosophy offers every full-time new hire competitive pay and benefits, bonus eligibility (200% of target over the last four fiscal years), equity, flexible time off, year-round half-day Fridays, and a hybrid 3 day in office, 2 day at home work environment. We believe the combination of our unique culture, total compensation, workplace flexibility and care for the team is unmatched across not just beauty but any industry.\n\nVisit our Career Page to learn more about our team: https://www.elfbeauty.com/work-with-us\n\nWe are seeking a skilled Mobile Business Analyst with 5 years of experience to join our team. The successful candidate will play a key role in driving the success of mobile applications by bridging the gap between business goals and technical execution. The ideal candidate should have a deep understanding of the mobile ecosystem, strong problem-solving abilities, and the capability to collaborate effectively with cross-functional teams.\n\nResponsibilities\n\n\nRequirements Gathering: Collaborate with product managers, stakeholders, and end-users to gather, document, and analyze business needs specific to mobile platforms (iOS/Android).\nUser Journey Mapping: Develop user stories and mobile-specific workflows, focusing on customer experience, usability, and app performance.\nSolution Design: Partner with UX/UI designers, mobile developers, and QA teams to design and deliver intuitive, responsive, and high-performing mobile solutions\nDocumentation: Prepare detailed documentation, including business requirements, functional specifications, wireframes, and user stories tailored to mobile app development.\nStakeholder Communication: Act as the primary liaison between business teams and mobile app development teams, ensuring that mobile-specific requirements are clearly understood and implemented.\nTesting & Validation: Work closely with QA teams to define acceptance criteria and perform user acceptance testing (UAT) for mobile applications\nProject Management Support: Assist in tracking the progress of mobile app development projects, manage timelines, and ensure timely delivery of features\n\n\n\nPreferred Qualifications\n\n\nAgile/Scrum Experience: Familiarity with agile development methodologies, specifically in mobile environments.\nExperience in managing end-to-end mobile product lifecycle, from concept to deployment.\nMobile CRM/Push Notification: Systems Experience working with CRM platforms and mobile-specific engagement tools like Push Notifications or In-App Messaging\n\n\n\nThis job description is intended to describe the general nature and level of work being performed in this position. It also reflects the general details considered necessary to describe the principal functions of the job identified, and shall not be considered, as detailed description of all the work required inherent in the job. It is not an exhaustive list of responsibilities, and it is subject to changes and exceptions at the supervisors’ discretion.\n\ne.l.f. Beauty respects your privacy. Please see our Job Applicant Privacy Notice (www.elfbeauty.com/us-job-applicant-privacy-notice) for how your personal information is used and shared.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-mobile-app-at-e-l-f-beauty-4110432450?position=6&pageNum=70&refId=HPHgp9Y9QvXuYD8UMhcuvA%3D%3D&trackingId=mO3iZYj7CQX3CACQNj8dsA%3D%3D"
}