{
    "job_id": "4111430914",
    "title": "Business Analyst",
    "company": "Acuvate",
    "location": "Hyderabad, Telangana, India",
    "description": "Role : Business Analyst\n\nLocation : Hyderabad\n\nExperience : 5+ years\n\nJob Type : Full-time\n\nJob Summary\n\nWe are seeking an experienced and results-driven Business Analyst (BA) with prior experience in handling US/UK-based projects.\n\nThe ideal candidate will be responsible for gathering and analysing business requirements, driving process improvements, and working closely with cross-functional teams to deliver solutions that meet the specific needs of stakeholders in the US and UK markets.\n\nAs a key member of our team, you will play a critical role in ensuring seamless communication between global teams, providing strategic insights, and executing projects that enhance business performance.\n\nKey Responsibilities\n\n\nEngage with stakeholders from US/UK-based clients or teams to understand their business needs and gather detailed requirements.\nDocument and prioritize requirements, ensuring clarity and alignment with business objectives.\nFacilitate workshops and meetings with stakeholders across different time zones (US/UK) to gather, validate, and refine business requirements.\nConduct in-depth analysis of business processes and workflows to identify gaps, inefficiencies, and areas for improvement.\nPropose recommendations and assist in designing solutions to enhance business processes.\nCollaborate with US/UK teams to implement process improvements that align with regional market needs.\nWork closely with IT teams, product managers, and developers to design and implement solutions tailored for US/UK markets.\nEnsure that all solutions meet the business requirements and are in line with local regulations and market dynamics.\nOversee the development and execution of test plans, including User Acceptance Testing (UAT) with teams based in the US/UK.\nServe as the primary point of contact between US/UK stakeholders and internal teams.\nCommunicate project progress, risks, and issues to stakeholders in both the US and UK, ensuring alignment and transparency.\nManage cross-time-zone collaboration, ensuring timely and effective communication between teams in different locations.\nAnalyze data trends to provide insights specific to the US/UK markets, identifying opportunities for optimization and business growth.\nPrepare detailed reports and presentations to communicate findings and recommendations to senior leadership, with a focus on US/UK performance metrics.\nUse business intelligence tools to generate reports tailored to US/UK stakeholder requirements.\n\n\nRequired Qualifications\n\n\nBachelor's degree in information technology, or a related field.\n5+ years of experience in business analysis, with proven experience in handling US/UK projects.\nProficiency in gathering business requirements, process mapping, and data analysis, with a focus on international markets.\nFamiliarity with regulatory and compliance standards for business operations in the US/UK.\nStrong experience in cross-functional collaboration, working with teams from different regions (US/UK).\nProficiency in project management tools and business analysis tools (e.g. , Jira, Trello, MS Visio, etc.\nKnowledge of project management methodologies like Agile or Waterfall.\nStrong written and verbal communication skills, especially in managing cross-regional communications.\nAbility to manage projects across multiple time zones and communicate effectively with international teams\n\n\n(ref:hirist.tech)\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-acuvate-4111430914?position=9&pageNum=70&refId=HPHgp9Y9QvXuYD8UMhcuvA%3D%3D&trackingId=SIokAv5sv5Wyt2Hgy%2B0PUQ%3D%3D"
}