{
    "job_id": "4111774858",
    "title": "Business Analyst",
    "company": "MyNextHire, AI-First ATS",
    "location": "Pune, Maharashtra, India",
    "description": "As a Business Analyst / Implementation Consultant for our AI-first Applicant Tracking System (ATS), you will play a critical role in seamlessly onboarding new clients. Your main objective will be to understand each client's unique recruitment needs, map these requirements to our ATS features, and provide consultative guidance on industry best practices. This role demands a blend of analytical ability, technical knowledge, and consultative skills to ensure smooth client transitions and sustained user adoption.\n\nResponsibilities\n\n\nEngage with new clients to understand their recruitment workflows, pain points, and objectives.\nIdentify and document client-specific requirements, and map these to our ATS functionalities.\nCustomize the client onboarding experience by adapting the ATS setup to align with each client's unique goals.\nAdvise clients on recruitment and ATS optimization best practices, drawing from your knowledge of industry standards and data-driven insights.\nEducate clients on how to leverage the full suite of ATS features to maximize efficiency, reduce time-to-fill, and improve hiring quality.\nConduct regular check-ins to provide ongoing recommendations and drive continuous improvement in client usage.\nConfigure the ATS platform according to the client's defined needs, ensuring all required settings, workflows, and integrations are in place.\nCoordinate with internal product and support teams to resolve any configuration challenges during implementation.\nVerify and validate the setup to ensure functionality aligns with the expected client outcomes.\nConduct training sessions for client teams, ensuring end-users are proficient in using the ATS and understand how it can support their objectives.\nDevelop user guides, FAQs, and other client-specific documentation for smooth transition and onboarding.\n\n\nRequirements\n\n\nProven experience as a Business Analyst, Implementation Consultant, or similar role in HR tech or ATS solutions.\nStrong analytical skills with the ability to translate complex requirements into practical configurations.\nExceptional communication skills, both for training and for consultative discussions.\nFamiliarity with recruitment processes and a keen understanding of industry trends and challenges.\n\n\nThis job was posted by Nidhi K from MyNextHire.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-mynexthire-ai-first-ats-4111774858?position=7&pageNum=80&refId=A63P04dNUmAIICc%2BzvhEHA%3D%3D&trackingId=yTZurGuFahcsZK1gjhOBfA%3D%3D"
}