{
    "job_id": "4113832923",
    "title": "Business Analyst",
    "company": "FintastIQ",
    "location": "India",
    "description": "About Us:\n\nFintastIQ is a strategy consultancy specializing in pricing, marketing, and growth strategy for start-ups, growth-stage tech, and private equity portfolio companies. We help our clients grow and scale to achieve sustainable impact. Our team brings extensive experience from top-tier consulting firms, offering innovative solutions our clients can bring to life in a matter of weeks.\n\n\n\n\nPosition Overview:\n\nWe are seeking a motivated and detail-oriented Business Analyst to join our dynamic team at FintastIQ. This position offers a unique opportunity to gain hands-on experience in strategy consulting, working closely with clients and seasoned professionals. The ideal candidate is a recent graduate with 1-2 years of experience at a strategy consultancy, such as McKinsey, BCG, or Bain, with a strong interest in business strategy, analytics, and consulting.\n\n\n\n\nKey Responsibilities:\n\nAssist in data collection, analysis, and interpretation to support client projects.\nConduct market research and competitive analysis to identify industry trends and market opportunities.\nCollaborate with team members to develop strategic recommendations and presentations.\nSupport the preparation of client deliverables, including reports, presentations, and proposals.\nParticipate in client meetings and internal problem solving sessions.\nContribute to the development of client learning materials and thought leadership content.\nPerform other administrative and project-related tasks, as needed.\n\n\n\n\nQualifications:\n\nBachelors degree, preferably in Business, Economics, Finance, Marketing, or a related field.\nStrong analytical and problem-solving skills.\nExpert in Microsoft Office Suite (Excel, PowerPoint, Word).\nProficient with Tableau, PowerBI, Python, and/or Alteryx.\nExcellent written and verbal communication skills.\nAbility to work independently and collaboratively in a fast-paced environment.\nDetail-oriented with strong organizational skills.\nPrior work experience in strategy consulting, pricing, or marketing is required.\n\n\n\n\nWhat We Offer:\n\nA hands-on learning experience with exposure to real-world business challenges.\nMentorship from experienced professionals with backgrounds in top-tier consulting firms.\nOpportunity to contribute to impactful projects for high-growth companies and private equity portfolio companies.\nA collaborative and inclusive work environment that values diversity and innovation.\nCompetitive compensation for the internship duration.\n\n\n\n\nHow to Apply:\n\nInterested candidates should submit their resume and a cover letter outlining their interest and relevant skills/experience.\n\n\n\n\nFintastIQ is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-fintastiq-4113832923?position=6&pageNum=5&refId=lj%2BaylP9Zxb0xcLPbmF98Q%3D%3D&trackingId=RKSJEpf1UcJsxlcw97RrmA%3D%3D"
}