{
    "job_id": "4114506909",
    "title": "Business Analyst",
    "company": "Guidewire Software",
    "location": "Bengaluru, Karnataka, India",
    "description": "Summary\n\nDigital at Guidewire\n\nLove solving sticky problems? Excited about crafting innovative solutions for a leading global software company in the Insurance space? Interested in working on digital solutions and services that touch everyone's lives? We are a multidisciplinary Digital team working to make innovative solutions that are at the forefront of the business transformation within the insurance industry.\n\nThe Guidewire Digital Practice is a group of highly motivated technology engineers, user experience designers, and domain experts working with insurance clients, InsurTechs and delivery partners in current, leading-edge technologies delivering exciting, customer-facing projects.\n\nWe are seeking individuals with deep P&C Insurance Domain experience to work across Business, User Experience (UX) design, and Digital Engineering in an agile, collaborative, and dynamic environment across multiple client projects.\n\nWe consider digital transformation a team sport where, together with our clients, we strategically solve by balancing business realities with innovative and scalable solutions for both enterprise and customer facing applications.\n\nWe're committed to an inclusive workspace that embraces people with diverse backgrounds, experiences, skills, and talents.\n\nJob Description\n\nTo be considered you should have a combination of experience in the following:\n\n\nCollaborate with stakeholders to elicit and document business and system requirements specific to P&C insurance products and services.\nConduct workshops, interviews, and focus groups with insurance professionals to understand pain points, workflow requirements, and business rules.\nCollaborate with insurance carrier business and Si partner resources across business, technology, and UX to produce business requirements and business process documents\nLearn and master the functionality provided by Guidewire applications) in order to become a customer facing professional\nservices consultant\nAnalyze and map out existing P&C insurance processes and workflows, identifying areas for improvement and recommending solutions.\nTranslate business requirements into detailed functional specifications for software development teams.\nCommunicate with stakeholders to ensure necessary buy-in\nWork in an Agile environment\nWork with product managers to refine product features and identify opportunities for new insurance software modules.\nPrepare and present reports, demos, and updates to both technical and non-technical stakeholders.\n\n\nWhat You Need To Be Successful\n\n\nBachelor of Computer Science / Arts or equivalent\n2-4 years project experience in insurance, technology, or a related field.\nIndustry knowledge of the P&C insurance industry with primary focus on customer facing operations and processes\nCapability to communicate clearly and efficiently as well as influence outcomes\nAbility to solve complex problems analytically\nAbility to research solutions and work with subject matter experts where necessary\nAbility to identify when business requirements are not in scope\nExperience with software implementation projects) in requirements gathering, functional specifications, and user acceptance testing\nUnderstanding of a project life cycle methodology.\nFamiliar working with UX, Data, and Digital teams is a plus.\nApplying principles of a design-led approach is also a plus\nExceptional documentalon skills, and the ability to facilitate discussions with both technical and business stakeholders\nGood communication skills, both written and verbal, with the ability to present complex data in a simple and actionable way.\nDetail-oriented with strong organizational skills.\nEagerness to learn and grow in the role with a proactive approach to problem-solving.\nAbility to work both independently and in a team-oriented environment.\nFlexibility to work shifts as needed (to align with colleagues/customers in AMER/APAC)\nProduct Expertise: Learn and master your assigned Guidewire product and pass the required Guidewire certification as a Subject matter expert within the expected timeframe.\n\n\nHow we work @ Guidewire\n\n\nCollaboration: We build on each other's ideas and draw on interdisciplinary approaches to craft impactful experiences.\nIntegrity: We stand behind our words and commitments as part of a global community, respecting and recognizing our interdependence.\nCuriosity: We are lifelong learners, with a growth mindset, who are passionate about advancing our discipline through entertaining new ideas and unique perspectives.\nHumility: We leverage our expertise while respecting other viewpoints and challenging our own assumptions.\n\n\nAbout Guidewire\n\nGuidewire is the platform P&C insurers trust to engage, innovate, and grow efficiently. We combine digital, core, analytics, and AI to deliver our platform as a cloud service. More than 540+ insurers in 40 countries, from new ventures to the largest and most complex in the world, run on Guidewire.\n\nAs a partner to our customers, we continually evolve to enable their success. We are proud of our unparalleled implementation track record with 1600+ successful projects, supported by the largest R&D team and partner ecosystem in the industry. Our Marketplace provides hundreds of applications that accelerate integration, localization, and innovation.\n\nFor more information, please visit www.guidewire.com and follow us on Twitter: @Guidewire_PandC.\n\nGuidewire Software, Inc. is proud to be an equal opportunity and affirmative action employer. We are committed to an inclusive workplace, and believe that a diversity of perspectives, abilities, and cultures is a key to our success. Qualified applicants will receive consideration without regard to race, color, ancestry, religion, sex, national origin, citizenship, marital status, age, sexual orientation, gender identity, gender expression, veteran status, or disability. All offers are contingent upon passing a criminal history and other background checks where it's applicable to the position.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-guidewire-software-4114506909?position=1&pageNum=27&refId=qUEK%2BRRfTlwms%2BZrzTuWbg%3D%3D&trackingId=vtBq18P3rrfHfXqOlFD3RA%3D%3D"
}