{
    "job_id": "4114549561",
    "title": "Business Analyst I, Buyer Abuse Prevention -Analytics",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nAmazon.com’s Buyer Risk Prevention (BRP) mission is to make Amazon the safest and most trusted place worldwide to transact online. Amazon runs one of the most dynamic e-commerce marketplaces in the world, with nearly 2 million sellers worldwide selling hundreds of millions of items in ten countries. BRP safeguards every financial transaction across all Amazon sites. As such, BRP designs and builds the software systems, risk models and operational processes that minimize risk and maximize trust in Amazon.com. BRP organization is looking for a Business Analyst for its In Region support team. The team is being grown to provide insights and support for BRP in our emerging marketplaces and provide analytical solutions to help drive operational efficiencies, uncover the hidden risks and trends, reduce investigation errors and bad debt, improve customer experience and predict & recommend the optimizations for future state of BRP buyer abuse in each country.\n\nAs a Business Analyst, you will be responsible for modeling complex problems, discovering insights and identifying opportunities through the use of business intelligence, data mining and visualization techniques. You will need to collaborate effectively with internal stakeholders and cross-functional teams to solve problems, create operational efficiencies, and deliver successfully against high organizational standards. The candidate should be able to apply a breadth of tools, data sources and analytical techniques to answer a wide range of high-impact business questions and present the insights in concise and effective manner. Additionally, the candidate should be an effective communicator capable of independently driving issues to resolution and communicating insights to non-technical audiences. This is a high impact role with goals that directly impacts the bottom line of the business.\n\nResponsibilities\n\n\nUse analytics and data mining techniques to solve complex problems and drive business decisions.\nEmploy the appropriate tools, methodologies to discover patterns of risks, abuse and help reduce bad debt\nDesign experiments, test hypotheses, and build actionable models to optimize BRP in a specific country\nSolve analytical problems, and effectively communicate methodologies and results\nBuild analyses for product launches\nDraw inferences and conclusions, and create dashboards and visualizations of processed data, identify trends, anomalies\nWork closely with internal stakeholders such as business teams, engineering teams, and partner teams and align them with respect to your focus area\n\n\nBasic Qualifications\n\n\n1+ years of tax, finance or a related analytical field experience\nExperience defining requirements and using data and metrics to draw business insights\nExperience with SQL or ETL\n\n\nPreferred Qualifications\n\n\nExperience working with Tableau\nExperience using very large datasets\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - Amazon Dev Center India - Hyderabad\n\nJob ID: A2853715\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-i-buyer-abuse-prevention-analytics-at-amazon-4114549561?position=5&pageNum=80&refId=A63P04dNUmAIICc%2BzvhEHA%3D%3D&trackingId=%2B6ObtyGRSYA4auRxWTF7Ag%3D%3D"
}