{
    "job_id": "4117294223",
    "title": "Lead Business Analyst",
    "company": "Meesho",
    "location": "Bengaluru, Karnataka, India",
    "description": "About The Team\n\nYou’ll be part of the Analytics Team at Meesho. We are trying to revolutionize the way our consumers shop online by experimenting with a video based shopping format.\n\nAbout The Role\n\nAs a Lead Business Analyst, you will work on improving the reporting tools, methods, and processes of the team you are assigned to. You will also create and deliver weekly, monthly and quarterly metrics critical for tracking and managing the business. You will manage numerous requests concurrently and strategically, prioritising them when necessary.\n\nYou will actively engage with internal partners throughout the organisation to meet and exceed customer service levels and transport-related KPIs. You will brainstorm simple, scalable solutions to difficult problems, and seamlessly manage projects under your purview. You will maintain excellent relationships with our users – and in fact, advocate for them – while keeping in mind the business goals of your team.\n\nWhat You Will Do\n\n\nCreate various algorithms for optimizing demand and supply data\nConduct analysis and solution-building based on insights captured from data\nGive insights to management and help in strategic planning\nAnalyze metrics, key indicators and other available data sources to discover root causes of process defects\nSupport business development and help to create efficient designs and solution processes\nDetermine efficient utilization of resources\nResearch and implement cost reduction opportunities\n\n\n\nMust Have Skills\n\n\nB.Tech/M.Tech /MBA in any discipline\n4+ years of experience as a Business Analyst\nProficiency in Advanced Excel and Advanced SQL (must-have) – Python is Plus\nUnderstanding of basic statistics and probability concepts\nProven problem-solving skills\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/lead-business-analyst-at-meesho-4117294223?position=3&pageNum=22&refId=0jgrzIiQy2IEpj2UlbmQnQ%3D%3D&trackingId=No7PYB2YPBgEs2WBmACH4g%3D%3D"
}