{
    "job_id": "4117253460",
    "title": "Business Analyst Specialist - FINTECH",
    "company": "Nasdaq",
    "location": "Bengaluru East, Karnataka, India",
    "description": "The Nasdaq Client Clearing Engineering organization is expanding our technology center in Bengaluru (Bangalore). We are looking for a BA Specialist to join our newly started NRTC (Nasdaq Real Time Clearing) team.\n\nThis is an opportunity to join the FINTECH segment of the world’s leading exchange technology company. Our fintech aims to modernize markets by providing cutting edge solutions for external clients. Our clients include high profile organizations like Hong Kong Exchange, Singapore Exchange, Australian Securities Exchange, Swiss Exchange and Brazil Exchange. If innovation and efficiency drives you forward this is the place for you!\n\nWe are looking for candidates who share those values along with a genuine desire & drive to deliver top technology\n\nJoin the NRTC Team within Nasdaq Marketplace Technology in Bangalore. It is a new team in Bangalore, which will be working for Stock Exchanges, Global Clearing Houses & Central Securities Depositories.\n\nNRTC product is a proven multi-asset clearing solution that combines outstanding performance with exceptional adaptability. It is crafted to meet the task for high performance with low latency, control risk with sophisticated post-trade clearing workflows and risk management. The Business Analyst’s role leads requirements across the system development lifecycle to ensure that the characteristic of the functionality is mutually understood by customers and our internal product engineering organisation. Oftentimes, the analyst serves as a daily point of contact for clients, so to provide good mentorship is vital for achieving client success.\n\nYour Role And Responsibilities\n\nAs a Business Analyst Specialist, your focus will be eliciting, capturing and management of requirements across the system development lifecycle. Besides working closely with your colleagues in Bangalore, you will also work closely with Nasdaq teams in other countries.\n\nProvides mentorship to new clients and existing customers in the preparation of the requirement documents to ensure that the characteristics of the functionality is well defined, clear and understood by customers.\n\nArticulate the “What” and the “Why” into requirements e.g. user stories and acceptance criteria that can be understood by our engineering team\n\nProvide support across testing to ensure deliverables meet the functional and non-functional requirements.\n\nWork closely with other teams to ensure the successful delivery of projects and make strategic decisions.\n\nChip in to the development and delivery of training programs, new tools, and techniques.\n\nWe expect you to have:\n\nAt least 7 years’ experience in a Business Analyst role.\n\nExtensive experience in the Capital Market / Trading domain including but not limited to securities trading, clearing & settlement, market surveillance, risk management, compliance & reporting, custody etc.\n\nExperience in conducting requirements elicitation workshops, business analysis using requirements modeling techniques and requirements management.\n\nStrong customer facing / engagement skills, Ability to own the clients and internal collaborator expectations.\n\nWrites and produces detailed functional specifications for the system implementation team.\n\nAssists team in thinking of process re-design and improvements which would improve efficiency and result in exceeding KPI’s every time.\n\nIdentifies industry change and captures feedback from our clients that provides input into Product Development initiatives internally.\n\nProvides input into project schedule, risks, scope of work and budget.\n\nA highly collaborative working style, good analytical and problem-solving skills.\n\nExperience working on a product and / or on the vendor side.\n\nEducation Qualification: A degree in Finance, Computer Science, Information Systems or other relevant subject area, or equivalent work experience\n\n\nIt would be great if you have\n\n\nWorking towards a professional certification like CFA, FRM; an industry recognized Business Analyst certification like ECBA,CBAP, CCBA.\n\nExperience of Agile delivery methodology and tools\n\nDoes it sound like you?\n\nAs the selection process is ongoing, please submit your application in English as soon as possible. We will get back to you in 2-3 weeks.\n\nCome as you are\n\nNasdaq is an equal opportunity employer. We positively encourage applications from suitably qualified and eligible candidates regardless of age, color, disability, national origin, ancestry, race, religion, gender, sexual orientation, gender identity and/or expression, veteran status, genetic information or any other status protected by applicable law.\n\nNasdaq is a leading global provider of trading, clearing, exchange technology, listing, information, and public company services. As the creator of the world's first electronic stock market, its technology powers more than 100 marketplaces in 50 countries. Nasdaq is home to over 4,000 total listings with a market value of approximately $12 trillion.\n\nTo learn more, about our business visit business.nasdaq.com. Check out more about our Life at Nasdaq.\n\nCome as You Are\n\nNasdaq is an equal opportunity employer. We positively encourage applications from suitably qualified and eligible candidates regardless of age, color, disability, national origin, ancestry, race, religion, gender, sexual orientation, gender identity and/or expression, veteran status, genetic information, or any other status protected by applicable law.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request an accommodation.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-specialist-fintech-at-nasdaq-4117253460?position=3&pageNum=52&refId=45I0DUvCFXw1ux4xI%2B7zbg%3D%3D&trackingId=9VHyDCQbNOdhIq9cm4kKDA%3D%3D"
}