{
    "job_id": "4117048478",
    "title": "EbizON|| Business Analyst || Noida",
    "company": "EbizON",
    "location": "Gautam Buddha Nagar, Uttar Pradesh, India",
    "description": "EbizON is looking for a Senior Business Analyst to join our team in Noida office.\n\nThe ideal person for this position has an eye for detail, with the ability to analyze, understand and coordinate and manage multiple projects.\n\nResponsibilities\n\n\nUnderstand business requirements and explain to internal stakeholders\nProject Planning and monitoring\nBudgeting and forecasting\nVariance analysis\nProject Reporting\nCo-ordinate in UAT sign-off\nFacilitate implementation\n\n\nRequirements\n\n\n2 Years of relevant experience as a Business Analyst.\nRequirements analysis and documentation\nCandidates with relevant IT experience will only be considered\nMinimum qualification - B.Tech/MCA\nGood Communication Skills\n\n\nNice to Have\n\n\neCommerce domain experience will have an added advantage.\nPreferred - MBA\n\n\nAbout Us:\n\nWere an international team who specialize in building technology products & then helping brands grow with multi-channel demand generation marketing. We have in-house experience working for Fortune companies, e-commerce brands, technology SaaS companies.\n\nWe have assisted over a dozen billion dollar companies with consulting, technology, operations, and digital agency capabilities in managing their unique brand online.\n\nWe have a fun and friendly work culture that also encourages employees personally and professionally.\n\nEbizON has many values that are important to our success as a company: integrity, creativity, innovation, mindfulness and teamwork. We thrive on the idea of making life better for people by providing them with peace of mind.\n\nThe people here love what they do because everyone from management all the way down understands how much it means living up close-to someone's ideals which allows every day to feel less stressful knowing each person has somebody cheering him.\n\nEqual Opportunity Employer\n\nEbizON is committed to providing equal opportunity for all employees, and we will consider any qualified applicant without regard to race or other prohibited characteristics.\n\nFlexible Timings\n\nFlexible working hours are the new normal.\n\nWe at EbizON believe in giving employees the freedom to choose when to work and how to work. It helps them thrive and also balance their life better.\n\nGlobal Clients Exposure\n\nOur goal is to provide excellent customer service and we want our employees to work closely with clients from around the world. That's why you'll find us working closely with clients through Microsoft Teams, Zoom, and other video conferencing tools.\n\nRetreats & Celebrations\n\nWith annual retreats, quarterly town halls, and festive celebrations, we have a lot of opportunities to get together.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/ebizon-business-analyst-noida-at-ebizon-4117048478?position=1&pageNum=95&refId=oHWbHPyc2vtOBB1ZeF%2F1RA%3D%3D&trackingId=t21HlLhkcV%2F9XHypSRyayg%3D%3D"
}