{
    "job_id": "4117223284",
    "title": "Business Analytics Senior Analyst [T500-15707]",
    "company": "Evernorth Health Services",
    "location": "Hyderabad, Telangana, India",
    "description": "About Evernorth\n\nEvernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people.\n\n\n\n\nPosition Overview:\n\nThe D&A Strategy Execution's Digital Product Analytics team is seeking an Analyst with proficiency in data analysis, business intelligence, and digital analytics. The successful candidate will leverage data to create data models and perform analysis to uncover digital customer/client value potential. Key responsibilities include providing strategic digital, business, and marketing recommendations; advising on the strategic use of customer and client data; promoting data analytics awareness across the client base and enterprise; and ensuring efficient system implementation and integration. The role requires a blend of technical ability, strategic thinking, and a deep understanding of digital analysis.\n\n\n\n\nThis role on our Digital Product Analytics team is an exceptional opportunity to deepen your understanding of digital data and product strategy integration. The role offers a stepping stone towards future leadership roles within the digital and analytics landscape through learning to integrate data analysis into product strategy.\n\n\n\n\nResponsibilities:\n\nIndependently develop and implement data analytics decision tools and business case models in collaboration with the Digital Website and Apps Analytics team\nFormulate hypotheses, plan tests, and execute A/B testing on product performance, utilizing a strong understanding of experimental approaches in product launch strategies. Follow up with go-live value measurements to assess strategy effectiveness\nGenerate insightful reports and monitor the product performance to identify customer behaviors and trends, providing a deeper understanding of user engagement\nApply structured problem-solving frameworks to identify key growth and profitability drivers of a regional insurance portfolio, and to highlight business issues or opportunities\nTranslate statistical conclusions into business solutions and facilitate successful implementation in a cross-functional and decentralized global business environment\nProactively provide innovative, customer-focused recommendations to all sales and distribution channels to maintain existing Business Partner relationships and secure business opportunities in an agile environment\nSupport the Digital Product team as required, providing analytics expertise where needed\nDevelop scalable standard practices for digital analytics and insight generation, ensuring consistency and efficiency across the business\nCollaborate effectively with team members situated across different geographies, fostering a unified and productive working environment\n\n\n\n\nQualifications:\n\nRequired Skills:\n\nStrong written and verbal communication skills with the ability to interact with all levels of the organization.\nA high level of skill using SQL and ETL to wrangle and transform data\nExperience with data visualization (Tableau preferred) to create dashboards\nDemonstrated strong communication and presentation skills that produce high quality results\nAbility to produce actionable insights through collaboration in a matrix team environment\nUnderstanding of health care industry is a plus\n\n\n\n\nRequired Experience & Education:\n\n3-5 total years of experience of strong relevant analytics experience in two or more of the following disciplines – digital analytics, digital product management, data visualization, hypothesis testing, and insight generation\nCollege degree (Bachelor) in related technical areas or equivalent work experience.\n\n\n\n\nDesired Experience:\n\nExposure to digital data feeds like Adobe CJA or Google clickstream data\nExperience with Python\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analytics-senior-analyst-t500-15707-at-evernorth-health-services-4117223284?position=1&pageNum=97&refId=HcfnYd3BMGIT%2FuoEZTo%2FBg%3D%3D&trackingId=YOHC8KTQhS%2FX4Gh4YD9wtQ%3D%3D"
}