{
    "job_id": "4118963878",
    "title": "Engagement Business Analyst",
    "company": "Precision Medicine Group",
    "location": "India",
    "description": "Position Summary\n\nResponsible for exceeding client expectations by supporting the development and deployment of our Market Access products with biopharmaceutical clients. The Engagement Business Analyst is a lead analyst on client ISI, Terms & Conditions projects and a member of a cross functional team responsible for supporting the day-to-day activities of the Engagement team. The role requires exceptional attention to detail, independent, and collaborative work, as well as the ability to manage multiple project priorities and tasks. Business Analysts contribute to process improvement and to our positive, inclusive, engaged team culture.\n\nEssential functions of the job include but are not limited to:\n\n\nBuild market access business acumen and software development knowledge\nResponsible for multiple projects across clients\nResponsible for client ISI and Term & Condition projects end to end\nCoordinates and collaborates with Engagement, Delivery Enablement, Product Delivery, and Application Development teams to manage delivery timing and product quality\nCreates Design requests and ensure client requirements are achieved\nResponsible for Medical, Legal, Regulatory (MLR) submission preparation, verification and client submission\nCreates requirements for data and application development and monitors development progress\nDevelop and maintain project plans using project management software\nVerifies final deliverable prior to client deployment\nIdentify inefficiencies and opportunities for process improvements\nMay assist with other client project work as directed by Engagement Lead or Manager which may include but not limited to projects requirements writing and application/message testing\nTravel expectations less than 5%\n\n\nQualifications\n\n\nBachelor’s degree\n3-5 years of experience in Pharmaceuticals, Managed Markets Consulting or Analytics Consulting\n\n\nPreferred\n\n\nDegree and/or experience in Health Care, or Business\nProject Management experience\nExpertise in Medical, Regulatory, Legal (MRL) review systems and approval processes\nWorking knowledge of pharmaceutical marketplace, brands, and data inputs\nWorking knowledge of relational database technology\nExperience with software development processes\n\n\nSkills\n\n\nExceptional attention to detail\nAdvanced knowledge of MS Office Suite\nExcellent organizational and problem-solving skills\nExcellent oral and written communication skills\nExcellent time management skills\nAbility to work independently and collaboratively\n\n\nAny data provided as a part of this application will be stored in accordance with our Privacy Policy. For CA applicants, please also refer to our CA Privacy Notice.\n\nPrecision Medicine Group is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, age, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law. © 2020 Precision Medicine Group, LLC\n\nIf you are an individual with a disability and require a reasonable accommodation to complete any part of the application process or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact Precision Medicine Group at QuestionForHR@precisionmedicinegrp.com.\n\nIt has come to our attention that some individuals or organizations are reaching out to job seekers and posing as potential employers presenting enticing employment offers. We want to emphasize that these offers are not associated with our company and may be fraudulent in nature. Please note that our organization will not extend a job offer without prior communication with our recruiting team, hiring managers and a formal interview process.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/engagement-business-analyst-at-precision-medicine-group-4118963878?position=8&pageNum=32&refId=VFsnRMMnT7hGO1gnBq9n6A%3D%3D&trackingId=5axihOvZLqBVPXt%2BFsd5sQ%3D%3D"
}