{
    "job_id": "4118170220",
    "title": "Business Analyst",
    "company": "A1advisor",
    "location": "Bengaluru, Karnataka, India",
    "description": "Role & Responsibilities\n\n\nRequirement Gathering: Collaborate with stakeholders, and customers to translate business requirements, develop functional designs and work closely with the Development and Support team to implement.\nStakeholder Management: Act as a liaison between business teams, IT, and other stakeholders to ensure seamless communication and alignment of goals.\nProcess Analysis: Analyze existing workflows and business processes, identifying inefficiencies and recommending optimized solutions.\nSolution Development: Work with cross-functional teams to propose, document, and validate technical or process-based solutions that align with business objectives.\nData Analysis: Collect, analyze, and interpret data to support business decisions and provide actionable insights.\nDocumentation: Create detailed business requirements documents (BRDs), user stories, process flows, and use case diagrams.\nTesting & Validation: Writing test cases, overseeing UAT (User Acceptance Testing), and ensuring deliverables meet requirements.\nChange Management: Support teams in implementing and adopting new solutions by providing training, documentation, and ongoing guidance.\nMarket Research: Stay updated with industry trends and best practices to inform strategic recommendations.\nProject Support: Assist project managers in planning, tracking, and delivering project milestones.\nSecure approval & change management activities with product owners or project managers before release.\nDevelop user guides and conduct training to end users.\n\n\nIdeal Candidate\n\n\nExperience: 3–5+ years as a Business Analyst or related role in a similar environment.\nExperience in working in ERP domains (Sales, Service, Inventory Management, Procurement, etc.) or in the Automotive domain is a must.\nCommunication: Strong verbal and written communication skills with the ability to translate complex ideas for technical and non-technical audiences.\nTools & Methodologies: Proficiency in tools like Azure board, Visio, or similar, and familiarity with Agile and Waterfall project methodologies.\nAnalytical Skills: Exceptional analytical thinking, problem-solving skills, and attention to detail.\nData Proficiency: Experience with data analysis tools (Excel, SQL, Power BI, Tableau) to generate reports and insights.\nDocumentation: Demonstrated expertise in creating clear and concise BRDs, functional specifications, and other project artifacts.\nCollaboration: Proven ability to work in cross-functional teams and influence without direct authority.\nExperience with hands-on salesforce.com is desired\n\n\nPerks, Benefits and Work Culture\n\n\nOpportunity to lead impactful projects and influence product strategy.\nCollaborative and inclusive work environment that values creativity and innovation.\nProfessional growth through training, mentorship, and challenging projects.\n\n\nSkills: communication,erp domains,sql,project support,requirement gathering,data proficiency,solution development,power bi,testing & validation,collaboration,process analysis,data analysis,erp systems,documentation,stakeholder management,tableau,tools & methodologies,change management,market research,business analysis,analytical skills\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-a1advisor-4118170220?position=9&pageNum=40&refId=EgsHbWy8%2FUnqSRbzGFEs%2Fw%3D%3D&trackingId=vu8kGxJi2nE%2BmX1%2FriQvpQ%3D%3D"
}