{
    "job_id": "4119066692",
    "title": "Agrim - Business Analyst - SQL/Python",
    "company": "AGRIM",
    "location": "Gurugram, Haryana, India",
    "description": "Our Vision\n\nIn India, there are 140M+ farmers who are served by 1M+ agri-input retailers for all their agri-input needs.\n\nThese retailers are the backbone of the overall value chain and primarily rely on :\n\n\nDeep understanding of local consumption patterns\nStrong relationships with farmers\nOffering of short-term credit\nOverall cost-effectiveness\n\n\nHowever, there are key challenges for retailers that limit their business growth :\n\n\nLimited product selection via traditional distributors\nInefficient sourcing\nWorking capital pressure\n\n\nWe, at Agrim, are re-imagining this $50bn market. We want to transform the traditional supply chain and infuse it with technology, modern retail best practices & data science for credit underwriting.\n\nRoles And Responsibilities\n\n\nSolve Challenging and Muddy problems leveraging the Fundamentals of Analytics and Business Intelligence.\nYou need to have hunger to bring change in the organisation leveraging the power of Data\nExperience building and designing complex dashboards\nDevelop Reports for Business to influence Key Business KPIs\nWork with Business Stakeholders and Design the Solutions\n\n\nRequirements\n\n\nStrong analytical and quantitative skills with the ability to use data and metrics to justify requirements\n1-2 years of experience working as a Business Analyst or a similar role involving data extraction, analysis, and Problem Solving\nProficiency in Building Dashboards enabling Business Impact\nYou never hesitate to roll up your sleeves and tackle something hands-on, you persevere when others fall away\nA keen learner and willing to adapt to new environments\nCan lead, work independently as well as play a key role in a team\nHands-on experience with Expert Level SQL and Python\nUnderstanding of Production Level Coding\n\n\n(ref:hirist.tech)\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/agrim-business-analyst-sql-python-at-agrim-4119066692?position=8&pageNum=72&refId=Mz5LEAf7jSU4t3WBJ4sgJQ%3D%3D&trackingId=gHeVkxUFIi0So8YjxZlVVg%3D%3D"
}