{
    "job_id": "4120422483",
    "title": "Business Analyst",
    "company": "Arohana Tech Solutions Private Limited",
    "location": "Mumbai Metropolitan Region",
    "description": "Business analysis and functional domain knowledge on payments system, reporting system, API gateway etc.\n\nFunctional knowledge of retail payment system domain\n\nRequirement gathering, creating user stories, use cases, scenarios\n\nCollaborate with development and participate in the development cadences\n\nAssist the development team and provide business analysis support.\n\nAdapt in writing test cases and execution of the test cases using test tools like postman, SOAPUI etc.\n\nCollaborate with testing team and ensure testing scope is covered\n\nBusiness analysis and functional domain knowledge having worked in domain related retail payments domain like UPI, IMPS, NEFT & RTGS or reporting systems with hands on knowledge for tools like PowerBI etc.\n\nRequirement gathering, creating user stories, use cases, scenarios\n\nElaboration of requirements, writing detailed functional specifications\n\nCollaborate with development and ensure development scope is covered\n\nAdapt in writing test cases and execution of the test cases using test tools like postman, SOAPUI etc.\n\nAssist the development team and provide business analysis support.\n\nCollaborate with testing team and ensure testing scope is covered\n\nCreate operational and user manuals\n\nUnderstanding of Banking Application functionalities - Payments system, Core Banking etc.\n\nUnderstanding of banking regulations\n\nWork on Internal documentation and compliance for new system implementation along with related audit etc.\n\nBusiness analysis and functional domain expert having worked in the retail payments domain like UPI, IMPS, NEFT & RTGS\n\nUnderstanding on documentation of API specification, API validation, support integration\n\nRequirement gathering, creating user stories, use cases, scenarios\n\nElaboration of requirements, writing detailed functional specifications\n\nCollaborate with development and ensure development scope is covered\n\nAssist the development team and provide business analysis support.\n\nCollaborate with testing team and ensure testing scope is covered including ability to write the test cases, scenarios etc. for test execution.\n\nCo-ordinate with automation teams for test cases automation after understanding the interfacing scenarios, unit testing etc.\n\nCreate operational and user manuals\n\nUnderstanding of Banking Application functionalities - Payments system, Core Banking etc.\n\nUnderstanding of banking regulations\n\nWork on Internal documentation and compliance for new system implementation along with related audit etc.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-arohana-tech-solutions-private-limited-4120422483?position=5&pageNum=87&refId=KM8cdGPQyPT7yvIRKZCULw%3D%3D&trackingId=wf75rbm9%2FsISZLYiCsM%2FyA%3D%3D"
}