{
    "job_id": "4122777062",
    "title": "Business Analysis Manager",
    "company": "Best Infosystems Ltd.",
    "location": "Noida, Uttar Pradesh, India",
    "description": "Business Analysis Manager (CRM Subject matter expert)_Full-Time_Noida_Work from office\n\n\n\n\nPosition: Business Analysis Manager (CRM Subject matter expert)\n\nJob Type: Full-Time\n\nLocation: Noida\n\nExperience: 9-14 Years, Relevant should be 6 years in BA\n\n\n\n\nJob Description:\n\n\n\n\nJob Overview:\n\nWho you will work with:\n\nThe Business Analysis Manager will join a dynamic programme team, reporting into the Business Analysis Executive Manager, and working closely with IT and end-users to ensure the systems meet organisational needs.\nThe role involves international collaboration, reflecting the firm's global reach and commitment to excellence.\nThe team has been recognised for its innovative approach to client management, and the Business Analyst will interact with various stakeholders, ensuring alignment and communication throughout the project lifecycle.\n\n\n\n\nRoles and Responsibilities:\n\n\n\n\nRequirements Gathering and Analysis: Collect and analyse business requirements from stakeholders to ensure the CGP systems align with organisational goals. This involves understanding current processes and identifying areas for improvement.\nData Analysis: Create end to end lifecycles and data flows for all the key entities of CGP systems(CRM , Marketing Events and Campaigns etc.) and liaise with business and IT stakeholders to document the Data Migration and Data Integration strategies\nProcess Evaluation and Improvement: Evaluate existing business processes to identify inefficiencies and areas for enhancement. Recommend changes to ensure the CGP systems support streamlined and effective workflows.\nStakeholder Communication: Facilitate communication between stakeholders, including management, IT, and end-users, to ensure all parties are aligned on the CGP systems implementation objectives and progress.\nSystem Configuration and Customisation: Work with technical teams to ensure the CGP systems are configured and customised to meet business requirements. This includes defining workflows, user roles, and access permissions.\nChange Management: Assist in managing organisational change by preparing stakeholders for the transition to the new CGP systems. Develop strategies to address resistance and ensure smooth adoption.\nUser Documentation and Training: Develop comprehensive user documentation and training materials to support the effective use of the CGP systems. Conduct training sessions to ensure users are proficient in utilising the system.\nTesting and Quality Assurance: Participate in system testing to ensure the CGP systems meet business requirements and function as expected. Identify and resolve any issues before full deployment.\nPost-Implementation Monitoring and Support: Monitor the CGP systems post-implementation to ensure they continue to meet business needs. Gather feedback from users to identify areas for further improvement and provide ongoing support.\n\n\n\n\nRequirements:\n\n\n\n\nThis should be high level and include a clear indicate of what experience may be relevant but should avoid demanding academic qualifications that are not necessary for the role.\n\n\n\n\nAn overall experience of around 9 years with a minimum of 7 years in Business Analyst role\nProven experience of requirements gathering tools / techniques including user Stories, Use Cases, Process Modelling and workshops / interviews.\nProven experience in business analysis tasks on large scale CRM implementations in professional services organisations\nData analysis skills (data flow diagrams, data modelling, data migration and integration strategies)\nHighly organised, with ability to assess changing priorities at pace.\nCreative and flexible approach to problem solving.\nStrong facilitation, negotiation and mediation skills.\nExcellent communication skills in order to engage, lead and influence stakeholders at all levels of the business.\nCultural sensitivity and awareness in dealing with global customers and suppliers.\nHighly motivated with strong attention to detail\nPrevious experience of working on complex global IT change projects.\nTeam building and team dynamics, across different project streams\nExperience working End to End Project Lifecycle and Testing phases.\nBCS Business Analysis or other recognised business analysis qualification.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analysis-manager-at-best-infosystems-ltd-4122777062?position=3&pageNum=5&refId=lj%2BaylP9Zxb0xcLPbmF98Q%3D%3D&trackingId=1QZUka69oIb%2F0bkaR2s5hA%3D%3D"
}