{
    "job_id": "4122079624",
    "title": "Business Analyst Manager - Global Logistics",
    "company": "Nestlé",
    "location": "Bengaluru, Karnataka, India",
    "description": "Join Our Team as an Information Technology-Business Analyst Manager!\n\nPosition Snapshot\n\nAre you a dynamic leader with a passion for technology and business analysis? Do you thrive in a fast-paced and innovative environment? If, yes, we have the perfect opportunity for you!\n\nPosition: IT Business Analyst Manager – Supply Chain, Global Logistic\n\nLocation: India IT HUB, Bangalore\n\nCompany: Nestlé\n\nDepartment: IT, Supply Chain\n\nType: Permanent position\n\nOther: Full-time work, virtual team working available in a global environment\n\nAbout the Role:\n\nAs an IT Business Analyst Manager, you will be the bridge between IT and business, ensuring a deep understanding of business needs and translating them into IT solutions. You will lead a team of talented Business Analysts, driving innovation, digital transformation and efficiency through technology.\n\nKey Responsibilities:\n\n\nStrategic Leadership: Support the development of technology strategies and roadmaps, ensuring alignment with business goals.\nOperational Excellence: Analyse, document and test program development, process flows, and specifications.\nTeam Coaching: Motivate and direct virtual teams to find the best solutions that align with business objectives and IT strategy.\nStakeholder Engagement: Partner with business, MFRM and IT Product Teams to translate business requirements into IT solutions.\nSecurity & Compliance: Ensure security and compliance requirements are considered and embedded in solution design.\nVendor Management: Manage vendors service deliveries meet Business requirements and expectations.\n\n\nWhat We Offer:\n\n\nInnovative Environment: Be part of a team that values creativity and entrepreneurial mindset.\nProfessional Growth: Opportunities for continuous learning and career development.\nCollaborative Culture: Work with diverse teams across the globe.\nImpactful Work: Contribute to projects that drive business value through technology.\n\n\nA Day in the Life of ‘IT Business Analyst Manager – Supply Chain, Global Logistic’\n\nYou will have an immediate impact on the day one working in the largest Food & Beverage company in the world bringing efficiency to our Business Partners (Markets) and an ongoing impact on contribution to our overall growth.\n\nYou will collaborate with Nestle Businesses (Markets Business Partners), IT communities, Stakeholders and Vendor Partners:\n\n\nto enlighten our Receivers at Brilliant at Basic (RUN-IT supports)\nto embrace new Operating Model and way of working\nto motivate team to implement and scale/rollout strategic Big Bets Portfolio, Must Win Battles, prioritized and aligned Business/IT Joint Technology Roadmap (JTR) to contribute to E2E Business Value Chain benefits and jointly drive Digitalization Transformation to improve efficiency and productivity\nto participate in Joint Technology Roadmap (JTR) planning & design sessions; work with MFRM (Market Function Relationship Manager), Business Partners, Solution Architects, Product Teams and/or Vendors as needed.\nto be a custodian for the relevant function standards, guidelines, Standard Operation Procedures (SOP) and compliance requirements\nSenior Stakeholders management\nLine and people management\nVendor management - build good relationships with external vendors to effectively meet business needs\nto ensure E2E integration components meet and follow proper design, performance and capacity standards (include 3rd Party Warehouse connects)\n\n\nBenefit\n\n\nAn attractive and dynamic international working environment with the most talented and engaged IT professionals in their field and working with best-in class technologies.\nBe yourself @Nestlé! Our values are rooted in respect, we champion diversity and inclusion and believe on the power of diversity to build winning teams where everyone can be the best version of themselves.\nPersonal and professional growth through ongoing training and constant career opportunities reflecting our conviction that people are our most important asset.\nGreat benefits including competitive salary and a comprehensive social benefits package.\nHybrid working environment with flexible working scheme, allowing everyone to meet their needs enjoying the advantages of remote work and combining with the amazing Nestlé facilities and culture.\n\n\nWhat will make you successful?\n\n\nBachelor's degree in business, information systems, or related discipline; M.B.A. preferred.\n10+ years of relevant experience in business analysis and with project management experience.\nStrong experience in Agile/DevOps environments and design thinking methodology.\nExcellent communication skills, stakeholder management, manage virtual teams experience and ability to work in a global environment.\nStrong in Business relation partnership experience and vendor management skills.\n\n\nJoin us and make a difference! Apply now to become a part of our innovative team.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-manager-global-logistics-at-nestl%C3%A9-4122079624?position=3&pageNum=40&refId=EgsHbWy8%2FUnqSRbzGFEs%2Fw%3D%3D&trackingId=ZJbQEa4L5qd%2BsuU9FLy2lg%3D%3D"
}