{
    "job_id": "4123651530",
    "title": "Product Business Analyst",
    "company": "dentsu",
    "location": "Greater Bengaluru Area",
    "description": "Job Description:\n\nJob Responsibilities:\n\n\nAnalysis and Requirements Definition. Employs a range of tools and techniques to gather business and user requirements against the clear objectives articulated for the project. Determines the need and value of performing the activity based on the context. If required, employs a range of tools and techniques to map 'As-Is' and To-Be' business processes/capabilities.\nImpact Analysis and Estimation. Identifies potential consequences of a change and estimates what needs to be modified to accomplish that change and focuses on defining changes within the scope of the overall project design, to the requisite quality with appropriate level of effort required depending on change defining.\nBusiness Solution Design and Development. Engages with requisite stakeholders to ensure business systems, workflows and processes contribute to target operating model/capability. Ensures that activities within project are mapped to ensure that they are delivered effectively and work in partnership with domain experts e.g. Enterprise Architects, Systems Analysts, where applicable, to translate business needs into solutions, work with technical leads to ensure business needs are translated into the technical solutions.\nBenefits Evaluation. Evaluates strengths and weaknesses of identified benefits and dis-benefits in line with project mandate.\nStakeholder Engagement. Engages with business owners, business change managers, users, and other identified key stakeholders, as required, to ensure alignment of project requirements and solution/capability design.\nBusiness Change. Works closely with Business Change Managers and improvement teams with identification of BAU enhancements and associated solutions to ensure that defined project outputs are delivered, and benefits realized.\nFrameworks, Tools and Documentation. Provides advice and guidance to the project team on application of methodologies; operating model; functional specification; user cases; user stories; defect analysis; forms and templates appropriate for organizational context and project.\nJob Requirements:\n\n\n\nMust Have:\n\n\nMinimum 3 to 5 years of experience\nCollaborate closely with the product owners to elaborate user stories, features, etc.\nClose collaboration with developers to make use the vision and each user story is understood clearly.\nHelp with user experience design, wire frames that can be used by developers to build frontend.\nHelp with feature acceptance testing.\nStrong communication\nGood to have:\nKnowledge of design tools such as Figma\n\n\n\nLocation:\n\nDGS India - Bengaluru - Manyata N1 Block\n\nBrand:\n\nMerkle\n\nTime Type:\n\nFull time\n\nContract Type:\n\nPermanent\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/product-business-analyst-at-dentsu-4123651530?position=5&pageNum=15&refId=rYf7Kk8Eb63jO7gIoGSEug%3D%3D&trackingId=Y3e9Ra6QAItQTE4UtPgATg%3D%3D"
}