{
    "job_id": "4124124606",
    "title": "Business Presentation Analyst",
    "company": "Everise",
    "location": "Greater Bengaluru Area",
    "description": "EverAI Labs, a group company of Everise Inc., is an upcoming startup in the customer service industry, dedicated to enhancing operational efficiency and workforce development through innovative automation solutions. We are developing a comprehensive set of platforms that focuses on using the latest technology to enable our clients to deliver better and faster customer experience.\n\n\n\n\nThe Business Presentation Analyst is a key role responsible for developing compelling corporate presentations, supported by detailed data analysis and insights. This individual collaborates with cross-functional teams to communicate complex business information effectively, leveraging data visualization tools and storytelling techniques to influence decision-making at all levels of the organization.\n\n\n\n\nResponsibilities\n\n\n\n\nCorporate Presentation Development\n\nCreate professional, visually appealing corporate presentations for stakeholders, including executives, clients, and investors.\nTranslate complex business concepts and data into clear, concise, and impactful visuals.\nEnsure presentations align with corporate branding guidelines and communication standards.\nGather, analyze, and interpret data to support presentation content.\n\nStorytelling and Communication\n\nCraft compelling narratives that effectively communicate key business messages and strategies.\nCollaborate with teams to understand objectives, challenges, and messaging goals for each presentation.\nPresent complex information in a manner suitable for diverse audiences.\n\nCollaboration and Coordination\n\nWork closely with leadership, marketing, sales, and strategy teams to develop presentations for strategic initiatives.\nManage multiple projects with competing deadlines while maintaining high-quality deliverables.\nStay updated on the latest tools and trends in data visualization and presentation software.\nRecommend and implement innovative methods to improve presentation impact and engagement.\nBuild and maintain templates, toolkits, and style guides to streamline the presentation creation process.\n\n\n\n\nAttitude & Attributes:\n\nStrategic mindset: Ability to think critically and align insights with business goals.\nCollaborative approach: Effectively engage with cross-functional teams and stakeholders at all levels.\nDetail-oriented: Consistent attention to precision in data analysis, presentation design, and narrative flow.\nAdaptability: Thrives in dynamic environments, managing multiple priorities with efficiency.\n\n\n\n\nKnowledge:\n\n10+ years of experience in business analysis, presentation design, or a similar role.\nProven expertise in creating executive-level presentations.\nExceptional presentation design skills, including: Mastery of PowerPoint, Google Slides, and advanced presentation tools (e.g., Canva, Prezi, or Figma).\nProficiency in creating data-driven visuals and dashboards using tools like Tableau, Power BI, and Excel.\nStrong storytelling skills to structure presentations with a clear narrative flow and impactful messaging.\nKnowledge of design principles (color theory, typography, layout) to create professional and aesthetically appealing slides.\nExperience using infographics, charts, and data visualization to highlight key insights.\nExcellent communication skills, both verbal and written.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-presentation-analyst-at-everise-4124124606?position=1&pageNum=25&refId=kluirdiBIoCee5yDSaO06g%3D%3D&trackingId=lpWD0sjdwM1Y%2BoeqSGQ3nA%3D%3D"
}