{
    "job_id": "4125696804",
    "title": "Senior Staff Business Analyst",
    "company": "Intuit",
    "location": "Bengaluru, Karnataka, India",
    "description": "Your insight into customer needs combined with a natural curiosity, learning mindset and business acumen will be required to ensure that we build features and functionality that solve big problems in Enterprise Planning, Prioritization and Digital Transformation space with specific focus on Portfolio Management, Work Management, Advanced Analytics and AI led Automation solutions to drive significant customer and employee delight. You will be part of the energized and committed T4I Product organization, partnering closely with the rest of the engineering team and cross functional business units.\n\n\n\n\nResponsibilties\n\n\n\n\nLead a cross functional effort to ideate and build the technology and ecosystem for enterprise planning and digital transformation and scale them across the enterprise\nDeeply understand the customers and the business processes with follow-me-home research, usability studies, rapid prototyping and experimentation\nPrioritize customer needs, define and execute on a product roadmap to push the boundaries on digital process automation\nLead in building a product and automation roadmap that meets near term objectives (1-2 years) and aligns with future state vision of the enterprise systems and technologies (3-5 years)\nDefine and analyze key performance metrics to support and inform product decisions\nContinuously evaluate product fit/gap, process optimization, ascertain technical dependencies and maturity, do external benchmarking and recommend options meeting the long term vision\nHow will you lead:Imagine a career where your creative inspiration can fuel BIG innovation. Year-over-year, Intuit has been recognized as a best employer and is consistently ranked on Fortune’s “100 Best Companies To Work For” and Fortune World’s “Most Admired Software Companies” lists. Immerse yourself in our award-winning culture while creating breakthrough solutions that simplify the lives of consumers and small businesses and their customers worldwide.\n\n\n\n\n\n\n\nQualification\n\n\n\n\n10+ years designing and delivering world-class software products in a Product Management role specifically in Source to Report domain\nKnowledge and/or experience in finance transformation & strategy like Source to Report & Record to Report and similar technologies is highly desirable\nExperience in Oracle Financials Applications or similar technology and core Finance Modules of General Ledger, Intercompany, Procure to Pay, Fixed Assets, Projects, Accounting, XLA, Cash Management\nUnderstanding of how integrations works between Oracle and other Third Party Applications.\nExperience with Procure to Pay applications such as Coupa and vendor risk management applications such as Aravo\nAbility to develop and execute a successful product roadmap, prioritize between features and architectural improvements and establish the operational rigor for building and improving the existing portfolio\nExperience building enterprise level products and process automations with a strong understanding of how API, connectors, and data flow together.\nProven ability to identify technology options and drive decision-making that balances business and technical requirements\nAbility to develop and execute a successful product roadmap\nMust be data and metrics driven with a “win together” mindset and track record of performance excellence, i.e. consistently delivering exceptional results, exceeding targets and objectives\nSkilled at cross functional collaboration; strong influencing and negotiating skills\nHigh energy, self-starter with a positive mindset and with a \"can do\" attitude\nUndergraduate degree in computer science, electrical engineering or a related technical discipline is required; MBA is desirable\nPartner with Finance, business and engineering leaders across Intuit to identify areas across people, process, and technology to dramatically improve velocity.\nExperience using data insights for ongoing product improvement\nExperience with technology solution proposals and business cases with options analysis will be an added advantage\nEffective and persuasive presentations (verbal and written) appropriate for project teams and business leaders, when communicating any of the above\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-staff-business-analyst-at-intuit-4125696804?position=9&pageNum=7&refId=l5e7KWmGHGwd1%2FdKVQ5rRw%3D%3D&trackingId=2PsgKQF1fxm68fAunHexKQ%3D%3D"
}