{
    "job_id": "4125942932",
    "title": "Business Analyst (Life Insurance)",
    "company": "Sapiens",
    "location": "Bengaluru East, Karnataka, India",
    "description": "Sapiens is on the lookout for a Business Analyst to become a key player in our Bangalore team. If you're a seasoned BA pro and ready to take your career to new heights with an established, globally successful company, this role could be the perfect fit.\n\nLocation: Bangalore\n\nWorking Model: Our flexible work arrangement combines both remote and in-office work, optimizing flexibility and productivity.\n\nThis position will be part of Sapiens’ L&P division, for more information about it, click here: https://sapiens.com/solutions/life-and-pension-software/\n\nWhat You’ll Do\n\nWork closely with customer to identify, analyse, validate and document business processes and functional requirements. Oversee proper implementation by providing functional specifications and acceptance criteria. Act as a liaison between the customer business users and the project development and testing team.\n\n\nUnderstand and document customer’s functional and technical requirements, user stories, and acceptance scenarios.\nSpecialize in Sapiens ALIS application; Understand limitations and possibilities of the system and their implications on the business processes and functionality.\nInitiate and oversee project solution design\nProvide presentations and demonstrations on Product Features\nFunctional support to development teams in design processes\nFunctional support to the testing teams by preparing test scenarios and participate in system testing before releases to the customers\nWrite new requirements / User Stories documents, for new functionalities (CRs, new features, etc.).\nAssist Sapiens RI 2nd and 3rd line support representatives in analysing and reproducing incidents reported by the customer.\nParticipate in training activities of employees and customers.\nSupport the TW with updating product documentation.\n\n\nMust Have Skills.\n\nWhat to Have for this position.\n\n\nEducation : BE and MBA - MUST\nExperience required is minimum 4+ years.\nExcellent analytical skills\nExperience with information systems (such as ERP) at a super user level\nExperience with Financial services / Systems. Excellent command of the insurance business (experience in the actuarial or insurance fields)– must, Reinsurance is advantage\nAbility to match between customer functional requirements and application system options/functionalities in an efficient way.\nInsurance business knowledge - an advantage\nExcellent communications skills English (mother tongue level) – must\nRepresentative\nWilling to travel extensively\nExperience with overseas customers.\nExcellent analytical skills\nExperience with core organizational product implementations\nAbility to match between customer functional requirements and application system options/functionalities in an efficient way.\nHaving experience in Insurance background and worked on insurance products are added advantage.\n\n\nAbout Sapiens\n\nSapiens is a global leader in the insurance industry, delivering its award-winning, cloud-based SaaS insurance platform to over 600 customers in more than 30 countries. Sapiens’ platform offers pre-integrated, low-code capabilities to accelerate customers’ digital transformation. With more than 40 years of industry expertise, Sapiens has a highly professional team of over 5,000 employees globally.\n\nFor More information visit us on www.sapiens.com .\n\nSapiens is an equal opportunity employer. We value diversity and strive to create an inclusive work environment that embraces individuals from diverse backgrounds.\n\nDisclaimer: Sapiens India does not authorise any third parties to release employment offers or conduct recruitment drives via a third party. Hence, beware of inauthentic and fraudulent job offers or recruitment drives from any individuals or websites purporting to represent Sapiens . Further, Sapiens does not charge any fee or other emoluments for any reason (including without limitation, visa fees) or seek compensation from educational institutions to participate in recruitment events. Accordingly, please check the authenticity of any such offers before acting on them and where acted upon, you do so at your own risk. Sapiens shall neither be responsible for honouring or making good the promises made by fraudulent third parties, nor for any monetary or any other loss incurred by the aggrieved individual or educational institution.\n\nIn the event that you come across any fraudulent activities in the name of Sapiens , please feel free report the incident at sapiens to sharedservices@sapiens.com .\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-life-insurance-at-sapiens-4125942932?position=5&pageNum=50&refId=%2FVyrdZh82hXsETPuNBCAVQ%3D%3D&trackingId=MFdw6x%2FyhqbMYx57giN%2FDA%3D%3D"
}