{
    "job_id": "4125979565",
    "title": "Business Analyst , Bangalore",
    "company": "Straumann Group",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Purpose\n\nAre you an experienced Software Business Analyst? Do you want to be part of a team that provides innovative solutions to dental professionals and patients around the world? If so, Straumann Group Software Centre in Madrid is the place for you!\n\nStraumann Group is a global leader in dental implants and orthodontic solutions, and we are looking for a talented front-end software developer to join our team. As part of a growing team of specialists, you will be part of a team of engineers developing software tools for dental professionals and patients, including dentists, surgeons, and dental technicians.\n\nAs a Software Business Analyst, you will define, modify and review functional and non-functional specifications/requirements, and will dig into the analysis tasks alongside development team and dental professionals stakeholders (e.g. dentists, surgeons, dental technicians) as well as consumers to provide fully detailed technical documentation. Part of the job will entail to manage a BPMN App, expertise within this domain will be highly appreciated.\n\nAs part of a growing team of specialists, working for a world market leader in dental technology, he will be responsible for managing SCRUM ceremonies (grooming, specifications, etc). You will be part of an agile team that values collaboration and creativity, and you will have the opportunity to work in an international environment for a product-based company.\n\nMain Tasks And Responsibilities\n\n\nAs a Software Business Analyst you will:\nDefine and review specifications and requirements, documentation.\nDocument, challenge and clarify PMs requirements\nInteract with medical professionals to better understand requirements and collect feedback on software products developed.\nEnsure alignment between business needs, UX designs and technical specs\nBPMN App modeling and functional work\nAssist the PM in acceptance tests\nTest product backlog items in integration env. and dev\nProtect team from outside interruptions and distractions\nFinds opportunities for collaboration across international teams, works on cross-team commitments, and achieves scale by enabling the work of others.\n\nRequirements\n\n\nBE/B.Tech with 8+ years of relevant expereince.\nExperience as a teamwork, and communication leader\nBPMN Experience (Flowable or similar tools)\nGood to have -Real world experience on SCRUM\nAnalysis of software requirements and definition of software tasks\nAlignment between business needs, UX designs and technical specs\nKnowledge of Azure DevOps\nExperience on Atlassian Confluence\nDesirable:\nDevelopment skills such as backend and front-end frameworks (Spring, TypeScript, React JS)\nExperience with healthcare software\nKnowledge in FHIR standards\nProfessional fluency in English\n\nPersonal Attributes\n\n\nKeen to create world class healthcare solutions with an international team\nThorough and attention to details\nInterest and ability to understand the full software stack.\nHappy to reuse work from others and able to make the difference where we need to set us apart.\nHumble when it concerns understanding the customer requirements. Bold when it comes to backing up his/her team and delivering the solutions needed by the market.\n\n\n16565\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-bangalore-at-straumann-group-4125979565?position=4&pageNum=87&refId=KM8cdGPQyPT7yvIRKZCULw%3D%3D&trackingId=IbczVsp%2BozLnhyuXaA2wSA%3D%3D"
}