{
    "job_id": "4126313483",
    "title": "Excellence Strategy and Operations Analyst, People Experience",
    "company": "Google",
    "location": "Gurgaon, Haryana, India",
    "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Bengaluru, Karnataka, India; Gurgaon, Haryana, India; Hyderabad, Telangana, India.Minimum qualifications:\n\n\nBachelor's degree or equivalent practical experience.\n6 years of experience developing business strategies or managing cross-functional initiatives.\nExperience in data analysis, metric development, and translating data into actionable recommendations.\n\n\nPreferred qualifications:\n\n\nMaster's degree in Business, Statistics, Computer Science, or a related field.\nExcellent project management and organizational skills.\nDemonstrated proficiency in data analysis tools (SQL), spreadsheet modeling, and database querying.\n\n\nAbout The Job\n\nIn this role, you will partner with People Experience (PX) teams to provide comprehensive data insights that optimize Google's operational efficiency and strategic decision-making. You'll bring a strategic blend of analytical expertise and stakeholder collaboration to ensure Google's operations and support functions are continuously improved through data-driven insights.\n\nResponsibilities\n\n\nModel complex data to create quantitative models (forecasting, operational, and statistical) for both PX capacity planning and Global Support initiatives. Analyze results to provide targeted recommendations to diverse teams.\nConsult with PX teams on metric selection and value realization methodology. Collaborate with Global Support teams to define impactful metrics that support performance goals.\nApply quantitative and qualitative methodologies to address complex operational challenges across PX. Drive cross-functional collaboration to implement insights and maximize impact.\nIdentify, develop, and maintain tools that streamline data analysis, reporting, and insight generation. Stay updated on Google's evolving data environment in collaboration with relevant engineering and data teams.\nBuild partnerships with PX leadership, Finance, and analytical teams. Communicate strategic recommendations derived from data insights.\n\n\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/excellence-strategy-and-operations-analyst-people-experience-at-google-4126313483?position=8&pageNum=17&refId=otcMTVij75x3rORf5Q9zLA%3D%3D&trackingId=nwot8FMLRaRI4YUmoqns%2Bg%3D%3D"
}