{
    "job_id": "4127772683",
    "title": "Business Analyst I, Amazon Last Mile and Analytics",
    "company": "Amazon",
    "location": "Hyderabad, Telangana, India",
    "description": "Description\n\nBusiness Analysts are responsible for converting data into actionable business insights. They are analysis experts who leverage a variety of data platforms and analytical tools to provide timely, meaningful, and consumable information. They build deep contextual and domain knowledge. They ensure data quality and build scalable tools. They communicate findings with the most effective and influential methods.\n\nAmazon LMAQ team is seeking an exemplary Business Analyst with broad technical skills to develop data visualizations and build automation solutions that drive business decision making and process improvement. The ideal candidate will draw upon advanced analytical, problem solving skills, and passion for delivering business insights and analytics. We look for candidates who are excellent communicators, self-motivated, flexible, hardworking, and who like to have fun.\n\nIt involves design and development of automated data pipelines, sophisticated analytical modeling and intuitive data visualization. This role will directly be responsible for maintaining front end code using Python, SQL, HTML, or other similar coding languages. Proficiency in the aforementioned languages is not required, but an ability to be a quick learner and gain proficiency is required for a successfully candidate. This role will have high level visibility due to the nature of the toolsets being maintained, built, and the network impact of analysis conducted. This role has great exposure to a broad scope that can really help shape the future of Last Mile and promotes career progression.\n\nKey job responsibilities\n\n\nProvide data management processes such as accessing raw data feeds, building queries and macros, writing VBA code, organizing data and designing reports that present status-at-a-glance visualization for business performance.\nRetrieving and analyzing large sets of data using Excel, SQL, and other data management systems.\nDesigning and implementing reporting solutions to enable stakeholders to manage the business and make effective decisions.\nTaking ownership of reporting processes to ensure that each report is accurate and timely with a high degree of customer focus in resolving data discrepancies.\nBuilding and managing related key performance indicators (KPIs) to measure, control, and benchmark reporting processes.\nMonitoring existent metrics, building new metrics, and partnering with internal teams to identify process and system improvement opportunities.\nSupporting cross-functional teams on the day-to-day execution of the existent program implementation.\nGenerating complex queries to dive deep on process issues\nInnovating to improve customer experience\n\n\nBasic Qualifications\n\n\n1+ years of Excel or Tableau (data manipulation, macros, charts and pivot tables) experience\n2+ years of complex Excel VBA macros writing experience\nBachelor's degree or equivalent\nExperience defining requirements and using data and metrics to draw business insights\nExperience with SQL or ETL\n\n\nPreferred Qualifications\n\n\nExperience with reporting and Data Visualization tools such as Quick Sight / Tableau / Power BI or other BI packages\nExperience using statistical tools such as Minitab\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI HYD 13 SEZ - H84\n\nJob ID: A2875392\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-i-amazon-last-mile-and-analytics-at-amazon-4127772683?position=2&pageNum=12&refId=0qwF5I591Ogz%2FBtLFZTetg%3D%3D&trackingId=4%2FnixPLGzSiIlhpgeFNIwg%3D%3D"
}