{
    "job_id": "4129908256",
    "title": "Business Analyst - Cloud FinOps",
    "company": "BeGig",
    "location": "Greater Kolkata Area",
    "description": "One of our clients(TechM) is looking to hire a Business Analyst - Cloud FinOps on a contract basis, please see the details below:.\n\nJob Role : - FinOps Analyst.\n\nJob Type : Contract.\n\nDuration : 6 months.\n\nWork Mode : Remote.\n\nNo of hours : 8-9 hours per day(1 QTY/ 12PM to 10PM).\n\nRole Summary\n\n\nThe FinOps Analyst will play a critical role in managing and optimizing cloud financial operations, ensuring cost efficiency, and providing financial insights to support strategic decision-making.\nThe ideal candidate will have strong analytical skills, a solid understanding of cloud financial management, and the ability to work collaboratively in a fast-paced environment.\n\n\nEssential Responsibilities\n\n\nDevelop reports and conduct detailed financial analysis of cloud spending, identifying trends and areas for cost optimization.\nImplement cost optimization strategies to reduce cloud spend by analyzing resource utilization, right-sizing instances, and eliminating waste- .\nWork with cloud architects and engineers to design cost-effective cloud solutions.\nIdentify and recommend cost-saving opportunities through reserved instances, savings plans, and other financial instruments.\nIdentify opportunities for automation within PMO processes and implement solutions to reduce manual effort and improve accuracy.\nDevelop and enforce financial policies and governance related to cloud usage and expenditures.\nCollaborate with cross-functional teams including finance, IT, engineering, and business units to align cloud capacity and financial planning.\nUtilize and manage FinOps tools and platforms to monitor cloud usage and spending.\n\n\nTechnical Expertise.\n\n\nBachelor's degree in Finance, Accounting, Business Administration, Computer Science, or a related field (or equivalent experience).\nMinimum of 1-3 years of experience in financial analysis, cloud financial management, or a similar role.\nStrong analytical skills with the ability to handle complex data sets and produce actionable insights.\nExperience with cloud platforms such as AWS, Azure, or Google Cloud, and familiarity with their cost management tools.\nExperience in financial modeling, budgeting, and forecasting.\nExperience with financial software and tools, such as Excel, Power BI, or Tableau.\nKnowledge of FinOps principles and practices.\nCertification in FinOps, cloud financial management, or related areas is a plus.\n\n\nBusiness Acumen\n\n\nExperience in the energy or utilities sector is a plus.\n\n\nPersonal Attributes.\n\n\nOutstanding communication and interpersonal abilities, with the skill to collaborate effectively with all organizational levels.\nForward-thinking innovator with a strategic approach and a passion for driving technological progress.\n\n\n(ref:hirist.tech)\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-cloud-finops-at-begig-4129908256?position=9&pageNum=75&refId=oawIpd1n3a%2BRa%2FbhSX9Nsw%3D%3D&trackingId=FjdF6zw5kMv696Kx5MZ08w%3D%3D"
}