{
    "job_id": "4129446903",
    "title": "Assistant Manager Business Analyst",
    "company": "OLX India",
    "location": "Gurugram, Haryana, India",
    "description": "At OLX, we work together to build a more sustainable world through trade.\n\n\n\n\nWe make it safe, smart, and convenient to buy and sell cars, find housing, get jobs, buy and sell household goods, and more.\n\n\n\n\nWe are seeking a highly motivated and detail-oriented Business Analyst to join our dynamic team. The ideal candidate will have a strong analytical mindset, excellent communication skills, and a passion for driving data-driven decision-making in the product development process.\n\nAs a Business Analyst, you will play a crucial role in gathering and analyzing data to provide insights that inform product strategy, enhance user experience, and contribute to the overall success of our products.\n\n\n\n\nWhat You’ll do :\n\n\n\n\nData Analysis and Interpretation:\n\n● Analyze large datasets to extract meaningful insights and trends related to user behavior, product performance, and market dynamics.\n\n● Develop and maintain key performance indicators (KPIs) to measure product success and user engagement.\n\n● Provide actionable recommendations based on data analysis to improve product features, functionality, and overall performance.\n\nUser Research:\n\n● Collaborate with cross-functional teams to conduct user surveys, interviews, and usability testing to gather qualitative data.\n\n● Translate user feedback and insights into actionable recommendations for product improvement and innovation.\n\nCompetitor Analysis:\n\n● Monitor and analyze competitor products and market trends to identify opportunities and threats.\n\n● Provide insights on best practices and innovative features in the industry to inform product strategy.\n\nReporting and Visualization:\n\n● Create and maintain dashboards and reports to communicate key metrics and insights to stakeholders.\n\n● Utilize data visualization tools to present complex information in a clear and understandable manner.\n\nProduct Lifecycle Support:\n\n● Work closely with product managers to support the entire product development lifecycle from ideation to launch and ongoing optimization.\n\n● Develop and execute A/B testing and other experiments to measure the impact of product changes.\n\n\n\n\nWho are we looking for?:\n\n\n\n\n● Bachelor’s degree in a related field (e.g., Business, Statistics, Computer Science) or equivalent work experience.\n\n● 4+ years experience in business analytics experience\n\n● B. Tech/ M. Tech from a premier institute (IIT/NIT/BITS )\n\n● Proven experience as a Business Analyst or in a similar role, with a track record of successfully influencing business decisions through data analysis.\n\n● Strong proficiency in data analysis tools and languages (e.g., SQL, Python, R) and experience with tools (e.g., GA, Clevertap & Tableau).\n\n● Excellent communication and presentation skills with the ability to convey complex data findings to both technical and non-technical stakeholders.\n\n● Detail-oriented with a strong analytical mindset and problem-solving skills.\n\n● Ability to thrive in a fast-paced, collaborative environment.\n\n\n\n\nWhat We'll give you:\n\n\n\n\nAn opportunity to shape a largely unorganised industry and help millions of car buyers and sellers transact with trust and efficiency.\n\nPassionate team and leadership colleagues who will share the dream and drive to deliver the most trusted, convenient and innovative car buying and selling experiences. Opportunities to speed up your learning and development across your role relevant areas.\n\nAt OLX, we are committed to creating a diverse, inclusive, and authentic workplace. We strongly encourage people of all races, ethnicities, disabilities, ages, gender identities or expressions, sexual orientations, religions, backgrounds, and experiences to apply.\n\nWe embrace diversity and welcome applicants from all backgrounds. If you are as excited as us about this position and our company, we hope you join us!\n\n\n\n\n\"Our Success is fueled by diverse perspectives and talents”.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/assistant-manager-business-analyst-at-olx-india-4129446903?position=2&pageNum=5&refId=lj%2BaylP9Zxb0xcLPbmF98Q%3D%3D&trackingId=5rnvZhxTGfLTvpQmd2MGkw%3D%3D"
}