{
    "job_id": "4129400720",
    "title": "Senior Business Analyst",
    "company": "Tata 1mg",
    "location": "Gurugram, Haryana, India",
    "description": "Position: Senior Business Analyst\n\nRole: Business Analyst\n\nTeam: Business Intelligence\n\nLocation: Gurgaon\n\n\n\n\nAbout Tata 1mg\n\nTata 1mg is a trusted health partner for end consumers and large institutions. Our mission is to make healthcare understandable, accessible, and affordable for all Indians. Over the past three years, we've worked to build a healthcare platform that guides customers to the right and affordable care. Today, Tata 1mg is present in 1000+ cities—and we’re just getting started. Leading the chart as one of the top consumer health platforms through ePharmacy, eDiagnostics, e-consult, and offline stores.\n\n\n\n\nTata 1mg has delivered over 15M ePharmacy orders, 2M eDiagnostics orders & 1M+ organic users/day in 2022 and we are just getting started. Our strongest asset is our 6400+ people, enabling us to deliver on our mission consistently.\n\nKnow more about us:https://www.1mg.com/aboutUs\n\n\n\n\nBrief about the Team\n\nBusiness Intelligence team works closely with the org-wide leadership team, business, product, growth, and category teams to drive operational excellence and strategic initiatives. The team works on special projects and innovations that aim to deliver high impact. The projects span across business verticals including e-pharma, e-diagnostics and retail.\n\n\n\n\nWhat will you do:\n\nBusiness strategy\n\nDefine business questions that need to be answered and participate/drive business planning\nDefine internal project’s scope, success metrics and drive project to execution highlighting the business impact.\nSound business judgment to effectively bridge the gap between analytics and business needs\n\n\n\n\n2. Problem solving and analysis\n\nCreate mathematical models and generate business insights that streamline operations, drive revenue growth, and formulate strategies and modeling-led innovation\nSolve real-world problems by building meaningful stakeholder relationships and developing domain expertise.\nDefine, manage and execute projects and individual tasks to meet short and long-term business goals\n3. Communication\nCommunicate and advocate insights to relevant stakeholders to drive outcomes\nFrequent updates to the leadership team, communicating business performance and insights that facilitate senior discussions and decision-making.\n\n\n\n\nWhat we are looking for:\n\n2+ years of experience in product/business analytics\nFluency in Microsoft Excel, SQL, and Python/R. Operational understanding of google analytics or any other product analysis tool\nStrong sense of ownership and comfort in taking initiative and proactively offering business recommendations and enhancements through analysis of various data sources\nAbility to translate complex analytics, insights, and outcomes into presentations to senior stakeholders in simple terms, demonstrating value to the business\nComfort with ambiguity: Translate business questions into analytical problems and build solutions using visualization techniques machine learning statistical modeling to ensure that the robust, scalable solution is developed\n\nWhy Join Us?\n\nTata 1mg provides one of the most exciting and high-growth environments to work. You get the added benefit of working in a prestigious legacy brand like Tata and a highly dynamic and versatile startup like 1mg. Being an integral part of the business intelligence will provide a great opportunity to scale up a business to great heights, leveraging the existing capabilities of Tata 1mg.\n\n\n\n\n\n\n\nDisclaimer: Tata 1mg is proud to be an equal opportunity employer. All employment decisions at Tata 1mg shall be made without discrimination, harassment, or less favorable treatment of any employee or job applicant, either directly or indirectly, on the grounds of age, color, physical ability, ethnic origin, nationality, religion, gender, family status, marital status, prenatal status, gender reassignment, or sexual orientation. All employment decisions are based on business needs, job requirements, competence, and merit.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-tata-1mg-4129400720?position=14&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=czvp5zi28DsTGJEBfzcQlw%3D%3D"
}