{
    "job_id": "4129190289",
    "title": "Business Analyst - Product Management",
    "company": "Srijan: Now Material",
    "location": "Gurugram, Haryana, India",
    "description": "Job Title: Business Analyst\n\nDepartment: Product Management\n\nLocation: Gurugram\n\nDuration: Full-time\n\nMode: Hybrid\n\n___________________________________________________________________________________\n\nAbout Us\n\nWe turn customer challenges into growth opportunities. Material is a global strategy partner to the world’s most recognizable brands and innovative companies. Our people around the globe thrive by helping organizations design and deliver rewarding customer experiences.\n\nWe use deep human insights, design innovation and data to create experiences powered by modern technology. Our approaches speed engagement and growth for the companies we work with and transform relationships between businesses and the people they serve.\n\nSrijan, a Material company, is a renowned global digital engineering firm with a reputation for solving complex technology problems using their deep technology expertise and leveraging strategic partnerships with top-tier technology partners. Be a part of an Awesome Tribe\n\nJob Overview\n\nWe are looking for a dynamic and motivated Business Analyst to join our team. As a Business Analyst, you will work closely with cross-functional teams to analyze business requirements, identify opportunities for improvement, and contribute to the development of data-driven strategies. This is an excellent opportunity for recent graduates or interns to gain hands-on experience in business analysis, while developing\n\nKey Responsibilities\n\nessential skills in problem-solving, data analysis, and strategic planning.\n\n\nRequirements Gathering: Assist in gathering, documenting, and analyzing business requirements through interaction with stakeholders, including business leaders, clients, and technical teams.\nData Analysis: Work with raw data to identify patterns, trends, and insights that can drive business decisions and process improvements. Problem Solving: Apply logical reasoning and structured approaches to solve complex business problems and suggest effective solutions.\nReport Preparation: Prepare detailed reports, presentations, and documents that clearly convey business insights, recommendations, and strategies to both technical and non-technical stakeholders.\nStakeholder Communication: Assist in preparing communication materials and deliver presentations to stakeholders, ensuring that information is conveyed clearly and concisely.\nDocumentation: Maintain detailed and organized documentation of business requirements, project progress, and analysis outcomes.\nCollaboration: Collaborate with cross-functional teams, including project managers, product managers, designers and developers, to ensure successful project execution and alignment with business goals.\nContinuous Learning: Keep up with industry trends, tools, and methodologies to improve your analytical skills and knowledge.\n\n\nRequired Skills And Qualifications\n\n\nExperience: 1 to 4 years of experience in Business Analysis\nEducational Background: Recent graduate or pursuing a post-grad degree in Business Administration or Computer Science\nCommunication Skills: Excellent written and verbal communication skills with the ability to clearly articulate ideas and present findings in a structured manner.\nAnalytical Thinking: Strong analytical and critical thinking skills with the ability to interpret data, recognize patterns, and make logical connections.\nProblem-Solving Ability: A structured, methodical approach to problem-solving with attention to detail and a focus on solutions.\nAttention to Detail: Ability to focus on the fine details while also understanding the bigger picture.\nTeam Player: Ability to work collaboratively in a team environment while being self\u0002motivated to manage individual tasks and deadlines.\nProficiency in MS Office Suite: Working knowledge of Excel, Word, PowerPoint.\nFamiliarity with analytical tools like SQL, Tableau, or Python is a plus.\nTime Management: Ability to handle multiple tasks and prioritize work effectively in a fast-paced environment.\n\n\nDesired Skills\n\n\nExperience with project management tools (e.g., Jira, Trello) or business process modelling tools.\nFamiliarity with Agile or Scrum methodologies.\n\n\nWhat We Offer\n\n\nLearning & Development: Gain practical experience in business analysis, data\u0002driven decision-making, and problem-solving in a professional environment.\nMentorship: Receive mentorship from experienced professionals in the field to guide your career development.\nExposure to Real-World Projects: Contribute to meaningful projects that have a direct impact on business outcomes.\nCollaborative Work Environment: Work in a dynamic, innovative team that encourages collaboration and continuous learning.\nNetworking Opportunities: Build relationships with professionals and peers across various industries\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-product-management-at-srijan-now-material-4129190289?position=2&pageNum=82&refId=N2DJYUFis9K%2FPRID1uM14Q%3D%3D&trackingId=M%2Bna3eFYipxVNnPAlDIewg%3D%3D"
}