{
    "job_id": "4129431976",
    "title": "Business Analyst",
    "company": "Precision For Medicine",
    "location": "Bengaluru, Karnataka, India",
    "description": "Position Summary\n\nThe Business Analyst (BA) is responsible for bridging the gap between business needs and product/project development teams to ensure successful product/product delivery. They collaborate with product/project managers, product owners, designers, and developers to prioritize features, improve user experiences, and ensure that the product/project meets business objectives.\n\nThe role typically involves gathering and documenting business requirements, analyzing, and collaborating with stakeholders to identify solutions to business challenges. The BA should drive toward product/project success and enhance customer satisfaction.\n\nQualifications\n\n\nEducation: Bachelor’s degree or equivalent desired.\n4+ years experience as a Business Analyst or equivalent\n2+ years experience within healthcare / clinical industry\n\n\nWork Experience\n\n\n4+ years of experience in gathering and analysing the requirements\nExperience in documenting business requirements in the form of high level requirements & user stories.\nCollaborate with various stakeholders – business, end users, product/project managers, product owners, designers & development teams.\nPrioritize the requirements based on the business objectives and contribute to product roadmaps.\nExposure to RBQM concepts, systems and workflows.\nManage/lead the Scrum ceremonires and artifacts.\nWork with product/project teams to support user acceptance testing activities\nExperience in wireframing / story boarding the requirements / POCs.\nExperience working in CSV (computer system validation) processes\nExperience in communicating with technical & non-technical individuals.\nExperience in documenting configurations and end user training materials.\nExposure to visualization tools like Tableau, Spotfire, Power BI etc.\nExperience in working in JIRA / Confluence\nBasic understanding of database concepts, data structures, metadata, data management and SQL queries.\nExposure to EDC systems, 3rd party data and SDTM guidelines.\n\n\nSkills\n\n\nAbility to drive, contribute, and support product/project success and enhance customer satisfaction\nAbility to solve highly complex product/project issues through collaboration with various stakeholders.\nExcellent organizational, interpersonal, communication, and presentation skills, must be detail-oriented.\nAbility to create and foster relationships within a team-oriented, collaborative environment leveraging excellent communication skills.\nAbility to quickly learn and adapt to new business processes and technologies\nIn-depth knowledge on all phases of an SDLC.\nArticulting the requirements & present the use cases to development team and other stakeholders.\nSolid understanding of Agile software development principles.\nUnderstand the importance of the timeline based releases & updates of the products/projects.\nExposure to EDC systems, 3rd party data and SDTM guidelines.\nSkilled in wireframing/UI tools.\n\n\nAny data provided as a part of this application will be stored in accordance with our Privacy Policy. For CA applicants, please also refer to our CA Privacy Notice.\n\nPrecision Medicine Group is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, age, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law. © 2020 Precision Medicine Group, LLC\n\nIf you are an individual with a disability and require a reasonable accommodation to complete any part of the application process or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact Precision Medicine Group at QuestionForHR@precisionmedicinegrp.com.\n\nIt has come to our attention that some individuals or organizations are reaching out to job seekers and posing as potential employers presenting enticing employment offers. We want to emphasize that these offers are not associated with our company and may be fraudulent in nature. Please note that our organization will not extend a job offer without prior communication with our recruiting team, hiring managers and a formal interview process.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-precision-for-medicine-4129431976?position=5&pageNum=22&refId=0jgrzIiQy2IEpj2UlbmQnQ%3D%3D&trackingId=JrlrfNtsPGFWo8p0B0mEyg%3D%3D"
}