{
    "job_id": "4130624095",
    "title": "Senior Business Analyst, Amazon Warehousing & Distribution",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nWe are looking to hire an insightful, results-oriented Senior Business Analyst to produce and drive analysis for AWD marketing team. The GTM for AWD is evolving to go beyond acquisition to driving engagement and retention, and this tole will play a key note in helping us with the ongoing analyses and reporting required to support planning and execution of the updated marketing strategy for AWD.\n\nThe ideal candidate has an accomplished professional background, demonstrated proficiency in advanced mathematics and/or statistics, and experience as an analyst in a business environment. They are comfortable in analyzing data from multiple sources to create strategic recommendations in a thoughtful, concise manner and obtaining organizational buy-in at senior levels. They are well- organized, can manage multiple analyses/projects simultaneously, and is intellectually curious. The candidate would develop solutions that will help bring in insights around AWD marketing initiatives thereby helping in growing AWD business.\n\nKey job responsibilities\n\nKey Responsibilities Includes\n\n\nDeveloping intelligent, insightful analytical solutions on the key drivers of AWD marketing business\nInteracting with internal stakeholders to deep-dive outliers\nEnabling effective decision making by retrieving and aggregating data from multiple sources and compiling it into a digestible and actionable format\nAnalyse and solve business problems with focus on understanding root causes and driving forward- looking opportunities\nCommunicating complex analysis and insights to our stakeholders and business leaders, both verbally and in writing.\nWorking closely with marketing managers to drive development of metrics and analyses necessary for evaluation and implementation.\nWorking with large data sets, automate data extraction, and build monitoring/reporting dashboard\nWriting high quality SQL codes to retrieve and analyse data.\n\n\nBasic Qualifications\n\n\n5+ years of Excel (including VBA, pivot tables, array functions, power pivots, etc.) and data visualization tools such as Tableau experience\n3+ years of business or financial analysis experience\nBachelor's degree or equivalent\nExperience defining requirements and using data and metrics to draw business insights\nExperience with Excel\nExperience with SQL\nExperience making business recommendations and influencing stakeholders\n\n\nPreferred Qualifications\n\n\nAny experience in retail, ecommerce or supply chain would be immensely helpful in onboarding to the business.\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI - Karnataka - A66\n\nJob ID: A2742336\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-amazon-warehousing-distribution-at-amazon-4130624095?position=7&pageNum=62&refId=9DAZTOuB47vYA4MZxFKVVA%3D%3D&trackingId=DLsI4weXVJm9tKsJmPQX3w%3D%3D"
}