{
    "job_id": "4130695992",
    "title": "Business Analyst/ Project Manager - Work From Home",
    "company": "ClinicMind",
    "location": "Gurugram, Haryana, India",
    "description": "ClinicMind, the nation’s leader in multi-specialty Electronic Healthcare Records (EHR) software and Revenue Cycle Management (RCM) services, is seeking a Business Analyst with a Project Management focus. This position involves working closely with key stakeholders to gather, analyze, and document business requirements for both new and existing projects. The role also requires bridging the gap between the technical team and business units to ensure solutions align with the organization’s goals. Additionally, you will oversee the management and execution of projects, ensuring they are completed on time, within scope, and within budget.\n\nKey Responsibilities\n\n\nBusiness Analysis:\nCollaborate with stakeholders to understand business needs and translate them into clear and actionable requirements.\nConducts a gap analysis to identify business inefficiencies and recommend solutions.\nCreate and maintain detailed documentation including Business Requirement Documents (BRD), Functional Specification Documents (FSD), and user stories.\nConduct feasibility studies, cost-benefit analysis, and risk assessments.\nProject Management:\nDevelop and manage project plans, timelines, and schedules.\nDefine project scope, objectives, and deliverables.\nCoordinate with cross-functional teams including developers, designers, and QA.\nMonitor project progress and make adjustments as needed to ensure timely delivery.\nCommunicate project status to stakeholders, managing expectations and escalating issues when necessary.\nConduct post-project reviews and provide recommendations for future improvements.\nStakeholder Management:\nLead meetings with stakeholders, ensuring that their requirements are understood and met.\nFacilitate workshops to gather input from business teams and subject matter experts.\nManage relationships with external vendors and contractors if applicable.\nQuality Assurance:\nSupport testing phases by developing test plans, test cases, and ensuring that solutions meet business requirements.\nEnsure the implementation of quality assurance standards throughout the project lifecycle.\nRisk & Issue Management:\nIdentify and proactively manage project risks and issues.\nDevelop mitigation plans and solutions to minimize potential project impacts.\nChange Management:\nSupport change management processes by preparing stakeholders for changes and helping them adapt to new systems or processes.\n\nKey Skills & Qualifications\n\n\nBachelor's degree in Business Administration, Information Technology, or related field.\nMinimum of 3-5 years of experience in business analysis and project management.\nKnowledge of software development life cycle (SDLC) and Agile methodologies.\nUS Healthcare knowledge is an added advantage\nDesirable Certifications\nCertified Business Analysis Professional (CBAP) or Certification of Competency in Business Analysis (CCBA).\nProject Management Professional (PMP) or Certified ScrumMaster (CSM).\nAgile Certified Practitioner (PMI-ACP).\nTools & Technologies:\nProject Management Tools: ( At least one )\nMicrosoft Project - This is used to create project timelines, Gantt charts, and resource management.\nTrello or Asana - This is for task management and tracking project milestones.\nSmartsheet - For collaborative project management with features for tasks, timelines, and reporting.\nMonday.com - A visual platform for project tracking and team collaboration.\nBasecamp - For team collaboration and project management with shared calendars, to-dos, and file sharing.\nData Analysis & Reporting Tools:\nQuickSight/Tableau/Power BI - For data visualization and business intelligence reporting.\nBasic SQL - To query databases for business insights.\nBusiness Analysis Tools:\nJira - For managing and tracking user stories, requirements, and progress.\nConfluence - To document and share requirements, specifications, and meeting notes.\nVisio or Lucidchart - For creating process flows and system diagrams.\nBalsamiq or Axure - For creating wireframes and prototypes.\n\nPosition Requirements\n\n\nMust have a stable internet connection minimum of 5 MBPS\nMust have a mobile data plan as a backup\nMust be in a quiet environment\nMust be comfortable working the US Eastern Time business hours\nMinimum system requirement: Latest i5 with SSD hard disk (i7 preferred), 16GB RAM (32 GB preferred)\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-project-manager-work-from-home-at-clinicmind-4130695992?position=3&pageNum=75&refId=oawIpd1n3a%2BRa%2FbhSX9Nsw%3D%3D&trackingId=4YEFJJOXFC5Th2cMsOu3PA%3D%3D"
}