{
    "job_id": "4130872582",
    "title": "Business Analyst",
    "company": "ICICIDirect",
    "location": "Navi Mumbai, Maharashtra, India",
    "description": "Responsibilities\n\nEngage with business leaders and users to understand the business needs and come up with solutions including new offerings and improvements/changes to existing products and processes.\nShould be able to own and take responsibility as Product owner\nCome up with new ideas, conceptualization, ensuring development of new products / features for products relating to Equity Cash, Equity Derivatives, Currency Derivatives and Commodities markets.\nPreparation of Business Requirements Specifications (BRS) document, FAQs, Approval Notes and other required documents.\nReviewing Systems Requirements Specifications (SRS) document received from Technology Team and giving sign off\nScoping out the test plan, defining detailed test cases, taking responsibility of User Acceptance Testing (UAT), bug reporting & ensuring resolution with bug free launches\nResponsible for Mock trading of products with exchanges and successful completion from compliance perspective\nProject Tracker planning and regular proactive updates\nResponsible for Closed User Group (CUG) trading in Live environment and getting the feature implemented for customers in the live environment.\nTracking and implementing regulatory changes and\nCompetition tracking and industry trend analysis\n\n\n\n\nQualifications and experience:\n\nCA / MBA (Finance)/CFA /CBAP\nExperience of 3-9 years and more in Securities Market (Capital Markets, Equity Derivatives and Commodities)\nExperience in Business Analyst/product development role from Functional/Business side is preferable\nExperience in Algo or Equity trading products is desirable\nAny additional certifications in Indian Securities Market are desirable\n\n\n\n\nSkill Sets\n\nEffective communication (verbal & written)\nTeam Player\nBusiness solution orientation\nAttention for details\nDiligent, Sincere, Honest with high integrity\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-icicidirect-4130872582?position=1&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=%2FvCDL8dx0zhOUOEh0IFHhQ%3D%3D"
}