{
    "job_id": "4130884159",
    "title": "Business Analyst, Amazon Now, India",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nWe are seeking a dynamic and detail-oriented Business Analyst to join our team. The ideal candidate will act as a key liaison between stakeholders, translating business requirements into actionable insights and solutions. As part of the Business Finance team, the Business Analyst will be responsible for working closely with the finance and business partners to analyze data, build inferences, and deliver compelling and actionable data insights in terms of reports and dashboards. Candidate should be proficient in data visualization tools (e.g., Tableau, Power BI) and SQL for data analysis.\n\nThis position is based in Bangalore.\n\nKey job responsibilities\n\nStrong analytical and problem-solving abilities.\n\nProficiency in data visualization tools (e.g., Tableau, Power BI) and SQL/Python for data analysis.\n\nExcellent communication and interpersonal skills to work with cross-functional teams.\n\nAbility to interpret complex data and present it in a clear and actionable manner.\n\nProject management skills, with the ability to manage multiple tasks and deadlines.\n\nKnowledge of business process modeling and requirements gathering techniques.\n\nBasic Qualifications\n\n\n2+ years of data analytics or automation experience\nBachelor's degree\nKnowledge of data pipelining and extraction using SQL\nKnowledge of SQL and Excel at a moderate or advanced level\nExperience with data mining tools like SQL, SAS, SPSS, or similar\n\n\nPreferred Qualifications\n\n\nExperience in data analytics or automation\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ASSPL - Karnataka\n\nJob ID: A2877702\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-amazon-now-india-at-amazon-4130884159?position=25&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=Ho7HIu9hiHiHoRvre9Mdjw%3D%3D"
}