{
    "job_id": "4131273102",
    "title": "Business Analyst",
    "company": "Quantzig",
    "location": "Bengaluru, Karnataka, India",
    "description": "To define, develop & support analytical solutions, along with extracting insights from data for improving business decisions of various retail functions (Ex. Marketing, Merchandising, Retail etc.) in all business units.\n\nThe recruit will be directly working with the on-shore Analytics team and with key business stakeholders of retail functions in each business unit to understand their business problems around merchandising and help deliver data driven decision making.\nAnalyze data to evaluate existing decisions framework and apply analytical techniques to discover meaningful patterns.\nDevelop and support sophisticated & innovative analytical solutions that generate actionable insights by utilizing diverse information.\nProvide high-end consulting to functional teams to help them sharpen their business strategy.\nKeep abreast of industry trends and emerging methodologies to continuously improve skill set.\nContribute to knowledge sharing and improve team productivity through training/documentation of best practices.\nExposure to Azure Databricks (Good to have)\nExperience in Power BI (Good to have).\n\n\n\n\nDesired Skills and Experience:\n\nBachelor’s or master’s degree in any quantitative discipline (B.Tech/M.Tech in Computer Science/IT preferred) Candidates from Economics, Statistics/Data Science or Operations Research background from reputable institutions would also be preferred\nAbility to handle large datasets and expertise in analytical tools such as SAS, SQL, R, Python, Spark etc.\nExpertise in analytical techniques such as Linear Regression, Logistic Regression, Cluster analysis, Market Basket Analysis, Product Bundling, Cross/Upsell Analysis etc.\nStrong MS office skills and data visualization competence\nExcellent verbal and written presentation skills\nShould be able to articulate thoughts and ideas properly (structured approach should be there for problem solving)\nAttention to detail and ability to work in high pressure environment.\nStrong Drive and passion to deliver business impact through retail analytics.\nStrong business acumen and ability to translate data insights into meaningful business recommendations.\nOpen to Travel (up to 20%) on need basis\n3 - 5 years of analytics experience in Retail/CPG industry covering at least 2 of the below mentioned areas:\nCustomer (insights/trends)\nCampaigns/CRM\nLoyalty\nMarketing\nProven experience in delivering analytical solutions within mid to large size project teams.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-quantzig-4131273102?position=46&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=cyTH0R6ohdg19hlXSq7VEA%3D%3D"
}