{
    "job_id": "4131718922",
    "title": "Servicenow Business Analyst",
    "company": "Dexian India",
    "location": "Hyderabad, Telangana, India",
    "description": "Job Title: Servicenow Business Analyst\n\nLocation: Chennai, Hyderabad, Bangalore, Mumbai, Pune, Kolkata, Gurugram\n\nTimings: 11am – 8pm; 2pm – 11pm\n\nExperience: 8+ years of relevant exp.\n\nNotice Period: Immediate to 20 days\n\n\n\n\nNote: HRSD experience is mandatory.\n\n\n\n\nJob Description:\n\n\n\n\nMinimum 8-12 years’ experience as a business analyst or related experience with a Bachelor’s degree or 10 years plus a Master’s degree. Experience in HRSD and any other module of ServiceNow\n\n• ServiceNow platform experience in driving solutions in an enterprise environment strongly preferred.\n\n• A proven and verifiable history of analyzing business situations and working within a group environment to provide efficient and effective software solutions.\n\n• Experienced in preparing as-is process documentation, to-be process documentation, and performing detailed gap analysis.\n\n• Demonstrated ability to have successfully completed multiple, complex technical projects\n\n• Demonstrated experience in project conceptualization and planning\n\n• Ability to communicate in a clear, concise and professional manner, tailored to the appropriate audience\n\n• Ability to lead and work collaboratively within a business unit team and have strong influencing skills\n\n• Must be able to manage multiple priorities and complex tasks in a dynamic work environment\n\n• Must have experience preparing end-user documentation and conducting end-user training Business Analysis experience in a high-tech (preferable software) company highly desirable.\n\n• Project Management experience a plus ServiceNow System Administrator Certification highly desired\n\n• Flexibility to work with a variety of personalities and styles\n\n• Adaptable to work in a varied, high-paced exiting, fun environment Must be technically savvy and able to design and build applications that meet business goals and objectives Must be a self-starter and keen to explore new solutions\n\n• Must be someone who is intellectually curious and excited about working with customers and gets gratification from building useful IT applications and solutions\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/servicenow-business-analyst-at-dexian-india-4131718922?position=7&pageNum=52&refId=45I0DUvCFXw1ux4xI%2B7zbg%3D%3D&trackingId=iSY9VXhlV%2BTUE8IM1pQxGQ%3D%3D"
}