{
    "job_id": "4131367121",
    "title": "Business Analyst , AOP",
    "company": "Amazon",
    "location": "Hyderabad, Telangana, India",
    "description": "Description\n\nThe candidate would be responsible for maintaining/refreshing WBRs and other analytical frameworks setup by senior analysts. They would also be required to build simple reports, take up dive deep requests, make changes to existing analytical frameworks and provide adhoc data support to Ops stakeholders. The person should have a good understanding of a business requirement and the ability to quickly get to the root cause of a particular reporting/BI/data issue, and draft solutions for resolution. The ideal candidate would be high on attention to detail, bias for action and interest in analytics/BI/automation.\n\nKey job responsibilities\n\nSome of the key result areas include, but not limited to:\n\nOwn the design, development, and maintenance of ongoing metrics, reports, analyses, dashboards, etc. to drive key business decisions. Ensure data accuracy by validating data for new and resources.\n\nWork closely with stakeholders (internal/external) to understand and automate/enhance existing processes\n\nShould be open to learn and develop skillsets in the latest technologies and analytical techniques\n\nShould understand how data/analytical frameworks and their work translate to business on ground\n\nShould be able to come up with innovative ideas for new work or to improve existing work\n\nAbout The Team\n\nAOP (Analytics Operations and Programs) team is missioned to standardize BI and analytics capabilities, and reduce repeat analytics/reporting/BI workload for operations across IN, AU, BR, MX, SG, AE, EG, SA marketplace.\n\nAOP is responsible to provide visibility on operations performance and implement programs to improve network efficiency and defect reduction. The team has a diverse mix of strong engineers, Analysts and Scientists who champion customer obsession.\n\nWe enable operations to make data-driven decisions through developing near real-time dashboards, self-serve dive-deep capabilities and building advanced analytics capabilities.\n\nWe identify and implement data-driven metric improvement programs in collaboration (co-owning) with Operations teams.\n\nBasic Qualifications\n\n\n1+ years of data analytics or automation experience\n1+ years of capacity planning, operations planning, business analysis or similar experience\nBachelor's degree\nKnowledge of data pipelining and extraction using SQL\nKnowledge of SQL and Excel at a moderate or advanced level\nExperience with data mining tools like SQL, SAS, SPSS, or similar\n\n\nPreferred Qualifications\n\n\nKnowledge of SQL/Python/R, scripting, MS Excel, table joins, and aggregate analytical functions\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ASSPL - Telangana\n\nJob ID: A2878036\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-aop-at-amazon-4131367121?position=8&pageNum=92&refId=Cg5sPd6Nkk2JaEAHs4OCRg%3D%3D&trackingId=r9GYFqiarDSbVcrUM7DkeQ%3D%3D"
}