{
    "job_id": "4131274320",
    "title": "Senior Analyst, Business Analytics",
    "company": "Colgate-Palmolive",
    "location": "Mumbai Metropolitan Region",
    "description": "Relocation Assistance Offered Within Country\n\nJob Number #164758 - Mumbai, Maharashtra, India\n\nWho We Are\n\nColgate-Palmolive Company is a global consumer products company operating in over 200 countries specialising in Oral Care, Personal Care, Home Care, Skin Care, and Pet Nutrition. Our products are trusted in more households than any other brand in the world, making us a household name!\n\nJoin Colgate-Palmolive, a caring, innovative growth company reimagining a healthier future for people, their pets, and our planet. Guided by our core values—Caring, Inclusive, and Courageous—we foster a culture that inspires our people to achieve common goals. Together, let's build a brighter, healthier future for all.\n\nAbout Colgate-Palmolive\n\nDo you want to come to work with a smile and leave with one as well? In between those smiles, your day consists of working in a global organization, continually learning and collaborating, having stimulating discussions, and making impactful contributions! If this is how you see your career, Colgate is the place to be! Our diligent household brands, dedicated employees, and sustainability commitments make us a company passionate about building a future to smile about for our employees, consumers, and surrounding communities. The pride in our brand fuels a workplace that encourages creative thinking, champions experimentation, and promotes authenticity which has contributed to our enduring success. If you want to work for a company that lives by their values, then give your career a reason to smile...every\n\nThe Experience:\n\nIn today’s multifaceted technology environment, it is an exciting time to be a part of the Data Analytics team at Colgate!.\n\nOur highly technical and innovative team is dedicated towards driving growth for Colgate Palmolive in this constantly evolving landscape.\n\nWhat role will you play as a member of the Colgate’s Analytics team?\n\nThe candidate will support Colgate Business teams and CBS Analytics by exploring and finding opportunities for building use cases using Prompt Engineering. The role requires a person to have an understanding of Artificial Intelligence, Machine Learning and Generative AI. The Person should be Analytical problem solver with the ability to work on large data sets, collaborative and customer focused (proactive and Adaptable to Business needs) and Effective in Written and verbal communication skills.\n\nWho Are You…\n\nYou are a function expert -\n\nThis position is for an Individual contributor who would be responsible for the following\n\n\nDesign, develop and refine AI-generated text prompts for various applications\nCollaborate with content creators, product teams and data scientists to ensure timely alignment with company goals and user needs\nSupervise and analyze timely performance to identify areas for improvement\nOptimize AI prompt generation process to enhance overall system performance\nStay up-to-date on the latest advancements in AI, natural language processing and machine learning\nProvide support to teams in understanding prompt engineering standard processes\n\n\nWhat You’ll Need…(Required)\n\n\nBachelor of Engineering/Sciences, MBA\n1= years of experience in programming languages, AI-related tools such as ChatGPT, and data analysis techniques\nComprehensive understanding of natural language processing, machine learning and AI-generated content development\nKnowledge of Data Transformation tools - R/Python/ SQL/Cloud solutions (GCP)\nSolid understanding of visualization tools like Tableau, DOMO, Data studio\nAbility to Read, Analyze and Visualize data\nEffective Verbal & Written Communication for Business engagement.\n\n\nWhat you’ll need…(Preferred):\n\n\nExcellent problem-solving and analytical skills\nAbility to collaborate optimally with cross-functional teams\nSolid understanding of consumer packaged goods industry\nUnderstanding of Colgate’s processes, and tools supporting analytics (for internal candidates)\nWillingness and ability to experiment with new tools and techniques\nGood facilitation and project management skills\n\n\nOur Commitment to Diversity, Equity & Inclusion\n\nAchieving our purpose starts with our people — ensuring our workforce represents the people and communities we serve —and creating an environment where our people feel they belong; where we can be our authentic selves, feel treated with respect and have the support of leadership to impact the business in a meaningful way.\n\nEqual Opportunity Employer\n\nColgate is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, colour, religion, gender, gender identity, sexual orientation, national origin, ethnicity, age, disability, marital status, veteran status (United States positions), or any other characteristic protected by law.\n\nReasonable accommodation during the application process is available for persons with disabilities. Please complete this request form should you require accommodation.\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-analyst-business-analytics-at-colgate-palmolive-4131274320?position=10&pageNum=55&refId=rCPSt2W60wSZDZdAR5hPHw%3D%3D&trackingId=dHqoo27BrRWsZrMfzubcjA%3D%3D"
}