{
    "job_id": "4131111002",
    "title": "Manager \\ Senior Business Analyst (Sales Analyst)",
    "company": "Denave",
    "location": "Noida, Uttar Pradesh, India",
    "description": "Denave is hiring for \"Business Analyst\" role who has ability turn data into knowledge to deliver best possible solutions to our clients.\n\n\n\n\nSkills Required : Client Management ,Team Management, Sales Reporting, Business Analytics, Sales Data Management ,Business Reporting\n\n\n\n\nJob Responsibilities:\n\nTranslate business needs to technical specifications and then, Design, build and deploy BI solutions (e.g. reporting tools)\nFamiliarity with BI technologies (e.g. Tableau, Microsoft Power BI, Oracle BI)\nShould have experience in managing sales processes as a business analyst\nIn-depth understanding of database management systems, online analytical processing (OLAP) and ETL (Extract, transform, load) framework\nPerform hands-on analysis of large volumes of data and across multiple datasets primarily using SQL and/or Python/R.\nAbility to identify actionable insights by analyzing data in respect to the business focus/needs.\nDesign models to solve business problems and, where appropriate, manage integration of the insights into regular reporting by the Reporting/BI teams\nUse a range of analytical and statistical techniques to answer key questions from stakeholders\nMust have experience of client handling roles, esp. requirement gathering and elicitation\n\n\n\n\nWhat we expect from you:\n\nB.Tech /BE/ BCA/ BSc in Computer Science, Engineering or relevant field, from reputed Engineering College/ Universities\n5+ years of experience working as a Business Analyst and team management with hands on experience working on Sales Reports, Sales Analysis , Client Management is required\nFamiliarity with BI technologies (e.g. Tableau OR Microsoft Power BI OR Oracle BI)\nSkills Required : Client Management , Sales Reporting ,Business Analytics, Data Modelling, Data Analytics, Data Modelling ,ETL (Informatica, Talend, Terradata, Jasper, etc. )\nTotal Experience : 5+Years\nRelevant Experience : 2+Years (As a Business Analyst)\nGood Communication and Analytical Skills\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/manager-senior-business-analyst-sales-analyst-at-denave-4131111002?position=5&pageNum=12&refId=0qwF5I591Ogz%2FBtLFZTetg%3D%3D&trackingId=bKun2N5JF6e7anRLsK%2FcmA%3D%3D"
}