{
    "job_id": "4131205893",
    "title": "Sr. Business Analyst",
    "company": "Orange Health Labs",
    "location": "Bengaluru, Karnataka, India",
    "description": "About the company Orange Health is an on-demand diagnostics service for Indian consumers that enables convenience, reliability and overall better healthcare outcomes. With our deep understanding of primary healthcare and its opportunities, we are building Orange Health to become the infrastructure of remote healthcare in India, starting with making diagnostics on-demand. Since our launch in 2020, Orange Health has grown fast to become a diagnostics leader in Bangalore by delivering a strong product experience. Our Founders: The founders Dhruv Gupta (Consumer tech entrepreneur with 2 successful exits) & Tarun Bhambra (Experienced corporate leader and VC investor) have 15+ years of combined healthcare experience and have together built a profitable health-tech business, serving 100m+ users. Our vision is supported by high-quality investors like Accel, General Catalyst, Y Combinator, along with marquee healthcare and global investors. Diagnostics is something that is going to meaningfully touch your family every day. Join us to make Diagnostics 10x more convenient, 10x more accurate - 10x better.\n\nOur Presence: We are currently serving Bangalore, NCR, Mumbai, Hyderabad, with a plan to enter other metro cities soon :) Why might you be excited about us?\n\n\nWe are on a mission to build the fastest diagnostic lab in India.\nWe have a bunch of Talented folks who relentlessly work towards bringing a WOW customer experience. Rated currently at 4.9.\nOur Product team is lean, so you will be able to contribute efficiently within a flat and collaborative structure.\nOur team hails from top institutes with experience in leading brands like Flipkart, Practo, Unacademy, Swiggy, Metropolis, Licious, cure.fit etc. and we are excited to learn from you too.\nWe care for your career & growth and hence we will help you to shape a career you are excited about.\nWe work hard and we party harder. Our People NPS is >90% and Glassdoor rating is 4.9\n\n\nSkills We Are Looking For-\n\n\nSound knowledge of Database and SQL and Microsoft Excel.\nUnderstanding the business Objectives\nAnalytical and Critical Thinking\nCommunication and Interpersonal Skills\nNegotiation and Cost - Benefit Analysis\nDecision- Making Skills\n\n\nKey Responsibilities-\n\n\nUnderstand ambiguous problems and define them along with relevant stakeholders.\nTranslate structured and unstructured problems into an analytical framework.\nConduct exploratory data analysis to derive actionable insights from data.\nDeep dive into specific situations and conduct root cause analysis.\nPartner with stakeholders and share insights from data to solve key business problems\n\n\nCreate and automate dashboards to monitor key product metrics.\n\n\nProduce dashboards and presentation documents for internal and external use.\n\n\nSkills: cost-benefit analysis,negotiation,decision-making,advance excel,communication skills,sql,database,interpersonal skills,analytical thinking,dashboards,microsoft excel,critical thinking\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/sr-business-analyst-at-orange-health-labs-4131205893?position=5&pageNum=82&refId=N2DJYUFis9K%2FPRID1uM14Q%3D%3D&trackingId=ChskloFBZXXhRaOzksx7og%3D%3D"
}