{
    "job_id": "4131256931",
    "title": "Business Analyst",
    "company": "NGflows",
    "location": "India",
    "description": "Company Description\n\nNGflows focuses on the critical back-office functions that drive energy management success. The company delivers operational excellence through optimized scheduling, reporting, billing variable generation, invoice validation, and strategic management.\n\n\n\n\nRole Description\n\nWe are looking for a Business Analyst to join our team and support the development of strategies, optimize operations, and improve the decision-making process for natural gas management. In this role, you will work closely with the operations, analytics, and technical teams to analyze data, identify trends, and make actionable recommendations that improve our services and support our clients' business objectives.\n\nResponsibilities:\n\nData Analysis: Analyze large sets of operational data, including gas flow data, purchasing trends, transport reservations, and cost metrics, to generate insights that drive decision-making.\nStrategy Development: Collaborate with the analytics and operations teams to develop long-term strategies for natural gas commodity procurement, transport reservations, and network optimization.\nProcess Optimization: Identify areas where processes can be improved in gas scheduling, imbalance management, and transport usage, and develop recommendations to optimize efficiency and reduce costs.\nReporting: Prepare detailed reports and presentations for internal stakeholders and clients, summarizing key findings, operational performance, and cost-saving opportunities.\nRequirements Gathering: Work with business stakeholders, including traders, schedulers, and finance teams, to gather requirements for new tools, systems, and processes that support gas flow optimization and scheduling.\nClient Support: Provide insights and data-driven recommendations to clients regarding gas purchases, scheduling, and transport optimization.\nRisk Management: Analyze risk factors related to imbalances, overruns, and transport inefficiencies and recommend strategies to mitigate those risks.\nContinuous Improvement: Participate in the continuous improvement of internal tools, reporting systems, and operational workflows.\n\nKey Skills and Qualifications:\n\nExperience: Proven experience as a Business Analyst in energy management, utilities, or a related field, with a strong understanding of operations, strategy, and data analytics.\nData Analytics: Strong proficiency in data analysis and reporting, with experience using tools like Excel, Tableau, or Power BI to analyze and visualize data.\nProcess Improvement: Experience identifying inefficiencies and recommending process improvements, especially in areas like scheduling, procurement, and cost management.\nProblem-Solving: Strong analytical and problem-solving skills with the ability to think critically and make data-driven recommendations.\nCommunication: Excellent communication skills, with the ability to present complex information in a clear and actionable manner to both technical and non-technical audiences.\nEnergy Industry Knowledge: Familiarity with natural gas operations, energy markets, or utilities is a plus, but not required.\nCollaboration: Ability to work effectively with cross-functional teams, including analysts, traders, schedulers, and clients, to achieve business objectives.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-ngflows-4131256931?position=8&pageNum=7&refId=l5e7KWmGHGwd1%2FdKVQ5rRw%3D%3D&trackingId=rxBKNcEnKxTqRHBhll7TzA%3D%3D"
}