{
    "job_id": "4132648363",
    "title": "Salesforce Business Analyst Manager",
    "company": "PwC Acceleration Centers",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Level - Manager\n\nEducational Qualifications: BE / B Tech / MCA/ M.Sc / M.E / M.Tech\n\n\n\n\nPlease find below the job description\n\nJob Description\n\nA career within Salesforce Practice at PwC AC Bangalore/Mumbai, will provide you with the opportunity to help our clients leverage Salesforce technology to enhance their customer experiences, enable sustainable change, and drive results. We focus on understanding our client’s challenges and developing custom solutions powered by Salesforce platform to transform their sales, service and marketing capabilities by exploring data and identifying trends, managing customer life cycles, strategically building and leveraging online communities, driving employee engagement and collaboration, and connecting directly with channel partners to share goals, objectives, and activities in a secure, branded location.\n\nResponsibilities\n\nAs a Senior, you will work as part of a team of problem solvers with extensive consulting and industry experience, helping our clients solve their complex business challenges from strategy to execution. Specific responsibilities include but are not limited to\n\n· Be actively involved in business development activities of the practice\n\n· Contribute to the development of your own and team’s business & technical acumen\n\n· Develop strategies to solve complex business challenges\n\n· Keep up to date with local and national business and economic issues\n\n· Continue to develop internal relationships and your PwC brand\n\nThe Role\n\nThis is a consulting role with an equal emphasis on technical delivery and strong client management. You will be the client’s primary point of contact for the scope, requirements and Salesforce solution, delivering client solutions using the Salesforce technology set. You will operate across the project lifecycle from discovery through to development, test and training.\n\nResponsibilities\n\n· Development of client solutions\n\n· Discovery & design workshops to identify client requirements\n\n· Design of Salesforce solutions to meet client requirements\n\n· Build of Salesforce solutions using configuration\n\n· Data migration & integration using data transfer tools\n\n· Internal tests validations and FATs with client\n\n· End user training and other user adoption activity\n\n· Deep understanding of Customer Relationship Management (CRM) and Configure, Price, Quote (CPQ) processes\n\n· Strong functional understanding of business processes related to: Field Sales, Sales Management, Sales Operations, and CPQ\n\n· Deep experience in multiple CPQ capabilities such as: product modeling, configuration, and rules (Lead to Cash - L2C ), guided configuration / guided selling, pricing / discounting, workflow / approvals, quoting / document generation / e-signature, contracts / subscriptions / renewals, quote to order conversion\n\n· Leading and understanding large, complex global transformation projects\n\nGeneral\n\n· Participate in recruitment activities where necessary\n\n· Maintain certifications in selected salesforce products (Sales and Service - Mandatory, CPQ Specialist, Apttus etc)\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/salesforce-business-analyst-manager-at-pwc-acceleration-centers-4132648363?position=6&pageNum=65&refId=c7sH5y8Mkcxycc0ZQ9ncOA%3D%3D&trackingId=WTGg2vPJQHjBbyhIzXQG%2Fg%3D%3D"
}