{
    "job_id": "4132646246",
    "title": "Senior Business Analyst",
    "company": "Donyati",
    "location": "India",
    "description": "Role: Business Analyst\n\nJob description:\n\n• Advises and provides analytical support and recommendations to stakeholders making decisions related to business or IT applications or IT platforms, considering current and future business needs and opportunities.\n\n• Maintains advanced understanding of business processes, IT applications or IT platforms and conduct gap or impact analysis to identify and present new opportunities.\n\n• Collaborate and communicate all the key information with internal team members, stakeholders, and information services to ensure dependencies, risks, and opportunities are identified and addressed.\n\n• Research critical business pain points requiring advanced knowledge of business.\n\n• Responsible for gathering, analyzing, and documenting the business requirements for IT applications or IT platforms or data systems and directing the testing and implementation of new systems or changes to current systems, as required, to meet contractual needs and improve processes.\n\n• Lead and involve in the design and administration of standards and policies for IT applications or IT platforms and document them for the end users of customer.\n\n• Provide input and participate in establishing application or process documentation standards and quality assurance methodologies.\n\n• Provides work direction and coaching to team members and contribute towards the performance and development plans.\n\n\n\n\nMust Have\n\nMust have worked in Property & Casualty (p&c) insurance domain.\n\n• Must have a Bachelor's degree. Post-Graduation or Master’s degree is preferrable.\n\n• Minimum of 3 years work experience in analyzing IT business processes, software application design, with an understanding of application data systems and operations processes.\n\n• Experience in Agile Methodology – JIRA or Azure DevOps is preferrable.\n\n• Experience in developing and maintaining documentation related to workflow and business requirements, as well as technical functionality of IT applications.\n\n• Advanced knowledge of Microsoft Office tools.\n\n• Knowledge of risk & controls with experience in identifying and fixing gaps, documenting controls and testing of those controls.\n\n• Successful completion of an analyst assessment may be required.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-donyati-4132646246?position=6&pageNum=17&refId=otcMTVij75x3rORf5Q9zLA%3D%3D&trackingId=gLVcPBrengvy8iVWK3CmOA%3D%3D"
}