{
    "job_id": "4132465843",
    "title": "Business Analyst",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nHave you ever thought about what it takes to detect and prevent fraudulent activity among hundreds of millions of e-commerce transactions across the globe? What would you do to increase trust in an online marketplace where millions of buyers and sellers transact? How would you build systems that evolve over time to proactively identify and neutralize new and emerging fraud threats?\n\nOur mission in Buyer Risk Prevention is to make Amazon the safest place to transact online. Buyer Risk Prevention safeguards every financial transaction across all Amazon sites, while striving to ensure that these efforts are transparent to our legitimate customers. As such, Buyer Risk Prevention designs and builds the software systems, risk models and operational processes that minimize risk and maximize trust in Amazon.com.\n\nAs a Business Analyst in Buyer Risk Prevention, you will be responsible for analyzing terabytes of data to identify specific instances of risk, broader risk trends and points of customer friction, developing scalable solutions for prevention. You will need to collaborate effectively with business and product leaders within BRP and cross-functional teams to solve problems, create operational efficiencies, and deliver successfully against high organizational standards. You should be able to apply a breadth of tools, data sources, and analytical techniques to answer a wide range of high-impact business questions and proactively present new insights in concise and effective manner. In addition you will be responsible for building a robust set of operational and business metrics and will utilize metrics to determine improvement opportunities.\n\nYou should be an effective communicator capable of independently driving issues to resolution and communicating insights to non-technical audiences. This is a high impact role with goals that directly impacts the bottom line of the business.\n\nResponsibilities\n\n\nUnderstand the various operations across Payment Risk\nDesign and develop highly available dashboards and metrics using SQL and Excel/Tableau\nPerform business analysis and data queries using scripting languages like R, Python etc\nUnderstand the requirements of stakeholders and map them with the data sources/data warehouse\nOwn the delivery and backup of periodic metrics, dashboards to the leadership team\nDraw inferences and conclusions, and create dashboards and visualizations of processed data, identify trends, anomalies\nExecute high priority (i.e. cross functional, high impact) projects to create robust, scalable analytics solutions and frameworks with the help of Analytics/BIE managers\nPerform business analysis and data queries using appropriate tools\nWork closely with internal stakeholders such as business teams, engineering teams, and partner teams and align them with respect to your focus area\nExecute analytical projects and understanding of analytical methods (like ANOVA, Distribution theory, regression, forecasting, Machine Learning Techniques, etc.)\nDraw inferences and insights from the data using EDA and data manipulations using advanced SQL for business reviews\n\n\nKey job responsibilities\n\n\nUnderstand the various operations across Payment Risk\nDesign and develop highly available dashboards and metrics using SQL and Excel/Tableau/QuickSight\nUnderstand the requirements of stakeholders and map them with the data sources/data warehouse\nOwn the delivery and backup of periodic metrics, dashboards to the leadership team\nDraw inferences and conclusions, and create dashboards and visualizations of processed data, identify trends, anomalies\nExecute high priority (i.e. cross functional, high impact) projects to improve operations performance with the help of Analytics managers\nPerform business analysis and data queries using appropriate tools\nWork closely with internal stakeholders such as business teams, engineering teams, and partner teams and align them with respect to your focus area\nExecute analytical projects and understanding of analytical methods (like ANOVA, Distribution theory, regression, forecasting, Machine Learning Techniques, etc.)\n\n\nBasic Qualifications\n\n\nBachelor's degree in business, engineering, statistics, computer science, mathematics or related field\n1+ years of tax, finance or a related analytical field experience\nExperience creating complex SQL queries joining multiple datasets, ETL DW concepts\nExperience defining requirements and using data and metrics to draw business insights\nExperience demonstrating problem solving and root cause analysis\nExperience with reporting and Data Visualization tools such as Quick Sight / Tableau / Power BI or other BI packages\nKnowledge of Microsoft Excel at an advanced level, including: pivot tables, macros, index/match, vlookup, VBA, data links, etc.\nExperience using databases with a large-scale data set\n1+ year of experience working in Analytics / Business Intelligence environment with prior experience of design and execution of analytical projects\n\n\nPreferred Qualifications\n\n\nExperience in Amazon Redshift and other AWS technologies\nExperience scripting for automation (e.g., Python, Perl, Ruby)\nExperience using Python or R for data analysis or statistical tools such as SAS\nExperience in e-commerce / on-line companies in fraud / risk control functions\nAnalytical mindset and ability to see the big picture and influence others\nDetail-oriented and must have an aptitude for solving unstructured problems. The role will require the ability to extract data from various sources and to design/construct/execute complex analyses to finally come up with data/reports that help solve the business problem\nGood oral, written and presentation skills combined with the ability to be part of group discussions and explaining complex solutions\nAbility to apply analytical, computer, statistical and quantitative problem solving skills is required\nAbility to work effectively in a multi-task, high volume environment\nAbility to be adaptable and flexible in responding to deadlines and workflow fluctuations\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI - BLR 14 SEZ\n\nJob ID: A2867436\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-amazon-4132465843?position=13&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=rMkIozQKb2fVoof%2BLLfT5A%3D%3D"
}