{
    "job_id": "4132270170",
    "title": "Senior Business Analyst",
    "company": "Yucca Scalian Group (Yucca IT Solutions)",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Title: Senior Business Analyst - Direct Store Delivery (DSD)\n\n\n\n\nLocation - Bangalore\n\n\n\n\nExperience - 10+years\n\n\n\n\n\n\n\nJob Overview\n\n\n\n\n\n\n\nThe Senior Business Analyst for Direct Store Delivery (DSD) plays a critical role in optimizing and analyzing DSD processes within a retail or distribution environment. The position involves working closely with cross-functional teams to evaluate, enhance, and streamline the DSD operations, ensuring efficient product delivery and inventory management. The Senior Business Analyst will leverage data and business insights to drive performance improvements, cost reductions, and operational efficiencies.\n\n\n\n\n\n\n\nKey Responsibilities\n\n\n\n\n\n\n\n1. Data Analysis & Reporting: Analyze sales, delivery, and inventory data to identify trends, performance gaps, and opportunities for optimization. Create and maintain dashboards, performance reports, and KPIs to track the effectiveness of DSD operations. Provide actionable insights to key stakeholders, including senior management, to support decision-making and strategy development.\n\n\n\n\n\n\n\n2. Process Improvement: Collaborate with cross-functional teams to identify areas for process improvement and develop strategic recommendations to enhance DSD operations. Design and implement changes to optimize delivery routes, inventory management, and product availability.\n\n\n\n\n\n\n\n3. Stakeholder Management: Develop and maintain strong relationships with key stakeholders, including senior management, sales teams, and logistics providers. Communicate complex data insights and recommendations in a clear and actionable manner.\n\n\n\n\n\n\n\n4. Project Management: Lead and manage projects related to DSD process improvements, ensuring timely and within-budget delivery. Coordinate with internal teams and external partners to ensure seamless execution.\n\n\n\n\n\n\n\n5. Change Management: Develop and implement change management strategies to ensure successful adoption of process changes and technology implementations. Provide training and support to end-users to ensure smooth transition.\n\n\n\n\n\n\n\n6. Technology Evaluation: Evaluate and recommend technology solutions to support DSD operations, including transportation management systems, inventory management software, and data analytics platforms.\n\n\n\n\n\n\n\n7. Cost Reduction and Optimization: Identify opportunities for cost reduction and optimization within DSD operations. Develop and implement strategic plans to reduce costs, improve efficiency, and enhance customer satisfaction.\n\n\n\n\n\n\n\n8. Compliance and Risk Management: Ensure compliance with regulatory requirements and company policies related to DSD operations. Identify and mitigate risks associated with DSD operations, including product damage, inventory discrepancies, and logistics disruptions.\n\n\n\n\nRequirements\n\n\n\n\n\n\n\n- Bachelor's degree in Business Administration, Supply Chain Management, or related field\n\n- Minimum 5 years of experience in business analysis, supply chain management, or logistics\n\n- Proven experience in data analysis, process improvement, and project management\n\n- Strong knowledge of DSD operations, inventory management, and logistics\n\n- Excellent communication, interpersonal, and stakeholder management skills\n\n- Ability to work in a fast-paced environment and adapt to changing priorities\n\n- Proficient in Microsoft Office, data analytics tools, and project management software\n\n\n\n\n\n\n\nNice to Have\n\n\n\n\n\n\n\n- Master's degree in Business Administration, Supply Chain Management, or related field\n\n- Certification in business analysis, supply chain management, or logistics (e.g., CBAP, CSCP, CLTD)\n\n- Experience with technology solutions related to DSD operations, such as transportation\n\nmanagement systems and inventory management software\n\n- Knowledge of data analytics tools, such as Tableau, Power BI, or SQL\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-yucca-scalian-group-yucca-it-solutions-4132270170?position=9&pageNum=50&refId=%2FVyrdZh82hXsETPuNBCAVQ%3D%3D&trackingId=FsGVctcLoIkb76wHqDdq2w%3D%3D"
}