{
    "job_id": "4132435549",
    "title": "Business Analyst",
    "company": "Tech Prescient",
    "location": "Pune, Maharashtra, India",
    "description": "Title - Business Analyst\n\nLocation- Pune\n\nExperience level - 4-5 years\n\nAvailability - Immediate\n\nKey Responsibilities\n\n\nRequirements Gathering: Engage with stakeholders to gather and document business requirements, ensuring a clear understanding of their needs and expectations.\nAnalysis and Evaluation: Analyze existing business processes and systems to identify inefficiencies, gaps, and opportunities for improvement.\nSolution Development: Develop detailed business requirements, use cases, and process flow diagrams to support solution development.\nStakeholder Communication: Act as a liaison between stakeholders and project teams, facilitating effective communication and ensuring alignment on project objectives.\nData Analysis: Utilize data analysis techniques to provide insights and support decision-making processes.\nDocumentation: Create and maintain comprehensive documentation, including business requirements documents, process maps, and user guides.\n\n\nTesting and Validation: Support the testing phase by developing test plans, executing test cases, and ensuring that solutions meet business requirements.\n\n\nProject Support: Assist in project management tasks, such as tracking progress, managing risks, and ensuring timely delivery of project milestones.Qualifications:\nEducation: Bachelor’s degree in Business Administration, Computer Science, Information Technology, or a related field. Relevant certifications (e.g., CBAP, PMI-PBA) are a plus.\nExperience: 4+ years of experience as a Business Analyst or in a similar role.\n\n\nSkills\n\n\nStrong analytical and problem-solving skills.\nProficiency in business analysis tools and methodologies.\nExcellent communication and interpersonal skills.\nAbility to work independently and as part of a team.\nProficiency in data analysis and reporting tools (e.g., Excel, SQL).\nFamiliarity with project management tools and techniques.\n\n\nSkills:- Business Analysis, Requirement Analysis, Business requirements, Stakeholder communications and Documentation\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-tech-prescient-4132435549?position=8&pageNum=57&refId=a19Gt2bufEipNHhOPT%2FEtw%3D%3D&trackingId=iVE0pIsY8UjIWOEFeelJ4g%3D%3D"
}