{
    "job_id": "4132358022",
    "title": "Business Analyst, Amazon Selection Monitoring",
    "company": "Amazon",
    "location": "Chennai, Tamil Nadu, India",
    "description": "Description\n\nWithin the Selection Monitoring team, a Business analyst is expected to own analytics on large volumes of data, synthesize the analysis into business insights, communicate the findings to stakeholders and and deliver business value. Business analyst will be expected to be skilled in understanding customer needs, converting them to analysis requirements, having working knowledge of data availability in various sources, building customer confidence through effective communication and derive recommendations. Business analyst would also be responsible for the project plan, cost and efficiency analytics platform resources, scaling of data processes and reports, and project timeline and deliverables.\n\nKey job responsibilities\n\n\nSolve ambiguous problems with less well-defined inputs and outputs; drive to the heart of the problem and identify root causes\nIdentify, develop and execute data analysis to uncover areas of business opportunities\nLearn and understand the broad range of Amazon’s data resources and develop knowledge of how, when and which data sources to use\nDeep dive into massive data sets to answer key business questions using SQL, MS Excel and other data manipulation languages\nBuild new reports/dashboards to enable emerging business use cases\nPartner with Data Engineering team to deploy new data technology\nPresent written recommendations and insights to key stakeholders that will help shape effective selection expansion strategies worldwide\nManage and execute entire projects or components of large projects from start to finish including project management, data gathering and manipulation, modeling and problem solving\n\n\nAbout The Team\n\nAmazon’s Selection Monitoring team started operations in March 2009 and has grown steadily in scope ever since. Amazon Selection and Catalog Systems group at Amazon Chennai Center focuses on making direct impact on Selection for Amazon’s Retail & 3rd party marketplace business across markets worldwide. The Selection Monitoring team within this group owns end to end processes for discovering, prioritizing and adding new selection available to customers across different markets worldwide. This drives one of Amazon’s core focus areas: providing the widest selection to customers. We operate in a fast paced, rapidly growing environment offering new challenges and opportunities for making impactful changes in the Amazon ecosystem.\n\nBasic Qualifications\n\n\n4+ years of tax, finance or a related analytical field experience\n4+ years of Excel (including VBA, pivot tables, array functions, power pivots, etc.) and data visualization tools such as Tableau experience\nBachelor's degree in finance, accounting, business, economics, engineering , analytics, mathematics, statistics or a related technical or quantitative field\nExperience defining requirements and using data and metrics to draw business insights\nExperience making business recommendations and influencing stakeholders\nExperience with Excel\n3+ years of experience in hands-on analytics: building data pipelines using SQL, reports in Excel, dashboards in tools like QuickSight\nAbility to work effectively & independently in a fast-paced environment with tight deadlines\nAbility to engage with cross-functional teams for implementation of project/program requirements\n\n\nPreferred Qualifications\n\n\nExperience partnering with executive-level leaders to identifying and solving business issues\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI MAA 15 SEZ - K20\n\nJob ID: A2825642\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-amazon-selection-monitoring-at-amazon-4132358022?position=8&pageNum=60&refId=RBk3qTVB%2BCNiFfiLUXOVnA%3D%3D&trackingId=HwdnkP008zoPMMmfi2ifQA%3D%3D"
}