{
    "job_id": "4132355478",
    "title": "Business Analyst, IN S&OP",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nDo you enjoy solving complex business problems, transforming data into information, and using that information to influence business decisions? Are you able to form a picture and tell a story based on what the numbers are saying? Do you have experience joining data sets from disparate sources in order to do so? If so, this opportunity may be for you.\n\nAre you interested in being part of a high visibility, strategic team that directly impacts Amazon worldwide? The IN S&OP team is looking for motivated self-starters that can work in a fast paced, data-driven environment. The successful candidate will be an analytical problem solver, have an extremely high level of customer focus and a passion for process improvement.\n\nAs you launch your career as a Business Analyst at Amazon, you will focus on improving the success within Operations fulfillment by analyzing data, discovering and solving real world problem, and building metrics and business cases to improve the customer's experience.\n\nThe Responsibilities Include, But Not Limited To\n\n\nIdentify and build data sources\nExtract, manipulate, assess, maintain data quality and convert data to facilitate and conduct analysis\n\n\nKey job responsibilities\n\n\nEnable effective decision making by retrieving and aggregating data from multiple sources and compiling it into a digestible and actionable format\nPartnering with other analysts and BI engineers in planning and analytics to build analytical solutions to deliver on business goals\nPropose and implement business metrics for senior management reviews and work with business intelligence and data engineers to design and develop data infrastructure to support business growth\nPerform deep-dives to find the root causes behind variances of key parameters over a given time-period\nHarness data to create business requirements documents and guide actionable technology requests\nCollaborating with cross-functional teams, including finance, supply chain execution, transportation, and others, to identify pain points and opportunities for optimization.\nConducting in-depth analysis and cost-benefit assessments to evaluate the feasibility and impact of potential initiatives.\nProgram manage projects with category teams and drive decision making across cross functional teams and senior leadership acting as a common link between operations and categories.\n\n\nAbout The Team\n\nThe First mile S&OP is responsible for forecasting the volumes on weekly basis for OB, IB, Customer returns, Trans in and Trans out flows (upto 8 weeks). S&OP also owns the demand planning for ES/EF Channel.\n\nOur Forecasting and planning teams work with cross functional collaboration to ensure all possible future external as well as internal factors are taken into consideration while forecasting so that we have the highest accuracy reducing site level churn and increasing efficiency. All flow owners monitors the flow of packages with respect to forecast on daily basis using S&OP deck and take appropriate actions on ground if we see high deviation in volume in comparison to plan which in turn ensure there are no choke points and prevents high backlog on floors which leads to good Customer experience.\n\nBasic Qualifications\n\n\n1+ years of Excel or Tableau (data manipulation, macros, charts and pivot tables) experience\nBachelor's degree or equivalent\nExperience defining requirements and using data and metrics to draw business insights\nExperience creating complex SQL queries joining multiple datasets, ETL DW concepts\nExperience in Excel (macros, index, conditional list, arrays, pivots, lookups)\nExperience scripting for automation (e.g., Python, Perl, Ruby)\nExperience using Python or R for data analysis or statistical tools such as SAS\nExperience using statistical tools such as Minitab\nExperience with reporting and Data Visualization tools such as Quick Sight / Tableau / Power BI or other BI packages\nExperience in project management\n\n\nPreferred Qualifications\n\n\nExperience using very large datasets\nExperience using hard data and metrics to back up assumptions and concepts\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ASSPL - Karnataka\n\nJob ID: A2879110\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-in-s-op-at-amazon-4132355478?position=43&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=Q8674gT0msB%2F%2FPer3ytd2w%3D%3D"
}