{
    "job_id": "4132522063",
    "title": "Business Process Automation Analyst",
    "company": "Workday",
    "location": "Pune, Maharashtra, India",
    "description": "Your work days are brighter here.\n\nAt Workday, it all began with a conversation over breakfast. When our founders met at a sunny California diner, they came up with an idea to revolutionize the enterprise software market. And when we began to rise, one thing that really set us apart was our culture. A culture which was driven by our value of putting our people first. And ever since, the happiness, development, and contribution of every Workmate is central to who we are. Our Workmates believe a healthy employee-centric, collaborative culture is the essential mix of ingredients for success in business. That’s why we look after our people, communities and the planet while still being profitable. Feel encouraged to shine, however that manifests: you don’t need to hide who you are. You can feel the energy and the passion, it's what makes us unique. Inspired to make a brighter work day for all and transform with us to the next stage of our growth journey? Bring your brightest version of you and have a brighter work day here.\n\nAt Workday, we value our candidates’ privacy and data security. Workday will never ask candidates to apply to jobs through websites that are not Workday Careers.\n\nPlease be aware of sites that may ask for you to input your data in connection with a job posting that appears to be from Workday but is not.\n\nIn addition, Workday will never ask candidates to pay a recruiting fee, or pay for consulting or coaching services, in order to apply for a job at Workday.\n\nAbout The Team\n\nIt's fun to work in a company where people truly believe in what they're doing. At Workday, we are committed to bringing passion and customer focus to the business of enterprise applications. We work hard, and we're serious about what we do. But we like to have a good time, too. FUN is one of our core values!\n\nWe are seeking a Business Process Automation Analyst to support the Chief Accounting Officer (CAO) organization in driving operational efficiency and innovation through the use of various automation technologies. This role will focus on optimizing and streamlining accounting processes by leveraging automation tools and technology solutions to reduce manual tasks, improve accuracy, and enhance overall productivity.\n\nThe ideal candidate will have a strong background in business process redesign, requirements gathering, and a deep understanding of accounting principles. You will collaborate closely with accounting teams to analyze existing workflows, identify areas for improvement, and implement solutions using technology-driven programs designed to automate and optimize accounting processes. As a key player in transforming the way the accounting organization operates, you will help create a culture of continuous improvement while delivering solutions that align with business needs.\n\nAbout The Role\n\n\nAnalyze and assess accounting processes to identify inefficiencies and areas for automation using various technologies (e.g., workflow automation tools, data integration platforms, cloud-based systems).\nSupport Payroll, Absence and other accounting teams to gather business requirements, understand pain points, and define automation goals that improve efficiency, accuracy, and timeliness.\nRedesign accounting processes and workflows to incorporate technology-driven automation solutions that align with the company's strategic objectives.\nWork closely with IT teams and technology vendors to design, develop, and implement automation solutions tailored to the needs of the accounting organization.\nDevelop detailed process documentation, user stories, and implementation plans to ensure successful deployment and adoption of automation solutions.\nEnsure all automation solutions comply with accounting standards, internal controls, and relevant regulations (e.g., SOX, GAAP).\nMonitor and evaluate the effectiveness of automated processes, identifying opportunities for further enhancements and process optimization.\nMonitor the performance of automated processes, analyze outcomes, and provide recommendations for continuous improvement. Stay informed on emerging technologies and automation best practices, proposing innovative solutions to further enhance accounting operations.\nDesign and implement metrics and dashboards to track the effectiveness of automation initiatives, monitor process performance, and provide real-time insights to stakeholders. Use data visualization tools (e.g., Tableau, Power BI) to present key performance indicators (KPIs) and drive data-driven decision-making.\nStay up-to-date on emerging technologies and best practices in process automation, recommending innovative solutions to further enhance the accounting organization’s operations.\nCollaborate with accounting teams and business stakeholders to gather and document clear business requirements, ensuring alignment between business needs and technology solutions. Build and maintain strong relationships with stakeholders to ensure successful adoption and implementation of automation initiatives.\n\n\nAbout You\n\nBasic Qualifications:\n\n\n6+ years of experience in business process automation\nExperience in one of the accounting functions like payroll, HCM and or payroll accounting\nProven experience in business process redesign, requirements gathering, and implementing automation technologies within accounting or finance functions.\nStrong technical expertise with accounting systems such as Workday HCM, Payroll, ERP systems (e.g., SAP, Oracle), and other financial platforms.\nExperience with API integrations, data integration tools, and cloud-based systems for connecting accounting systems with other business applications.\nProficiency in metrics, dashboards, and data visualization tools such as Tableau, Power BI, or similar platforms.\nFamiliarity with workflow automation tools (e.g., Microsoft Power Automate, Zapier, Automation Anywhere).\nStrong understanding of accounting standards (e.g., GAAP, SOX compliance), internal controls, and regulatory requirements.\n\n\nOther Qualifications:\n\n\nExcellent communication skills\n\n\nStrong presentation and documentation skills\n\n\nA proven track record of enabling change throughout an organization..\nIntellectual curiosity with a continuous learning and innovation mindset\nExperience with Workday financial system a plus\nExperience with UI Path automation solutions is a plus\n\n\nOur Approach to Flexible Work\n\nWith Flex Work, we’re combining the best of both worlds: in-person time and remote. Our approach enables our teams to deepen connections, maintain a strong community, and do their best work. We know that flexibility can take shape in many ways, so rather than a number of required days in-office each week, we simply spend at least half (50%) of our time each quarter in the office or in the field with our customers, prospects, and partners (depending on role). This means you'll have the freedom to create a flexible schedule that caters to your business, team, and personal needs, while being intentional to make the most of time spent together. Those in our remote \"home office\" roles also have the opportunity to come together in our offices for important moments that matter.\n\nAre you being referred to one of our roles? If so, ask your connection at Workday about our Employee Referral process!\n\n,\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-process-automation-analyst-at-workday-4132522063?position=6&pageNum=60&refId=RBk3qTVB%2BCNiFfiLUXOVnA%3D%3D&trackingId=VZv9ntzMMcjmXMtL%2BuOtgA%3D%3D"
}