{
    "job_id": "4132655364",
    "title": "Architectural Service Management/Business Analyst",
    "company": "FICO",
    "location": "Bengaluru, Karnataka, India",
    "description": "The Opportunity\n\n\n\n\n“FICO’s Product and Technology organization is seeking skillful and experienced Business Analysts to successfully collaborate with various stakeholders, facilitate and ensure daily execution to plan, and timely delivery of foundational platform services. Business Analysts play a critical role on the Architectural Service Management team by synthesizing various requirements and dependencies, facilitating, and ensuring aligned design, development, and delivery based on overarching priorities.” – Senior Director, Architectural Service Management\n\n\n\n\n\n\n\nWhat You’ll Contribute\n\nBusiness Analysts support Architectural Service Management (ASM) in their day-to-day responsibilities to allow them to scale across multiple teams. The Business Analyst will be the primary resource for the engineering teams to support them on dependency management, manage constraints, trade-offs, and impediments to timely deliverables.\nPriority Management: Work closely with ASM on assigning stories and tasks to resources and optimize productivity based on skillsets and availability.\nProductivity: Monitor completion of stories, generate reports, analyse individual, team productivity, and identify productivity issues, identify remedial actions, and work closely with Engineering Manager’s to take actions.\nResource Management: Coordinate with ASM and Engineering Managers on resource and skill set needs based on ASM requirements and target deliverables.\nScrum Management: Facilitate planning and deliverables, support execution, optimize productivity with close monitoring of task completion, sequence of tasks and course correction as needed within Sprints.\nCreate and maintain active and future development plans in well-structured Epic and Stories with good data quality and data-driven Sprint assignments\nCreate, maintain, and communicate reports and summary analysis around priority management, productivity monitoring, resource management, and scrum management\n\n\n\n\n\n\n\nWhat We’re Seeking\n\nBachelor's degree in computer science or related field and/or equivalent experience\nCustomer-driven requirements and technical acumen\nCurious thinking\nClear and concise communication\nBias for action\nPrecise attention to detail\nProductive collaboration\nEffective facilitation\nOpenness to receiving and giving growth-oriented and recognition feedback\nFeedback loop that informs continuous learning and improvement\n\n\n\n\n\n\n\nOur Offer to You\n\nAn inclusive culture strongly reflecting our core values: Act Like an Owner, Delight Our Customers and Earn the Respect of Others.\nThe opportunity to make an impact and develop professionally by leveraging your unique strengths and participating in valuable learning experiences.\nHighly competitive compensation, benefits and rewards programs that encourage you to bring your best every day and be recognized for doing so.\nAn engaging, people-first work environment offering work/life balance, employee resource groups, and social events to promote interaction and camaraderie.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/architectural-service-management-business-analyst-at-fico-4132655364?position=6&pageNum=62&refId=9DAZTOuB47vYA4MZxFKVVA%3D%3D&trackingId=MNUBkLR5y6mWFahh71t65Q%3D%3D"
}