{
    "job_id": "4133378304",
    "title": "Business Analyst ServiceNow",
    "company": "EVERSANA",
    "location": "Pune, Maharashtra, India",
    "description": "THE POSITION:\n\nThis position will be responsible for the analysis of business requirements and process workflows related to the IT service management practices across all IT functions at EVERSANA. Drive process optimization for existing processes and new process development. Play a key role in optimizing and standardizing workflows for IT service management functions. Gather detailed and accurate requirements for system design. The position includes: Review, analyze, and evaluate business process and user needs against system structure. Conduct effective requirement gathering sessions with various stakeholders such as technical, business, and manager roles. Document requirements, define scope and objectives and formulate systems to parallel overall business strategies. Prepare URS, FS, System Change documents, workflow diagrams, functional requirements and technical requirements documents. Perform UAT and testing of new functionality. Deliver demonstrations and training to end-users. Proficiency in IT Service Management practices including incident, request, change, problem, asset, knowledge and release management is critical. The position requires working across geographies and time zones.\n\n\n\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\nOur employees are tasked with delivering excellent business results through the efforts of their teams. These results are achieved by:\n\n Conducting kick off workshops, documenting fit-gap analysis\n\n Prioritizing requirements and create conceptual prototypes and mock-ups\n\n Gathering requirements through conversations, meetings, workshops, chats, or other channels  Performing requirements analysis\n\n Performing data analysis and consolidation of the data using Excel\n\n Documenting and communicating the results of your efforts\n\n Coordinating meeting participants, UAT testers, and technical team members for effective requirements gathering\n\n Optimizing and evaluating process flows and documented workflows  Ensuring solutions meet business needs and requirements and adhere to ITSM standards and best practices  Performing user acceptance testing\n\n Demonstrating a commitment to diversity, equity, and inclusion through continuous development, modeling inclusive behaviors, and proactively managing bias.\n\n All other duties as assigned.\n\n\n\n\nMINIMUM KNOWLEDGE, SKILLS AND ABILITIES:\n\nExperience and/or Training 5+ years of experience in IT Operations or IT Service Management disciplines, 5+ years experience on the ServiceNow platform; data analysis skills and training; process optimization experience and training;\n\n Licenses/Certificates certification in ITIL v4; certification for ServiceNow platform (any will be considered)\n\n Technology/Equipment ServiceNow experience  Competency in Microsoft applications including Work, Excel, Powerpoint, Outlook and Teams.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-servicenow-at-eversana-4133378304?position=8&pageNum=42&refId=xxyg9D9a0iqwhm5TUVsTxQ%3D%3D&trackingId=YFMhlURKxbvzh4axAT1YGQ%3D%3D"
}