{
    "job_id": "4133514575",
    "title": "Business Analyst",
    "company": "Vontier",
    "location": "Bengaluru, Karnataka, India",
    "description": "We are seeking a detail-oriented and proactive Business Analyst to join the Data Analytics team within the Vontier Data & Analytics Hub. This pivotal role involves gathering, documenting, and providing comprehensive solutions for data analytics requirements. The ideal candidate will excel at bridging the gap between business needs and technical implementation, contributing to the successful execution of data-driven projects. Experience in the Manufacturing and Procurement domains will be considered a significant advantage and will enrich our team's expertise.\n\nWhat You Will Do\n\n\nEngage with stakeholders to thoroughly understand business requirements, translating them into actionable data analytics solutions that align with strategic goals.\nConduct in-depth analysis to gather and document detailed business and technical requirements for various data analytics projects, ensuring clarity and precision in all documentation.\nExamine and interpret data to identify actionable trends, patterns, and insights that can drive informed business decisions and strategies.\nCollaborate closely with data engineers and data scientists to ensure the accurate and effective implementation of data solutions that meet business objectives.\nDevelop, update, and maintain comprehensive documentation related to data analytics processes, systems, and procedures, ensuring accessibility and consistency.\nFacilitate seamless communication and coordination between business units and technical teams, fostering a collaborative environment that enhances project outcomes.\nSupport the testing and validation phases of data analytics solutions, ensuring their efficacy and alignment with specified requirements.\nEnsure the highest standards of data quality and integrity across all data analytics initiatives, implementing best practices and continuous improvement measures.\nCreate compelling visualizations and reports to effectively communicate insights to stakeholders, enabling data-driven decision-making processes.\nStay abreast of industry trends, emerging technologies, and best practices in data analytics and business analysis, continuously enhancing your skill set and knowledge base.\nAssist in the development and implementation of data governance policies and procedures to ensure responsible data management and compliance with regulatory standards.\nAct as a liaison between the business and technical teams to ensure alignment and mutual understanding of project goals, timelines, and deliverables.\nProvide training and support to team members and stakeholders on data analytics tools, methodologies, and best practices to promote data literacy and self-service analytics.\n\n\nWho You Are\n\n\nBachelor's degree in business, Computer Science, Information Technology, or a related field, providing a solid foundation for analytical and technical expertise.\nAt least 3 years of experience as a Business Analyst, ideally within the Data Analytics, Manufacturing or Procurement domains, showing a proven record of accomplishment of successful project delivery.\nExceptional analytical and problem-solving skills, with the ability to dissect complex data sets and identify meaningful patterns and insights.\nProficiency in data analysis tools and techniques, including SQL, data visualization tools (e.g., Tableau, Power BI), and statistical software, enabling comprehensive data evaluation and presentation.\nOutstanding written and verbal communication skills, facilitating clear and effective interactions with stakeholders at all levels.\nAbility to work independently while also thriving in a collaborative team environment, demonstrating flexibility and adaptability.\nStrong organizational and project management skills, ensuring timely and efficient completion of tasks and projects.\nKeen attention to detail and a steadfast commitment to maintaining data quality and accuracy in all deliverables.\nKnowledge and experience with Manufacturing and Procurement processes and systems are highly desirable, adding value to our data analytics initiatives.\nExperience with Agile methodology and project management tools such as JIRA, Devops or Trello is required, contributing to efficient and organized project workflows.\nStrong understanding of data governance principles and practices, ensuring compliance with data privacy regulations and maintaining data integrity.\nDemonstrated ability to develop and deliver effective presentations and training sessions to diverse audiences, enhancing data literacy and fostering a culture of data-driven decision-making.\n\n\nWho Is Vontier\n\nVontier (NYSE: VNT) is a global industrial technology company uniting productivity, automation and multi-energy technologies to meet the needs of a rapidly evolving, more connected mobility ecosystem. Leveraging leading market positions, decades of domain expertise and unparalleled portfolio breadth, Vontier enables the way the world moves – delivering smart, safe and sustainable solutions to our customers and the planet. Vontier has a culture of continuous improvement and innovation built upon the foundation of the Vontier Business System and embraced by colleagues worldwide. Additional information about Vontier is available on the Company’s website at www.vontier.com.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-vontier-4133514575?position=2&pageNum=60&refId=RBk3qTVB%2BCNiFfiLUXOVnA%3D%3D&trackingId=7DBCuBb2fOkzgaw4ctfBeQ%3D%3D"
}