{
    "job_id": "4133076458",
    "title": "Looking for immediate joiners in IAM Business Analyst role in Wipro",
    "company": "Wipro",
    "location": "Bengaluru, Karnataka, India",
    "description": "Responsibilities will include:\n\nEnsure robust processes for reporting and effective documentation, governance control and reporting are in place for the project.\nAct as a conduit between the programme team and the business to support the creation of business cases, cost benefit analysis and high-level requirements.\nWork with business and technology owners to define and deliver requirements and priorities.\nContribute to programme wide progress reporting for working and steering groups within IAM and SDI.\nEstablish effective working relationships across other areas including Product Owners, IAM Stakeholders and IT teams.\nWork with Architect and Design colleagues to ensure business outcomes are understood, represented and planned.\nWork closely with the development teams both on and offshore, to ensure the requirements are translated into deliverable increments.\nBuild and maintain strong relationships with stakeholders.\nSupport quality assurance colleagues to validate outcomes and benefits for our stakeholders and customers.\n\nSkills required:\n\n8-12 years of total exp with min 5+ years as BA in IAM Domain\nAs-is – To-Be process mapping and/or design experience.\nExperience within IAM Sailpoint or in the delivery of cyber related projects.\nAbility to conduct workshops, requirements gathering and high supporting documentation.\nExperience of supporting the delivery of significant change across technology, people and process.\nGood understanding of IAM products and controls capabilities and requirements.\nAbility to confidently drive and lead geographically disbursed team and pull them together to achieve common objectives.\nStrong stakeholder engagement and excellent communication skills of both technical and non-technical stakeholders\nPositive team player who can add value throughout the project lifecycle.\nExcellent written and verbal communication and presentation skills.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/looking-for-immediate-joiners-in-iam-business-analyst-role-in-wipro-at-wipro-4133076458?position=44&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=LWwjV%2BtT5dUV52v4DehDrg%3D%3D"
}