{
    "job_id": "4133859826",
    "title": "Business Analyst - LoanIQ",
    "company": "Infosys",
    "location": "Pune, Maharashtra, India",
    "description": "Responsibilities\n\nA day in the life of an Infoscion\n\n\n\n\nAs a Consultant, you will be a key player in the consulting team that helps discover and define the problem statement, evaluates the solution options and makes recommendations. You will create detailed design, Functional architecture, process artifacts, and implement the deployment plan. You will also support knowledge transfer with the objective of providing value-adding consulting solutions that enable our clients to meet the changing needs of the global landscape.\n\n\n\n\nIdeal candidate should have at least 3 years or more of experience in Commercial Lending transformation projects. Additionally should have participated in at least one Loan IQ transformation program and should have worked on Loan IQ version 7.x & above. Should have performed client facing roles and possess excellent communication & documentation skills.\n\n\n\n\nPrimary Skills :\n\n\n\n\nBachelor’s degree or foreign equivalent required from an accredited institution.\n5 + years of experience with IT Transformation projects of which 3 + years of experience in Loan IQ and other Commercial Lending related implementation projects.\nDomain experience in Commercial Lending and correlate functional knowledge with business and operational requirements. Lending / servicing knowledge across all debt products.\nExpertise knowledge in Loan IQ internals, data model and business domain are essential\nProficiency with communicating technical concepts to a senior technical and business audience. Correlate each business requirement in a detailed solution oriented approach to meet business and operational requirements\n\n\n\n\nAdditional Responsibilities:\n\n\n\n\nLoan IQ Business Analyst will act as the Subject Matter Expert (SME) and possess an excellent functional/operational knowledge of the activities performed by the various teams\nExperienced Loan IQ Business Analyst with strong domain knowledge of LIQ product functionality and data model. Candidate will work with Loan IQ Business Analysts to understand business requirements.\nBusiness Analyst should own the translation of these requirements into technical solutions and document those solutions in Functional Specification Designs.\nLoan IQ Business Analyst will interact with business users to help define the business processes as well as gather, analyze, and document business requirements (use cases, flow diagrams, etc.)\nConvert the Functional / Solution design document to Technical Design Document and the same will then be used for development, Code design based on the organization and architectural standards.\nLoan IQ Business Analyst will coordinate for Functional and technical specification documents sign-off with the business and respective stakeholders. Ability to demonstrate and clarify the requirements as part of sign-off process.\nLoan IQ Business Analyst will be involved in thorough test planning and coordination of testing activities across different testing life cycle covering Unit Testing, System Integration Testing and User Acceptance Testing phases.\nProvide business partner application support which includes working with Downstream and upstream application managers, operation and business users, technology and vendor(s) to resolve issues. Work with various stakeholders across program and tech partners to ensure change is implemented smoothly.\nContinuously Liaise with project and program managers to review project time-lines, Risks at the program level, Risk Mitigation strategies, etc. and solutions to meet each project management activities.\nBeing Loan IQ and Commercial Lending domain expert, Support project initiatives for a commercial credit loan accounting and servicing application, Business Proposals for prospect clients and user community clarifications across accounts, Implementation consultation, etc.\nExperience with both traditional Waterfall SDLC and Agile/Lean methodologies.\nMust have strong problem-solving abilities, self-starter, sound team player\nMust have excellent organizational skills and be able to handle multiple tasks to meet tight deadlines\nStrong ability to communicate effectively and influence decisions to achieve results\nProvide suitable documentation for Business-as-usual reference across different support levels (L1, L2 and L3). Thorough understanding and execution of support model with excellent triage and problem solving ability.\n\n\n\n\n\n\n\n* Location of posting subject to change\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-loaniq-at-infosys-4133859826?position=5&pageNum=5&refId=lj%2BaylP9Zxb0xcLPbmF98Q%3D%3D&trackingId=JnAd7B6OTt6KAVe8SzCRkA%3D%3D"
}