{
    "job_id": "4133859961",
    "title": "Business Analyst",
    "company": "Tata Consultancy Services",
    "location": "Greater Bengaluru Area",
    "description": "TCS is Hiring!!\n\nJob Role: Business Analyst\n\nExperience:5+yrs\n\nLocation: Bangalore, Chennai\n\nJob Description:\n\nRequirements:\n\n• The candidate must be a self-starter, who can work under general guidelines in a fast-spaced environment.\n\n• Overall minimum of 3 to 4 years of experience in Banking Domain, wholesale banking product knowledge and experience preferred.\n\n• Possess good proficiency in Data Model design with respect to conceptual, logical & physical models.\n\n• Ability to clearly communicate complex technical ideas regardless of the technical capacity of the audience.\n\n• Ability to understand business problems/needs and translate into sustainable data model design / solution.\n\n• Good presentation, documentation skills, interpersonal skills, and communication skills\n\n• Work closely with developers and testers to support the development and testing process.\n\n• Collaborate with various teams and stakeholders to meet business needs.\n\n\n\n\nRole Specific:\n\n• Should have experience in working in Banking domain ; Sound understanding of Banking Regulations like Basel is value added.\n\n• Proficient in SQL\n\n• Responsible for capturing, elaborating business requirements & real-time analytics use cases in the journey, customer campaign and real-time analytics and translate them into user stories and functional design.\n\n• Engage and Elicit business requirements from stakeholders in a challenging environment.\n\n• Documenting the process/data flows & data mapping, processing, and validation rules for use cases\n\n• Work with program/project managers, product owners, and other team members in providing clarity of requirements and how it relates to the business objectives.\n\nTechnical Skills:\n\n- Techno Functional Business Analyst in Banking Domain\n\n- Excellent Knowledge & Understanding Oracle & SQL.\n\n- Add advantage of knowing Phyton/ Hive / ADO\n\n- Flair for learning new tools & technology.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-tata-consultancy-services-4133859961?position=47&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=e9WOCZEjaeJSDpkxzvauzQ%3D%3D"
}