{
    "job_id": "4133954933",
    "title": "BA - Capital Market",
    "company": "Capco",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Title: Business Analyst- Capital Market/IB Domain\n\nAbout Us\n\n“Capco, a Wipro company, is a global technology and management consulting firm. Awarded with Consultancy of the year in the British Bank Award and has been ranked Top 100 Best Companies for Women in India 2022 by Avtar & Seramount. With our presence across 32 cities across globe, we support 100+ clients across banking, financial and Energy sectors. We are recognized for our deep transformation execution and delivery.\n\nWHY JOIN CAPCO?\n\nYou will work on engaging projects with the largest international and local banks, insurance companies, payment service providers and other key players in the industry. The projects that will transform the financial services industry.\n\nMAKE AN IMPACT\n\nInnovative thinking, delivery excellence and thought leadership to help our clients transform their business. Together with our clients and industry partners, we deliver disruptive work that is changing energy and financial services.\n\n#BEYOURSELFATWORK\n\nCapco has a tolerant, open culture that values diversity, inclusivity, and creativity.\n\nCAREER ADVANCEMENT\n\nWith no forced hierarchy at Capco, everyone has the opportunity to grow as we grow, taking their career into their own hands.\n\nDIVERSITY & INCLUSION\n\nWe believe that diversity of people and perspective gives us a competitive advantage.\n\nLocation - Mumbai & Bangalore\n\nYears of Expn - 5 to 8 Years\n\nRole Description\n\n\nAbility to operate in both agile and waterfall style project methodologies and have an understanding of deliverables required for each methodology\nSound understanding of trade lifecycle, global regulations and trading/investment banking processes\nResponsible for project stakeholder management\nProven experience as Business Analyst with an Investment bank\nWork with project manager and business sponsors to scope and analyse the area of analysis\nInterface with business users on functional issues to analyse and define business and functional requirements\nLead business requirement gathering session and document requirements to create business\nrequirement specification document\nExcellent Communication, Organization and Documentation Skills\nDefine testing objectives and liaise with testing teams\nCapital markets BA\nTrade Lifecycle\nGood understanding of financial products\n\n\nDomain And Business Knowledge\n\n\nProcess change experience – Agile methodology (Mandatory) and tools\nDomain experience across key business areas – Trade Life cycle, SDLC, Trade Processing, Regulatory Reporting, Collateral Management, Derivatives Operations – at least one\nCritical thinking and ability to anticipate issues & plan stakeholder elicitation sessions\nRelated industry & product knowledge\nOther Skills: Communication, Data Analysis, Presentation, Process Development, MS Office. Mastery, Issue Based Problem Solving, Root Cause Analysis, Business Case, Estimation, Scoping\n\n\nIf you are keen to join us, you will be part of an organization that values your contributions, recognizes your potential, and provides ample opportunities for growth. For more information, visit www.capco.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/ba-capital-market-at-capco-4133954933?position=3&pageNum=92&refId=Cg5sPd6Nkk2JaEAHs4OCRg%3D%3D&trackingId=Mt%2BpmYy88ZpoGAsq80QA8Q%3D%3D"
}