{
    "job_id": "4134873442",
    "title": "Data Scientist",
    "company": "Indian School of Business",
    "location": "Hyderabad, Telangana, India",
    "description": "Job Purpose -\n\nUnderstand Business Processes & Data, Model the requirements to create Analytics Solutions\n\nBuild Predictive Models & Recommendation Engines using state-of-the-art Machine Learning Techniques to aid Business Processes increase efficiency and effectiveness in their outcomes.\n\nChurn and Analyze the data to discover actionable insights & patterns for Business use.\n\nAssist the Function Head in Data Preparation & Modelling Tasks as required\n\n\n\n\nJobOutline -\n\n\n\n\nCollaborate with Business and IT teams for understanding and collecting data.\nCollect, collate, clean, process and transform large volume(s) of primarily Tabular data (Blend of Numerical, Categorical & some Text).\nApply Data Preparation Techniques like Data Filtering, Joining, Cleaning, Missing Value imputation, Feature Extraction, Feature Engineering, Feature Selection, Dimensionality Reduction, Feature Scaling, Variable Transformation etc\nApply as required: basic Algorithms like Linear Regression, Logistic Regression, ANOVA, KNN, Clustering (K-Means, Density, Hierarchical etc), SVM, Naïve Bayes, Decision Trees, Principal Components, Association Rule Mining etc.\nApply as required: Ensemble Modeling algorithms like Bagging (Random Forest), Boosting (GBM, LGBM, XGBoost, CatBoost), Time-Series Modelling and other state-of-the-art Algorithms.\nApply as required: Modelling concepts like Hyperparameter Optimization, Feature Selection, Stacking, Blending, K-Fold Cross-Validation, Bias & Variance, Overfitting etc\nBuild Predictive Models using state-of-the-art Machine Learning techniques for Regression, Classification, Clustering, Recommendation Engines etc\nPerform Advance Analytics of the Business Data to find hidden patterns & insights, explanatory causes, and make strategic business recommendations based on the same\n\n\n\n\nKnowledge /Education\n\nBE /B. Tech – Any Stream\n\nSkills\n\nShould have strong expertise in Python libraries like Pandas & Scikit Learn along with ability to code according to requirements stated in the Job Outline above\nExperience of Python Editors like PyCharm and/or Jupyter Notebooks (or other editors) is a must.\nAbility to organize the code into Modules, Functions and/or Objects is a must\nKnowledge of using ChatGPT for ML will be preferred.\nFamiliarity with basic SQL for Querying & Excel for Data Analysis is a must.\nShould understand basics of Statistics like Distributions, Hypothesis Testing, Sampling Techniques etc\n\nWork Experience\n\nHave an experience of at least 4 years of solving Business Problems through Data Analytics, Data Science and Modelling. Should have experience as a full-time Data Scientist for at least 2 years.\nExperience of at least 3 Projects in ML Model building, which were used in Production by Business or other clients\n\n\n\n\nSkills/Experience Preferred but not compulsory -\n\nFamiliarity with using ChatGPT, LLMs, Out-of-the Box Models etc for Data Preparation & Model building\nKaggle experience.\nFamiliarity with R.\n\n\n\n\nJob Interface/Relationships:\n\nInternal\n\nWork with different Business Teams to build Predictive Models for them\n\nExternal\n\nNone\n\n\n\n\nKey Responsibilities and % Time Spent\n\nData Preparation for Modelling - Data Extraction, Cleaning, Joining & Transformation - 35%\n\nBuild ML/AI Models for various Business Requirements - 35%\n\nPerform Custom Analytics for providing actionable insights to the Business - 20%\n\nAssist the Function Head in Data Preparation & Modelling Tasks as required - 10%\n\n\n\n\nAny other additional Input -\n\n\n\n\nWill not be considered for selection:\n\nFamiliarity with\n\nDeep Learning Algorithms Image Processing & Classification\nText Modelling using NLP Techniques\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-indian-school-of-business-4134873442?position=6&pageNum=10&refId=3OwYoZiMWUBkemlaz%2FA01Q%3D%3D&trackingId=if3m99B5AIDMn5afODs54A%3D%3D"
}