{
    "job_id": "4134990404",
    "title": "Business Analyst",
    "company": "Kotak Life",
    "location": "Mumbai, Maharashtra, India",
    "description": "Role: UAT Manager\n\nJob Title: Senior Manager / Chief Manager\n\nWork Experience: 5 years +\n\nEducation: BE / B.Sc / MCA\n\nDepartment: SPDT\n\nWork location: Goregaon (East), Mumbai\n\n\n\n\nThis role acts an interface between Business/Operations and Technology vendors to drive the resolutions on new products, defects and change request or new functionality, help business/Operations implement technology solutions in a cost-effective way by determining the requirements of a project or program, and communicating them clearly to stakeholders, facilitators and partners: Business case, CBA, requirement gathering, assistance in UAT, implementation, Project Management.\n\n\n\n\nKey responsibilities\n\n· Understanding business’ change needs, assessing the business impact of those changes, capturing, analysing and documenting requirements and supporting the communication and delivery of requirements with relevant stakeholders.\n\n· Requirement gathering from Ops, Sales, Legal & Compliance, which clearly state the business needs and align with business processes.\n\n· Preparation of Business Requirement documents and test cases\n\n· Translating business requirement into product/process/system specification.\n\n· Liaison with other colleagues in IT to collectively fulfil the system delivery responsibilities on project, that have cross-functional inter-linkages\n\n· Implementation of new releases and automation of existing applications\n\n· Perform UAT and obtaining sign off from stakeholders for movement to Pre-Production and Production environments of relevant systems/applications\n\n· Interface between Business and Technology vendors to drive the resolutions on new products, defects and change request or new functionality\n\n· Good interpersonal and communication skills with ability to build productive relationships across the participants in the system\n\n· Creating a process oriented culture by standardizing processes and documenting the same by way of standard operating procedures\n\n· Regular update to stakeholder and senior management on projects\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-kotak-life-4134990404?position=6&pageNum=2&refId=dmyDsuYITNpOArSK52WyDg%3D%3D&trackingId=Iq7wOxoGqmHYLxeGrEPy6A%3D%3D"
}