{
    "job_id": "4134517193",
    "title": "Senior Business Analyst",
    "company": "Ciklum",
    "location": "Chennai, Tamil Nadu, India",
    "description": "Ciklum is looking for a Senior Business Analyst to join our team full-time in India.\n\n\n\n\nWe are a custom product engineering company that supports both multinational organizations and scaling startups to solve their most complex business challenges. With a global team of over 4,000 highly skilled developers, consultants, analysts and product owners, we engineer technology that redefines industries and shapes the way people live.\n\n\n\n\nAbout the role:\n\nAs a Senior Business Analyst, become a part of a cross-functional development team engineering experiences of tomorrow.\n\n\n\n\nYou will collaborate with architects, data analysts, digital analysts, product owners, software developers, technology leads and UX/UI designers to clearly define, document and communicate requirements that will enable implementation of new changes and enhancements to our digital platforms in an agile manner. Working alongside a varied set of technology and business stakeholders, you define and document new business, user, and system requirements, considering impacts to upstream/downstream services. You manage the requirement lifecycle from planning through to elicitation, testing, delivery, and business acceptance. You can provide business analysis to multiple agile delivery teams and work closely with the product owner and technology leads to prioritize and manage complex backlogs.\n\n\n\n\nClient for this project is a leading global provider of audit and assurance, consulting, financial advisory, risk advisory, tax, and related services. They are launching a digital transformation project to evaluate existing technology across the tax lifecycle and determine the best future state for that technology. This will include decomposing existing assets to determine functionality, assessment of those functionalities to determine the appropriate end state and building of new technologies to replace those functionalities.\n\n\n\n\nResponsibilities:\n\nEnsure stakeholders' engagement and effective collaboration\nPlan, estimate, and perform Business Analysis activities within all SDLC stages\nDefine business needs and objectives\nDefine the most applicable elicitation approach and use appropriate techniques and ensure effective usage of techniques\nWork with all requirements types throughout the whole life cycle: from the idea to the acceptance and maintenance. Ensure requirements quality on the project\nModel requirements by using the most applicable notation according to the project needs\nDefine Information Architecture for project documentation within the project\nDefine or contribute to the solution roadmap definition\nDefine and manage the solution scope to avoid scope creep\nManage the backlog: from the definition of \"how\" to its execution, perform backlog prioritization and refinement\nDefine Change management procedure\nCollaborate closely with the development team\nEnsure requirements quality on the project\nFacilitate Agile ceremonies according to the chosen development methodology and ensure their effectiveness\nDefine Business Analysis approaches and processes from scratch and implement ongoing improvements to the existing ones\n\n\n\n\nRequirements:\n\nWe know that sometimes, you can’t tick every box. We would still love to hear from you if you think you’re a good fit!\nProven ability to work with different groups of stakeholders along with experience in setting up stakeholder management approach\nComprehensive experience in setting up Business Analysis processes and approaches (in elicitation, decomposition, modeling, documentation, traceability, prioritization, and change management)\nVast experience in setting up requirements life cycle management\nHigh proficiency in requirements documentation, its structure definition, and templates creation\nSolid experience in UML and BPMN modeling (and ability to adjust modeling approach according to the project context)\nAdvanced knowledge of how to manage a solution roadmap and experience in its definition (or contribution, at least)\nExpertise in product scope management and backlog management\nSolid knowledge of Business analysis techniques and best practices\nExperienced and flexible Agile practitioner focused on delivering value\nCommunication is a key. You speak and write in English fluently or at least at an upper-intermediate level\nAble to express ideas, thoughts, and questions simply, concisely, and in a structured way\nAccountable for the own scope of work and follow the \"said and done\" principle\nEager to learn and grow: curios, keen to constant self-development\nProactive in efforts to deliver results according to expectations, as well as keen to suggest new ideas, looking for alternative solutions\nCapable of assessing tasks of less experienced colleagues and providing constructive feedback\n\n\n\n\nDesirable:\n\nExperience in Pre-sales, Discovery phases: having ownership of BA tasks\nTechnical knowledge and skills:\nSolid knowledge of major architectural types\nPractical experience in working with main database types and writing queries\n\n\n\n\nWhat`s in it for you?\n\nCare: your mental and physical health is our priority. We ensure comprehensive company-paid medical insurance, as well as financial and legal consultation\nTailored education path: boost your skills and knowledge with our regular internal events (meetups, conferences, workshops), Udemy licence, language courses and company-paid certifications\nGrowth environment: share your experience and level up your expertise with a community of skilled professionals, locally and globally\nFlexibility: hybrid work mode at Chennai or Pune\nOpportunities: we value our specialists and always find the best options for them. Our Resourcing Team helps change a project if needed to help you grow, excel professionally and fulfil your potential\nGlobal impact: work on large-scale projects that redefine industries with international and fast-growing clients\nWelcoming environment: feel empowered with a friendly team, open-door policy, informal atmosphere within the company and regular team-building events\n\n\n\n\nAbout us:\n\nIndia is a strategic growth market for Ciklum.\n\nBe a part of a big story created right now. Let’s grow our delivery center in India together! Boost your skills and knowledge: create and innovate with like-minded professionals — all of that within a global company with a local spirit and start-up soul.\n\nSupported by Recognize Partners and expanding globally, we will engineer the experiences of tomorrow!\n\n\n\n\nBe bold, not bored!\n\n\n\n\nInterested already? We would love to get to know you! Submit your application. We can’t wait to see you at Ciklum.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-ciklum-4134517193?position=2&pageNum=87&refId=KM8cdGPQyPT7yvIRKZCULw%3D%3D&trackingId=KY78wktjFcfcxG1uqC1GrA%3D%3D"
}