{
    "job_id": "4135641326",
    "title": "Technical Business Analyst",
    "company": "VOIS",
    "location": "Pune, Maharashtra, India",
    "description": "Role title: Business Analyst (Data Analytics)\n\n\n\n\nRole purpose:\n\n\n\n\nWorking for the Business Intelligence area requires a good understanding of the business context and the business requirements.\nA business analyst is an extremely critical role that plays the role of pivot between business and solutions provided to the business to help them take critical decisions.\nHe/she should have experience in requirements engineering, specifically the challenge and validation of data capability and reporting requirements.\nHe/she should have experience in telecom environment, with exposure to Strategic/analytics roles.\n\n\n\n\nCore competencies, knowledge, and experience :\n\nEssential:\n\nGood in requirement elicitation\nGood telecom knowledge\nGood technical knowledge\nGood communication.\nAble to manage priorities and stakeholders.\n\nExperience:\n\nThis position requires strong knowledge on BI and Data Warehousing and working knowledge on databases like Teradata/Oracle.\nStrong exposure to data analysis, gap analysis, data profiling, clearly documenting requirements, good knowledge on Business Analysis life cycle with very strong and clear communication skills.\nCandidate should have experience in Agile Projects preferably in SAFe methodology.\n\n\n\n\nMust have technical / professional qualifications:\n\n\n\n\nGood experiences in:\n\nExperienced in requirements engineering, specifically the challenge and validation of data capability and reporting requirements.\nKnowledge on basics of DWH and exposure to BI projects\nBasics of RDBMS with knowledge of SQL.\nSQL, especially Teradata, Wherescape and ETL tool\nExperienced in requirements analysis, specifically the challenge and validation of data capability and reporting requirements.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/technical-business-analyst-at-vois-4135641326?position=4&pageNum=32&refId=VFsnRMMnT7hGO1gnBq9n6A%3D%3D&trackingId=0cHCFJA9fflV%2FV2itF60lQ%3D%3D"
}