{
    "job_id": "4136153958",
    "title": "Business Process Analyst",
    "company": "Eaton",
    "location": "Pune, Maharashtra, India",
    "description": "What You’ll Do\n\nThis role supports and collaborates with the process owners to map and model the current processes, monitor and evaluate the efficiency and effectiveness through the definition of proper KPIs and helps them to identify the opportunities for improvements. Collaborate with the analytics function to develop a set of visual controls and reports to help process owners to take data informed decisions.\n\n\nProcess discovery and modeling\nCollaborate with process owners and domain experts to gather all the necessary information about how the current process works through the analysis of existing documentation and interviews. Organize and abstract the pieces of information into a consistent model represented according BPMN2.0 standard. Utilize standard notation: SOPs and SWIs\nProcess analysis\nSupport process owners both with qualitative process analysis (e.g. value-added, waste, RCA) and quantitative analysis (e.g. cycle time calculation, efficiency, capacity). Understand and identify areas of possible improvements.\nProcess redesign\nSupport process owners in the implementation of improvement measures in term of process output, time efficiency, execution cost, etc.\nProcess monitoring\nMonitor the effectiveness of implemented process changes, measure KPIs and identify the necessary adjustments for continuous improvement. Support the development and maintenance of a suitable set of visual controls and reports to provide to process owners all the elements to take data informed decisions\nProcess improvement\nSupport business process owners with how to run Gemba Walks and use other key tools within Eaton's continuous improvement system such as fishbone analysis; pareteo analysis, 5 Whys and other Lean problem-solving methodologies.\n\n\n\nQualifications\n\n\nMinimum bachelor level degree with postgraduate qualification in engineering, Software/IT. CI or related field preferred\n2-6 years in Business Process Analysis\n\n\n\nSkills\n\n\nLEAN Six Sigma / Value Stream Mapping / Continuous Improvement Frameworks. Business process analysis and modeling (BPMN2.0). Systems such as Miro, Lucid Charts, Visio, Power BI and Signavio that support business process management\nExperience in Alation\nAnalytical mindset, collaborative team player, ability to influence above and amongst peers.\nOpen to change. Capability to empathize with people, ability in change management.\nAbility to organize various information in a consistent organic view. Attention to details and quality.\nProactive behaviors to look for new and alternative solution to opportunities for improvement.\nAbility to deal with ambiguity and in scarceness of data.\n\n\n\n]]>\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-process-analyst-at-eaton-4136153958?position=2&pageNum=40&refId=EgsHbWy8%2FUnqSRbzGFEs%2Fw%3D%3D&trackingId=8mCFnItYgKrgNmbmq7%2Fj6w%3D%3D"
}