{
    "job_id": "4136150460",
    "title": "BA - Mumbai",
    "company": "PW (PhysicsWallah)",
    "location": "Mumbai Metropolitan Region",
    "description": "Group Company: Physics Wallah\n\nDesignation: Associate\n\nOffice Location: Branch Office - Mumbai - MH Mumbai (Branch Office - HO - Noida and Pegasus)\n\nJob Summary\n\nThe Business Analyst will act as a bridge between business stakeholders and technical teams to understand business needs, analyze processes, and provide data-driven solutions. The ideal candidate will have strong analytical skills, excellent communication abilities, and experience in gathering and translating requirements into actionable deliverables.\n\nKey Responsibilities\n\n\nRequirements Gathering and Analysis:\nCollaborate with stakeholders to elicit, document, and prioritize business and functional requirements.\nAnalyze current processes and workflows to identify areas of improvement.\nProcess Improvement:\nEvaluate existing systems and recommend optimized solutions to enhance business efficiency.\nDesign and document new workflows, processes, and system enhancements.\nStakeholder Management:\nAct as a liaison between business stakeholders, technical teams, and vendors.\nFacilitate workshops, meetings, and presentations to align objectives.\nData Analysis and Reporting:\nAnalyze data to identify trends, insights, and potential risks.\nDevelop reports, dashboards, and visualizations to communicate findings.\nProject Support:\nSupport project management efforts, including timelines, milestones, and resource allocation.\nEnsure deliverables meet business requirements and quality standards.\nDocumentation:\nPrepare detailed documentation, including business requirements documents (BRDs), functional specifications, and user stories.\nMaintain up-to-date documentation throughout the project lifecycle.\n\nQualifications\n\nEducation:\n\n\nBachelor’s degree in Business Administration, Information Technology, or a related field.\n\n\nExperience:\n\n\n2–5 years of experience as a Business Analyst or in a similar role.\nProven experience in requirements gathering, process improvement, and stakeholder management.\n\n\nSkills:\n\n\nStrong analytical and problem-solving skills.\nExcellent verbal and written communication abilities.\nProficiency in tools such as Microsoft Excel, PowerPoint, Visio, Jira, or other project management and data visualization tools.\nFamiliarity with methodologies like Agile, Scrum, or Waterfall.\n\n\nPreferred:\n\n\nExperience in [insert industry, e.g., finance, healthcare, retail].\nKnowledge of data analysis tools (e.g., SQL, Tableau, Power BI).\nCertification in Business Analysis (e.g., CBAP, CCBA, or PMI-PBA).\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/ba-mumbai-at-pw-physicswallah-4136150460?position=5&pageNum=27&refId=qUEK%2BRRfTlwms%2BZrzTuWbg%3D%3D&trackingId=ZKz6NkrWvAt12mhi1PRsaA%3D%3D"
}