{
    "job_id": "4136086937",
    "title": "Business Analyst",
    "company": "Capco",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Title:\n\nIntraday Liquidity SME/BA\n\n\n\n\nAbout Us\n\n“Capco, a Wipro company, is a global technology and management consulting firm. Awarded with Consultancy of the year in the British Bank Award and has been ranked Top 100 Best Companies for Women in India 2022 by Avtar & Seramount. With our presence across 32 cities across globe, we support 100+ clients across banking, financial and Energy sectors. We are recognized for our deep transformation execution and delivery.\n\nWHY JOIN CAPCO?\n\nYou will work on engaging projects with the largest international and local banks, insurance companies, payment service providers and other key players in the industry. The projects that will transform the financial services industry.\n\nMAKE AN IMPACT\n\nInnovative thinking, delivery excellence and thought leadership to help our clients transform their business. Together with our clients and industry partners, we deliver disruptive work that is changing energy and financial services.\n\n#BEYOURSELFATWORK\n\nCapco has a tolerant, open culture that values diversity, inclusivity, and creativity.\n\nCAREER ADVANCEMENT\n\nWith no forced hierarchy at Capco, everyone has the opportunity to grow as we grow, taking their career into their own hands.\n\nDIVERSITY & INCLUSION\n\nWe believe that diversity of people and perspective gives us a competitive advantage.\n\nMAKE AN IMPACT\n\nJob Title:\n\nJD:\n\nExperience: 7+ Years\n\nLocation: Bengaluru, Mumbai, Hyderabad, Chennai and Pune\n\n\n\n\nCandidate should be well versed with Treasury and Business Analyst.\nWe need candidate should have test management experience.\nShould have the ability to produce test matrix and management reporting associated with testing.\nAbility and experience to interface very senior stakeholders likes of Program Director or Sr Team\nCommunication skills matter a lot for this role because of the stakeholder visibility.\nTreasury domain experience Sr level.\n\n\n\n\nStrong Experience in Group Treasury including the below\n\n- BCBS 239 Regulatory Standards hands-on experience\n\n- Cash Forecasting Automation Experience hands on experience\n\n- ISIP (Systemically Identified Payments) program hands on experience\n\n- Hands on Experience on ILAAP (Internal Liquidity Assessment and Analysis Program)\n\nStrong Ability to interface with Senior Stakeholders (i.e. Managing Director)\n\nRegulatory Reporting hands on Experience (not knowledge)\n\n- Strong hands-on experience on Treasury Regulatory reporting experience (particularly with PRA)\n\n- Strong hands-on experience in implementing regulatory implementation from techno-functional stand point\n\n- Strong hands-on experience on statement of policy with regulators\n\nStrong Domain hands on experience Mandatory (not knowledge)\n\n- Hands on experience on all treasury product lines that work with front office.\n\nTest Management Experience from user experience standpoint (hands on experience not knowledge)\n\n- Ability to manage the entire test life cycle from Treasury Experience\n\n- Work with Treasury Users to understand their issues in testing from Treasury business perspective\n\n- Ability solve treasury business issues including all product lines.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-capco-4136086937?position=3&pageNum=45&refId=UbUFWb7IHPllL5XcmhINQg%3D%3D&trackingId=WvipyqEOBi7yQEKI2%2BGdJQ%3D%3D"
}