{
    "job_id": "4136454264",
    "title": "Lead Machine Learning Engineer",
    "company": "Razorpay",
    "location": "Bengaluru, Karnataka, India",
    "description": "The Role:\n\n\n\n\nWe are looking for an enthusiastic Lead Machine Learning Engineer to join our growing team. The hire will be responsible for working in collaboration with other data scientists and engineers across the organization to develop production-quality models for a variety of problems across Razorpay. Some possible problems include : making recommendations to merchants from Razorpay’s suite of products, cost optimisation of transactions for merchants, automatic address disambiguation / correction to enable tracking customer purchases using advanced natural language processing techniques, computer vision techniques for auto-verifications, running large-scale bandit experiments to optimize Razorpay’s merchant facing web pages at scale, and many more. In addition to this, we expect the MLE to be adept at productionising ML models using state-of-the-art systems.\n\n\n\n\nAs part of the DS team @ Razorpay, you’ll work with some of the smartest engineers/architects/data scientists/product leaders in the industry and have the opportunity to solve complex and critical problems for Razorpay. As a Senior MLE, you will also have the opportunity to partner with and be mentored by senior engineers across the organization and lay the foundation for a world-class DS team here at Razorpay.\n\nYou come and work with the right attitude, fun and growth guaranteed!\n\n\n\n\nRoles & Responsibilities:\n\n\n\n\n6+ years of experience doing ML in a production environment and productionising ML models at scale\nBachelors (required) or Masters in a quantitative field such as Computer science, operations research, statistics, mathematics, physics\nFamiliarity with basic machine learning techniques : regression, classification, clustering, model metrics and performance (AUC, ROC, precision, recall and their various flavors)\nBasic knowledge of advanced machine learning techniques : regression, clustering, recommender systems, ranking systems and neural networks\nExpertise in coding in python and good knowledge of at least one language from C, C++, Java and at least one scripting language (perl, shell commands)\nExperience with big data tools like Spark and experience working with Databricks / DataRobots\nExperience with AWS’ suite of tools for production-quality ML work, or alternatively familiarity with Microsoft Azure / GCP\nExperience deploying complex ML algorithms to production in collaboration with engineers using Flask, MLFlow, Seldon, etc.\n\nGood to have:\n\n\n\n\nExcellent communication skills and ability to keep stakeholders informed of progress / blockers\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/lead-machine-learning-engineer-at-razorpay-4136454264?position=6&pageNum=15&refId=YOJOA8ecJcY65rMZmx6Etg%3D%3D&trackingId=uWtAfPUmwXEauA6GhNiecw%3D%3D"
}