{
    "job_id": "4136508577",
    "title": "Business Analyst",
    "company": "Infineon Technologies",
    "location": "Bengaluru East, Karnataka, India",
    "description": "Are you a Business Analyst with a passion for driving growth through innovative digital solutions and would like to make an impact? Our Power & Sensor Systems (PSS) Division is seeking you for our Indian branch of our divisional Digitalization department, responsible for designing and implementing future state business processes enhanced by digital, AI-powered solutions that revolutionize the way how we work. As one of the first members in this new team, you will have the unique opportunity to support recruitment, and onboard, and mentor young talents. Furthermore, you will drive the design of groundbreaking digital solutions in close collaboration with our headquarter and corresponding engineers who will oversee technical delivery. You will leverage the latest business analysis techniques and your know-how on digital trends to create solutions that enhance customer experience, improve operational efficiency and business processes, and drive sustainable profitable growth. If you're excited about joining this new team and making a significant impact in the digital space, we invite you to apply!\n\nJob Description\n\nIn your new role you will:\n\n\nBusiness process analysis & architecture: analyze current business processes, define future state processes with internal customers, and derive actionable requirements for digital solutions that align with customer needs, organizational goals and an overarching business (process) architecture.\nProject management: drive development and implementation of digitalization use cases, so that they are delivered on time, with high quality and within budget, by effectively managing project timelines and interdependencies with other organizations.\nSolution ownership & portfolio management: sustain and monitor your processes and applications and ensure effective usage through trainings and change management activities.\nStakeholder collaboration: act as main point of contact for your project counterparts from business and other central departments, collect requirements an\n\n\nYour Profile\n\nYou are best equipped for this task if you have:\n\n\nA degree in Information Technology, Engineering, Business, Management or a related field of study\nMore than 3 years of relevant work experience in consulting or a corporate function driving digitalization and transformation, especially with customer facing responsibilities\nGood understanding of digital solutions, business process & process architecture\nGreat business acumen, enabling detailed gathering and documentation of business needs and their translation in clear and actionable requirements for development.\nHands-on experience in process mapping (e.g., VSM), and process improvement, experience in lean management is a clear plus.\nProficiency in (agile)\n\n\nContact:\n\nShavin.Shashidhar@infineon.com\n\n#WeAreIn for driving decarbonization and digitalization.\n\nAs a global leader in semiconductor solutions in power systems and IoT, Infineon enables game-changing solutions for green and efficient energy, clean and safe mobility, as well as smart and secure IoT. Together, we drive innovation and customer success, while caring for our people and empowering them to reach ambitious goals. Be a part of making life easier, safer and greener.\n\nAre you in?\n\nWe are on a journey to create the best Infineon for everyone.\n\nThis means we embrace diversity and inclusion and welcome everyone for who they are. At Infineon, we offer a working environment characterized by trust, openness, respect and tolerance and are committed to give all applicants and employees equal opportunities. We base our recruiting decisions on the applicant´s experience and skills.\n\nPlease let your recruiter know if they need to pay special attention to something\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-infineon-technologies-4136508577?position=3&pageNum=42&refId=xxyg9D9a0iqwhm5TUVsTxQ%3D%3D&trackingId=Cpra6gvb5mawo20Op3VxIw%3D%3D"
}