{
    "job_id": "4136771847",
    "title": "Compliance Business Analyst",
    "company": "Franklin Templeton India",
    "location": "Hyderabad, Telangana, India",
    "description": "At Franklin Templeton, we’re driving our industry forward by developing new and innovative ways to help our clients achieve their investment goals. Our dynamic and diversified firm spans asset management, wealth management, and fintech, offering many ways to help investors make progress toward their goals. Our talented teams working around the globe bring expertise that’s both broad and unique. From our welcoming, inclusive, and flexible culture to our global and diverse business, we offer opportunities not only to help you reach your potential but also to contribute to our clients’ achievements.\n\nCome join us in delivering better outcomes for our clients around the world!\n\nWhat is the Compliance Business Analyst in the Investment Compliance group responsible for?\n\n\nThis role would require the Analyst to assist on Pre-Trade/Batch Compliance, Client Certifications and other tasks involving review, research and analysis. The analyst would monitor compliance with investment restrictions stipulated by a variety of sources including but not limited to Franklin Templeton Internal Policies, fund documentation, client account guidelines, and regulatory requirements. Onboard new clients for the Investment Compliance Team by comprehending their investment objectives, interpreting their mandates, encoding, verifying the restrictions, and reporting any discrepancies. Maintain the restricted securities list at the security/issuer level to ensure compliance with trading restrictions put in place by clients or portfolio managers. Routine audits will also be performed to ensure the integrity of electronic archives, analyst assignments, as well as various forms of information retention. Additionally, the position will involve different forms of data maintenance specific to account status tracking, correspondence filing as well as involvement in the administration of the department’s virtual information repository. The position would also require the analyst to have a good understanding of complex securities, fixed income, and equity products. The role would also require the analyst to possess good communication skills.\nThe analyst would be required to exhibit knowledge of various aspects of financial markets especially with regards to asset classes, trading fundamentals etc. along with behavioral dexterity to manage professional rapport while working with various teams.\n\n\nWhat are the ongoing responsibilities of a Compliance Business Analyst?\n\nDuties / Responsibilities\n\n\nPerform manual checks and analyses of portfolio and benchmark holdings, review historical transactions etc. for restrictions which are not automated in Charles River, including research on other systems such as Bloomberg and MSCI.\nPost-Trade Analysis: Conduct timely and accurate compliance analysis of portfolio holdings, composition and historical transactions to verify compliance with applicable investment exposure and activity limitations stemming from regulatory requirements, client mandate, applicable policies, etc.\nPre-Trade Analysis: Investment Compliance personnel liaise directly with traders and portfolio teams at the point of order entry to ensure compliance with applicable investment limitations / restrictions.\nExceptions generated via the automated pre-trade compliance review (Charles River) are reviewed for further investigation, escalation, etc.\nCertifications for Sub-advised/Institutional Clients\nAssist in client/ board reporting preparation.\nEnsure documentation and procedures are maintained and kept up to date.\nTeam administration tasks\nOther tasks involving review, independent research and analysis.\nAssess current controls and processes, with the intent to optimize and improve efficiencies and reduce risk of errors.\n\n\nWhat ideal qualifications, skills & experience would help someone to be successful?\n\nEducation And Experience\n\n\nMBA with Finance from premium business schools\nExceptional candidates who have completed their graduation from premium colleges with excellent academics can be considered. Work experience of 2-5 years preferred. years’ experience\nExperience with Financial Services/Asset Management Industry, Mutual fund, Stock broking (preferably in portfolio/investment compliance)\nGood in Microsoft Excel and handling different applications. (Knowledge of Macros or automation tools will be added advantage)\nKnowledge of Charles River or Aladdin –is a bonus.\nHave good understanding of complex securities, ETFs, fixed income, equity/private equity, MUNI’s and Derivative products. Possess excellent communication skills as the analyst needs to interact with Global counterparts/ Portfolio Managers / Traders daily.\nExhibit knowledge of various aspects of financial markets especially with regards to asset classes, trading fundamentals etc. along with behavioral dexterity to manage professional rapport while working with various teams/departments.\n\n\nKnowledge, Skills, And Abilities\n\n\nAbility to collaborate with teams from various locations and multi-task.\nStrong interpersonal skills and a talent for building trusted relationships with all level of staff including senior management to accomplish common goals.\nExceptional analytical skills, ability to troubleshoot issues quickly and provide timely responses and accuracy.\nStrong time management skills and ability to handle multiple tasks under time pressure.\nStrong attention to detail and accuracy.\nAble to work with minimum supervision.\nExcellent written and oral communication and presentation skills.\nMust be willing to work in US shifts for real-time support if required.\n\n\nLicenses And Certifications\n\n\nCertifications in Derivatives & Mutual funds (desirable)\n\n\nAdditional Desirable Qualifications\n\n\nCA (Inter), CFA Level1-2, FRM Level 1\nCertification course in derivatives or financial markets.\nCharles River or Aladdin experience a plus.\n\n\nProblem Solving And Decision Making\n\n\nAbility to work independently & pro-actively look for a solution.\nStrong time management skills and ability to manage multiple tasks together.\n\n\nJob Level - Individual Contributor\n\nWork Shift Timing - 4:30 PM - 1:30 AM IST\n\nExperience our welcoming culture and reach your professional and personal potential!\n\nOur culture is shaped by our diverse global workforce and strongly held core values. Regardless of your interests, lifestyle, or background, there’s a place for you at Franklin Templeton. We provide employees with the tools, resources, and learning opportunities to help them excel in their career and personal life.\n\nHear more from our employees\n\nBy joining us, you will become part of a culture that focuses on employee well-being and provides multidimensional support for a positive and healthy lifestyle. We understand that benefits are at the core of employee well-being and may vary depending on individual needs. Whether you need support for maintaining your physical and mental health, saving for life’s adventures, taking care of your family members, or making a positive impact in your community, we aim to have them covered.\n\nHighlights Of Our Benefits Include\n\n\nProfessional development growth opportunities through in-house classes and over 150 Web-based training courses\nAn educational assistance program to financially help employees seeking continuing education\nMedical, Life and Personal Accident Insurance benefit for employees. Medical insurance also cover employee’s dependents (spouses, children and dependent parents)\nLife insurance for protection of employees’ families\nPersonal accident insurance for protection of employees and their families\nPersonal loan assistance\nEmployee Stock Investment Plan (ESIP)\n12 weeks Paternity leave\nOnsite fitness center, recreation center, and cafeteria\nTransport facility\nChild day care facility for women employees\nCricket grounds and gymnasium\nLibrary\nHealth Center with doctor availability\nHDFC ATM on the campus\n\n\nLearn more about the wide range of benefits we offer at Franklin Templeton\n\nFranklin Templeton is an Equal Opportunity Employer. We are committed to providing equal employment opportunities to all applicants and existing employees, and we evaluate qualified applicants without regard to ancestry, age, color, disability, genetic information, gender, gender identity, or gender expression, marital status, medical condition, military or veteran status, national origin, race, religion, sex, sexual orientation, and any other basis protected by federal, state, or local law, ordinance, or regulation.\n\nFranklin Templeton is committed to fostering a diverse and inclusive environment. If you believe that you need an accommodation or adjustment to search for or apply for one of our positions, please send an email to accommodations@franklintempleton.com. In your email, please include the accommodation or adjustment you are requesting, the job title, and the job number you are applying for. It may take up to three business days to receive a response to your request. Please note that only accommodation requests will receive a response.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/compliance-business-analyst-at-franklin-templeton-india-4136771847?position=1&pageNum=50&refId=%2FVyrdZh82hXsETPuNBCAVQ%3D%3D&trackingId=uJ4gZoocIzdFY004UGlwcw%3D%3D"
}