{
    "job_id": "4136429691",
    "title": "CyberSecurity Data Scientist, Account and Device Intelligence",
    "company": "Google",
    "location": "Bengaluru, Karnataka, India",
    "description": "Minimum qualifications:\n\n\nBachelor's degree or equivalent practical experience.\n2 years of experience in data analysis, including identifying trends, generating summary statistics, and drawing insights from quantitative and qualitative data.\n2 years of experience managing projects and defining project scope, goals, and deliverables.\n\n\nPreferred qualifications:\n\n\nMaster's degree or PhD in Computer Science, Engineering, Mathematics, Physics or a related technical field.\nExperience in large-scale data analysis and related tools and processes.\nExperience in automating processes or applied AI.\nKnowledge in account security, network engineering, malware or artificial intelligence.\n\n\nAbout The Job\n\nIn this role, you will be working with a team of analysts that assess and address threats against Google accounts. You will identify and solve complex issues at scale and have investigative and technical skills. You will be proactive, motivated, organized, responsible, innovative and are able to work well in a fluid, global, cross-functional, and team-oriented environment and demonstrate technical know-how, effective communication to get things done. You will also work very closely with engineering teams and product teams to make sure that new products and features provide a good, safe experience for users. You will build, leverage and evaluate ML/AI models to solve cybersecurity and abuse issues.\n\nAt Google we work hard to earn our users’ trust every day. Trust & Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.\n\nResponsibilities\n\n\nProvide high-quality, detailed and actionable qualitative and quantitative understanding of the threat landscape, designing and improving additional data collection, processes and quality measures.\nDesign and build early warning alerts for novel and changing account threats, based on researching, understanding and experimenting with attacker operations and attacker interactions with our systems.\nProvide and apply our threat intelligence to be ready to respond to new adversarial campaigns.\nLead incident response to incidents efforts for Google, including the special response in case of severe incidents in collaboration with the UP/Account and Device Intelligence (ADI) team.\nWork together with our GOC team (located in Hyderabad) to scale the operational work required to protect Google accounts, such as handling low severity escalations and alerts, and maintaining the ground truth quality. Provide the training and work with UP/ADI.\n\n\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/cybersecurity-data-scientist-account-and-device-intelligence-at-google-4136429691?position=7&pageNum=12&refId=C8%2Bsob%2BWGMHdmBeyzLMkdA%3D%3D&trackingId=L2%2B203H4BbbLgiIw9hMyyg%3D%3D"
}