{
    "job_id": "4136091550",
    "title": "Sr. Analyst, Business Analytics",
    "company": "Colgate-Palmolive",
    "location": "Mumbai Metropolitan Region",
    "description": "# 163510 - Mumbai, Maharashtra, India\n\nWho We Are\n\nColgate-Palmolive Company is a caring, innovative growth company that is reimagining a healthier future for all people, their pets and our planet. Focused on Oral Care, Personal Care, Home Care and Pet Nutrition, we sell our products in more than 200 countries and territories under brands such as Colgate, Palmolive, elmex, hello, meridol, Sorriso, Tom’s of Maine, EltaMD, Filorga, Irish Spring, PCA SKIN, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Soupline and Suavitel, as well as Hill’s Pet Nutrition.\n\nWe are recognized for our leadership and innovation in promoting sustainability and community wellbeing, including our achievements in decreasing plastic waste and promoting recyclability, saving water, conserving natural resources and improving children’s oral health.\n\nIf you want to work for a company that lives by their values, then give your career a reason to smile and join our global team!\n\nThe Experience\n\nIn today’s dynamic analytical / technological environment, it is an exciting time to be a part of the Analytics team at Colgate. Our highly insight driven and innovative team is dedicated to driving growth for Colgate Palmolive in this ever-changing landscape.\n\nWhat role will you play as a member of the Colgate’s Information Technology team?\n\nThe candidate will support the Colgate Business Teams in Global Supply Chain functions. The role requires a person to have understanding of Internal & external data (Product, Warehouse, Demand, Inventory etc.) and ability to provide Insights based Services & solutions. The Person should have abilities to build insights from large External and Internal datasets. An Analytical problem solver with focus on Business Intelligence and Insights. Ability to work in a collaborative and customer focused (proactive and Responsive to Business needs) . Excellent Written and verbal communication skills\n\nWho are you?\n\nYou are a functional expert:\n\n\nBuild Insights and Competition Intelligence solutions\nWork on Connected data solutions, building automated insights and reports\nWork on different datasets & systems and link the business rationales to develop & support Insights and Analytics\nBuild & support standard Business evaluation Trackers & Dashboards per agreed to SLAs and respond to ad hoc requests for reporting and first level analysis\nData Quality and Sanity is crucial so validating the data, trackers and dashboards is prime\nCommunicate and coordinate with Divisions and subsidiaries as part of investigation and resolution of discrepancies\nYou will engage with Business teams in Corporate, Divisions, Hub (Cluster of Countries) and countries to understand business requirements and collaborate on solutions\nWork with Internal Analytics teams & Information technology teams to learn and advance on developing sustainable and standard reporting trackers\nPartner with external data vendors to ensure timely data availability with appropriate data sanity\nWith constantly evolving business environment, you will find out different ways to tackle the business problem through Analytical solutions (Data transformation, Data Visualization, Data Insights)\n\n\nYou connect the dots -\n\n\nWork on Connected data solutions, building automated insights and reports\n\n\nYou are a collaborator -\n\n\nYou will engage with Business teams in Corporate, Divisions, Hub (Cluster of Countries) and countries to understand business requirements and collaborate on solutions\nWork with Internal Analytics teams & Information technology teams to learn and advance on developing sustainable and standard reporting trackers\nPartner with external data vendors to ensure timely data availability with appropriate data sanity\n\n\nYou are an innovator -\n\n\nWith constantly evolving business environment, you will find out different ways to solve the business problem through Analytical solutions (Data Insights, Data Visualization, Data transformation)\n\n\nWhat You’ll Need…\n\n\nGraduate in Engineering/Sciences/Statistics , MBA\nExperience with Snowflake, Data Build Tool, Github preferred\nMinimum 1 years experience working in Data Insights / Analytics role\nShould have worked in a client facing / stakeholder management role to understand business needs and draw hypothesis\nSolid understanding of consumer packaged goods industry\nKnowledge of Data Transformation tools - R/Python, Snowflake\nSolid understanding of visualization tools like Tableau, DOMO, Lookerstudio\nAbility to Read, Analyze and Visualize data\nEffective Verbal & Written Communication for Business engagement\nExcellent presentation/visualization skills\n\n\nWhat You’ll Need…(Preferred)\n\n\nCreated/worked on automated Insights solution\nWorked on Competition Intelligence solutions\nUnderstanding of Colgate’s processes, and tools supporting analytics (for internal candidates)\nWillingness and ability to experiment with new tools and techniques\nGood facilitation and project management skills\n\n\nOur Commitment to Sustainability\n\nWith the Colgate brand in more homes than any other, we are presented with great opportunities and new challenges as we work to integrate sustainability into all aspects of our business and create positive social impact. We are determined to position ourselves for further growth as we act on our 2025 Sustainability & Social Impact Strategy.\n\nOur Commitment to Diversity, Equity & Inclusion\n\nAchieving our purpose starts with our people — ensuring our workforce represents the people and communities we serve —and creating an environment where our people feel they belong; where we can be our authentic selves, feel treated with respect and have the support of leadership to impact the business in a meaningful way.\n\nEqual Opportunity Employer\n\nColgate is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity, sexual orientation, national origin, ethnicity, age, disability, marital status, veteran status (United States positions), or any other characteristic protected by law.\n\nReasonable accommodation during the application process is available for persons with disabilities. Please contact Application_Accommodation@colpal.com with the subject \"Accommodation Request\" should you require accommodation.\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/sr-analyst-business-analytics-at-colgate-palmolive-4136091550?position=10&pageNum=27&refId=qUEK%2BRRfTlwms%2BZrzTuWbg%3D%3D&trackingId=IlsFUdEvu41SuhVnuBZDIQ%3D%3D"
}