{
    "job_id": "4136733996",
    "title": "Data Scientist",
    "company": "Axtria - Ingenious Insights",
    "location": "Noida, Uttar Pradesh, India",
    "description": "Axtria: -Axtria is a global provider of award-winning cloud software and data analytics to the life sciences industry. Axtria enables life sciences organizations to transform the product commercialization journey and deliver much-improved healthcare outcomes for patients worldwide. We are acutely aware that our work impacts millions of people and are incredibly passionate about the improvement we can bring to patients’ lives.\n\nOur focus is on delivering solutions that help pharmaceutical, medical device, and diagnostics companies complete the journey from data to insights to action and get superior returns from their investments. As a participant of the United Nations Global Compact, Axtria is committed to aligning strategies and operations with universal principles on human rights, labor, environment, and anti-corruption and taking actions that advance societal goals.\n\nOur people are our core strength, and they make us proud of our work; this has helped us grow exponentially and make tremendous strides toward developing great products. It is for the grit, thinking of an entrepreneur, and a family-like environment where each member is valued and treasured that we are growing rapidly.\n\nFor more information, visit www.axtria.com.\n\n\n\n\nJob Title: - Associate Manager/Project Leader – Model Building\n\n\n\n\nJob Location: -Noida/Gurgaon/Bangalore/Pune/Hyderabad\n\n\n\n\nJob Summary: -\n\nData Scientist with good hands-on experience of 3+ years in developing state of the art and scalable Machine Learning models and their operationalization, leveraging off-the-shelf workbench production.\n\n\n\n\nJob Responsibilities: -\n\n\n\n\nHands on experience in Python data-science and math packages such as NumPy, Pandas, Sklearn, Seaborn, PyCaret, Matplotlib\nProficiency in Python and common Machine Learning frameworks (TensorFlow, NLTK, Stanford NLP, PyTorch, Ling Pipe, Caffe, Keras, SparkML and OpenAI etc.)\nExperience of working in large teams and using collaboration tools like GIT, Jira and Confluence\nGood understanding of any of the cloud platform – AWS, Azure or GCP\nUnderstanding of Commercial Pharma landscape and Patient Data / Analytics would be a huge plus\nShould have an attitude of willingness to learn, accepting the challenging environment and confidence in delivering the results within timelines. Should be inclined towards self motivation and self-driven to find solutions for problems.\nShould be able to mentor and guide mid to large sized teams under him/her\n\n\n\n\nJob Requirements: -\n\nStrong experience on Spark with Scala/Python/Java\nStrong proficiency in building/training/evaluating state of the art machine learning models and its deployment\nProficiency in Statistical and Probabilistic methods such as SVM, Decision-Trees, Bagging and Boosting Techniques, Clustering\nProficiency in Core NLP techniques like Text Classification, Named Entity Recognition (NER), Topic Modeling, Sentiment Analysis, etc. Understanding of Generative AI / Large Language Models / Transformers would be a plus\n\n\n\n\n\n\n\n\n\n\nQualification: -\n\n\n\n\nB-Tech or BE in Computer Science / Computer Applications from Tier 1-2 college with 3+ years of proven experience in the field of Advanced Analytics or Machine Learning\nOR\nMaster’s degree in Machine Learning / Statistics / Econometrics, or related discipline from Tier 1-2 college with 3+ years of experience\n\n\n\n\n\n\n\nMust have Skills: -\n\n\n\n\nReal-world experience in implementing machine learning/statistical/econometric models/advanced algorithms\nBreadth of machine learning domain knowledge\nExperience in application of machine learning algorithms (classification, regression, deep learning, NLP, etc.)\nExperience with a ML/data-centric programming language (such as Python, Scala, or R) and ML libraries (pandas, numpy, scikit-learn, etc.)\nExperience with Apache Hadoop / Spark (or equivalent cloud-computing/map-reduce framework)\n\n\n\n\nSkills that give you an edge: -\n\nStrong analytical skills to solve and model complex business requirements are a plus. With life sciences or pharma background.\n\n\n\n\nWe will provide– (Employee Value Proposition)\n\nOffer an inclusive environment that encourages diverse perspectives and ideas\nDeliver challenging and unique opportunities to contribute to the success of a transforming organization\nOpportunity to work on technical challenges that may impact across geographies\nVast opportunities for self-development: online Axtria Institute, knowledge sharing opportunities globally, learning opportunities through external certifications\nSponsored Tech Talks & Hackathons\nPossibility to relocate to any Axtria office for short and long-term projects\nBenefit package:\n\n-Health benefits\n\n-Retirement benefits\n\n-Paid time off\n\n-Flexible Benefits\n\n-Hybrid /FT Office/Remote\n\n\n\n\nAxtria is an equal-opportunity employer that values diversity and inclusiveness in the workplace.\n\n\n\n\nWho we are\n\nAxtria 14 years journey\n\nAxtria, Great Place to Work\n\nLife at Axtria\n\nAxtria Diversity\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-axtria-ingenious-insights-4136733996?position=9&pageNum=12&refId=C8%2Bsob%2BWGMHdmBeyzLMkdA%3D%3D&trackingId=cEioVxyYgkYgPhXL4Quciw%3D%3D"
}