{
    "job_id": "4137149457",
    "title": "Business Operation Analyst",
    "company": "Guidewire Software",
    "location": "Bengaluru, Karnataka, India",
    "description": "Summary\n\nProfessional Services, Operations Specialist\n\nThe Professional Services Business Operations Specialist plays a vital role in ensuring the smooth and efficient operation of the Services organization. In this dynamic position, you will focus on project administration, operational support, contract management, and driving process improvements. We are looking for an energetic individual who thrives in a collaborative team environment and is passionate about continuous learning and growth.\n\nYou will be working in the Guidewire Bangalore office, and will report to the Professional Services Business Operations Manager.\n\nResponsibilities\n\nJob Description\n\n\nHandle and resolve internal customer requests via Salesforce cases, providing top-tier support.\nEfficiently prioritize and manage multiple time-sensitive cases simultaneously.\nPrepare, review, and approve sales and contractual documents (e.g., Statements of Work, Work Orders, Change Orders, Proposals, RFIs, and estimates) for both standard and custom deals, ensuring compliance with Guidewire’s policies.\nSupport global field consultants with invoicing and month-end billing processes.\nAddress and resolve employee inquiries regarding resource assignments, expenses, travel policies, and other operational topics.\nAssist with project set-up, tracking, and maintenance within our Professional Services Automation (PSA) tool.\nCollaborate cross-functionally with key stakeholders (Professional Services, Finance, and Legal) to resolve or approve customer rates and billing discrepancies promptly.\nCreate and manage customer-facing annual rate increase notifications and update internal systems with the latest rates as needed.\nLead and implement process improvements to enhance organizational efficiency.\n\n\nRequired Skills And Experience\n\n\n3-5 years combined experience in Professional services operations or Professional Services.\nSome background in invoicing, billing, and/or financial analysis.\nMust be able to read and interpret contractual language with regards to project set-up details (i.e., rates, start and end dates, expense policies, etc.).\nExperience with basic project management (i.e., defining goals, tracking progress, reporting status, and meeting milestones).\nExperience with basic system administration tasks.\nExperience with Salesforce.com desired\nProficiency in Google GMail, Documents, and Sheets\nExcellent communication and active listening skills. Comfortable talking to internal customers via email, chat, or phone.\nAbility to work both in a small team environment with shared responsibilities and independently with little or no supervision direction, while demonstrating collegiality.\nOutstanding attention to detail with a strong ethic of personal responsibility.\nGreat problem-solving, analytical, and organizational skills.\nDuring month-end and quarter-end periods, a flexible schedule may be necessary to provide support to customers across different time zones.\n\n\nAbout Guidewire\n\nGuidewire is the platform P&C insurers trust to engage, innovate, and grow efficiently. We combine digital, core, analytics, and AI to deliver our platform as a cloud service. More than 540+ insurers in 40 countries, from new ventures to the largest and most complex in the world, run on Guidewire.\n\nAs a partner to our customers, we continually evolve to enable their success. We are proud of our unparalleled implementation track record with 1600+ successful projects, supported by the largest R&D team and partner ecosystem in the industry. Our Marketplace provides hundreds of applications that accelerate integration, localization, and innovation.\n\nFor more information, please visit www.guidewire.com and follow us on Twitter: @Guidewire_PandC.\n\nGuidewire Software, Inc. is proud to be an equal opportunity and affirmative action employer. We are committed to an inclusive workplace, and believe that a diversity of perspectives, abilities, and cultures is a key to our success. Qualified applicants will receive consideration without regard to race, color, ancestry, religion, sex, national origin, citizenship, marital status, age, sexual orientation, gender identity, gender expression, veteran status, or disability. All offers are contingent upon passing a criminal history and other background checks where it's applicable to the position.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-operation-analyst-at-guidewire-software-4137149457?position=10&pageNum=42&refId=xxyg9D9a0iqwhm5TUVsTxQ%3D%3D&trackingId=MIt7fktjkvuuZQFPrFBarw%3D%3D"
}