{
    "job_id": "4137251191",
    "title": "Business Analyst",
    "company": "dentsu",
    "location": "Pune, Maharashtra, India",
    "description": "The purpose of this role is to enable and support project delivery through the capture and analysis of user and business needs, ensuring project outcomes are aligned with the service vision and business strategy.\n\nJob Description:\n\nAbout the Role:\n\nWe are seeking a highly skilled and motivated Technical Business Analyst to join our team. The role is critical to the development of a cutting-edge reporting platform designed to measure and optimize online marketing campaigns. The ideal candidate will bridge the gap between business stakeholders and the technical team, ensuring the delivery of robust, scalable, and actionable reporting solutions.\n\nKey Responsibilities:\n\nRequirement Analysis and Review:\n\n\nAnalyze and critically evaluate client-provided technical and functional requirements.\nCollaborate with stakeholders to identify gaps, ambiguities, and areas needing clarification.\nDocument and communicate a clear understanding of requirements to the internal team.\n\n\n\nProduct Definition:\n\n\nDefine and prioritize product features in collaboration with technical architects based on requirements, aligning with business goals and project objectives.\nDevelop detailed user stories, use cases, and acceptance criteria to guide the development team.\nPartner with UX/UI designers to ensure reporting solutions are user-friendly and meet stakeholder expectations.\n\n\n\nStakeholder Engagement:\n\n\nAct as the primary interface between the client and internal teams during the initial and ongoing phases of the project.\nFacilitate discussions to resolve questions and ensure alignment across all parties.\nProvide regular updates on project status, challenges, and milestones to stakeholders.\n\n\n\nSupport Implementation and go-live:\n\n\nWork closely with development and technology teams during implementation to ensure features are developed according to specifications.\nParticipate in testing, validation, and quality assurance activities to ensure the platform meets agreed-upon standards.\nSupport go-live activities, including user training, documentation, and post-launch troubleshooting.\n\n\n\nQualifications and Skills:\n\n\nBachelor’s degree in Computer Science, Information Technology, MBA Systems or a related field.\n5+ years of experience as a Business Analyst, with a focus on technology-driven projects.\nFamiliarity with Agile/Scrum methodologies is a mandatory.\nExperience working with cloud-based data platforms (e.g., GCP, AWS, Azure) and SQL.\nStrong understanding of online marketing campaigns, metrics, and KPIs is big plus\nStrong problem-solving and critical-thinking skills.\nExcellent communication, presentation, and stakeholder management abilities.\n\n\n\nLocation:\n\nBengaluru\n\nBrand:\n\nMerkle\n\nTime Type:\n\nFull time\n\nContract Type:\n\nPermanent\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-dentsu-4137251191?position=5&pageNum=52&refId=45I0DUvCFXw1ux4xI%2B7zbg%3D%3D&trackingId=OUhIHRyhxhWMwOxRwcChbg%3D%3D"
}