{
    "job_id": "4137508103",
    "title": "Data Scientist",
    "company": "Vivriti Capital",
    "location": "Bengaluru, Karnataka, India",
    "description": "About Vivriti Group\n\nVivriti Group is a trailblazer in the mid-market lending space, offering customized debt solutions to mid-sized enterprises. The group operates through two core businesses:\n\nVivriti Capital Limited: A systematically important Non-Banking Financial Company (NBFC ND-SI) regulated by the Reserve Bank of India (RBI). Vivriti Capital has disbursed over USD 3 billion to 300+ enterprise borrowers and holds a CRISIL rating of A+.\nVivriti Asset Management: A fixed-income fund manager, managing multiple Alternative Investment Funds (AIFs). With over USD 550 million in commitments from 900+ institutional and private contributors, Vivriti AMC has invested more than USD 600 million across 90+ entities.\n\n\n\n\nhttps://www.youtube.com/watch?v=5rGfHVlRX0A\n\n\n\n\nThe opportunity…\n\nAre you ready to join us on our exciting journey of being a fast-growth company, but one that is maturing and needs your support in creating the right solutions that are not too cumbersome yet deliver high value?\n\nAre you excited about Data Assets and the value they brings to an organization?\nAre you an evangelist for data driven decision making?\nDo you want to be the go-to resource for data analytics in the company?\n\nThe ideal candidate has a knack for seeing solutions in sprawling data sets and the business mindset to convert insights into strategic opportunities for our company.\n\nThe purpose of this role is to bring in the culture of data aggregation and analysis, develop consistent and reliable solutions that can be further leveraged upon to scale for various business objectives.\n\nKey Responsibilities\n\nBe responsible for scaling our analytics capabilities across all disciplines and guide our strategic direction towards analytics.\nOrganize and analyse large, diverse data sets across multiple functions, translating business needs to technical requirements and implementation.\nIdentify key insights and leverage them to inform and influence product strategy.\nDevelop proof of concepts to prove or disproves validity of concepts.\nDevelop Statistical/ ML models for various use cases, customer analytics, segmentation etc. using Logistic Regression, Decision Tree, Random Forest, Clustering algorithms etc.\nEnsure model performance, validation, scalability criteria are reviewed regularly with timely updates for proactive adoption to changes in business strategies or portfolio performance.\nPartner with the Data engineering team to define the required data pipelines to build and enhance the repository (foundational capability) to build/deploy the various AL/ML algorithms both for batch and real time use cases.\nUtilize effective project planning techniques to break down complex projects into tasks and ensure deadlines are kept.\nSupport critical business decisions through adhoc analysis to uncover new insights in data.\n\nWhat you will bring\n\nData driven mindset with degree in a quantitative discipline such as Computer Science, Statistics, Engineering, Mathematics or Economics.\n2+ years' experience in a quantitative, Data Science or other advanced data & predictive analytics role.\nExperience working in AI/ML algorithms, working with large datasets and big data tools.\nExperience in building institutional/B2B financial models in the capital markets, risk management, or credit risk.\nStrong experience in python, SQL and in-depth understanding of modelling techniques.\nExposure to big data tools like Spark, and some core tech knowledge around API’s, data streaming etc. (Nice to have)\nExperience in Fintech/Banking/Credit/Payment industry is a plus.\nHighly motivated, result-oriented self-starter who enjoys working in a fast-paced environment.\nHigh degree of responsibility and ownership, strong multitasking, coordination and tenaciously looking for ways to get results.\nExperience with cloud-based services viz AWS, GCP, Azure will be a plus.\nExperience in B2B market\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-vivriti-capital-4137508103?position=10&pageNum=12&refId=C8%2Bsob%2BWGMHdmBeyzLMkdA%3D%3D&trackingId=tKK4VzuYFprY12D13N%2FSDw%3D%3D"
}