{
    "job_id": "4137837650",
    "title": "Business Analyst",
    "company": "VMock",
    "location": "Gurugram, Haryana, India",
    "description": "About the Company:\n\nVMock is a Career Acceleration Platform which is powered by Artificial Intelligence. Our aim is to empower students and professionals along the various phases of their career journey across the globe. Our fast-paced culture is a great fit for anyone looking to make a mark through their work to create impact globally while working with high caliber team members.\n\nOur Mission:\n\nAccelerate every student and professional’s career journey to maximize their success.\n\nOur Vision:\n\nOffer SMART Career Acceleration Platform that acts like a personal coach to every job seeker along their career journey, globally.\n\nOur Tenets:\n\nInnovate - Innovation is at the heart of all our work at VMock. We deal with science fiction on a daily basis, and our vision is no less than something from Star Trek\nCollaborate - Our ‘ecosystem’ mindset is focused on providing a seamless experience to our customers.\nDelight - Each of us, here, is an army of one, contributing to our company’s vision. We are constantly engaged to deliver something ‘extra’ to our clients.\n\n\n\n\nThe Role\n\nWe are seeking a highly motivated and detail-oriented Business Analyst to join our Delivery and Configuration Team. The ideal candidate will play a critical role in ensuring the successful delivery and configuration of our solutions to clients, ensuring that our platform meets their specific needs and requirements. This position requires a blend of analytical skills, project management capabilities, and a strong understanding of technical configurations\n\n\n\n\nWhat to expect from the Role-\n\nClient Engagement:\n\nCollaborate with the client success team to gather and document their requirements.\nConduct detailed business analysis to understand client needs and translate them into technical specifications.\n\nSolution Delivery:\n\nWork closely with the development team to ensure accurate implementation of client requirements.\nOversee the configuration and customization of the VMock platform to align with client specifications.\nEnsure timely and successful delivery of solutions, meeting quality standards and client expectations.\n\nProject Management:\n\nManage multiple projects simultaneously, ensuring they are delivered on time and within scope.\nDevelop project plans, timelines, and milestones, and monitor progress against them.\nCoordinate with cross-functional teams to ensure seamless delivery and configuration processes.\n\nTesting and Quality Assurance:\n\nDevelop and execute test plans to ensure the functionality and performance of delivered solutions.\nIdentify and resolve any issues or discrepancies during the testing phase.\n\nDocumentation and Training:\n\nCreate comprehensive documentation for configurations, processes, and delivered solutions.\nProvide training and support to clients on using the VMock platform effectively.\n\nContinuous Improvement:\n\nIdentify opportunities for process improvements and contribute to the development of best practices.\nStay updated with industry trends and advancements to enhance the delivery and configuration processes.\n\n\n\n\nRequirements-\n\nStrong analytical and problem-solving skills\nExcellent communication and interpersonal skills, with the ability to engage effectively with clients and internal teams\nBusiness Acumen: Having business smartness coupled with strong understanding of business concepts\nComputer Skills: Proficiency in word processing, spreadsheets (excel) and PowerPoint\nInitiative: Ability to work with limited supervision within a team with high-level of individual initiative\nDetail-orientation with strong organisational skills and the ability to manage multiple projects simultaneously\nAbility to work independently and as part of a team\n\n\n\n\nQualification and Background-\n\nBachelor’s degree from top Delhi University colleges\n0-3 years of work experience in business analysis, data analysis, research etc\n\n\n\n\nAdditional Benefits -\n\nBest in class Tools of trade\nMedical Insurance - Employee & Immediate Family Members\nFast Pace Environment to foster growth\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-vmock-4137837650?position=49&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=38mNkcRqsERMVKmTQFoexQ%3D%3D"
}