{
    "job_id": "4137254321",
    "title": "Data Scientist",
    "company": "Weekday Jobs (YC W21)",
    "location": "New Delhi, Delhi, India",
    "description": "This role is for one of the Weekday's clients\n\nOverview\n\nThe Data Scientist plays a crucial role in harnessing the power of data to drive decision-making processes and enhance business performance. This role involves analyzing complex datasets to derive actionable insights, utilizing advanced analytical techniques ranging from statistical analysis to machine learning algorithms. By leveraging big data technologies and programming skills, the Data Scientist provides the organization with a competitive edge, informing strategy and optimizing operations. As a key team member, the Data Scientist collaborates with cross-functional teams, interpreting data and translating findings into clear concepts for stakeholders. This position is vital for organizations aiming to use data-driven techniques to support innovation and growth, developing models that can predict outcomes and improve overall efficiency.\n\nKey Responsibilities\n\n\nCollect, clean, and preprocess data from various sources.\nPerform exploratory data analysis to identify trends and patterns.\nDevelop predictive models using machine learning algorithms.\nDesign and implement data visualization solutions for stakeholders.\nCollaborate with software engineers to integrate data solutions into applications.\nConduct statistical analyses to validate model effectiveness.\nWork closely with business units to understand their data needs.\nPresent findings and insights to management and non-technical stakeholders.\nStay updated with the latest advancements in data science and technologies.\nDevelop and maintain documentation for data science projects.\nPerform quality assurance on data products to ensure accuracy.\nEngage in A/B testing and experiments to validate hypotheses.\nOptimize existing data processes for efficiency improvements.\nMentor junior data analysts and scientists.\nLead projects from inception through implementation to evaluate results.\n\n\nRequired Qualifications\n\n\nBachelor's degree in Data Science, Computer Science, Statistics, or related field.\nMaster's degree or Ph.D. in a relevant field is preferred.\nA minimum of 3 years of experience in data science or a related area.\nProficiency in programming languages such as Python or R.\nStrong understanding of statistical methods and concepts.\nExperience with data visualization tools like Tableau or Power BI.\nHands-on experience with machine learning frameworks (e.g., TensorFlow, Scikit-Learn).\nFamiliarity with big data technologies such as Hadoop or Spark.\nExcellent problem-solving and analytical skills.\nStrong communication and interpersonal skills.\nExperience in handling large datasets.\nKnowledge of database systems (SQL/NoSQL).\nAbility to work independently and in a team-oriented environment.\nStrong attention to detail and a commitment to quality.\nExperience in deploying data-driven solutions in production.\nContinuous learner with a passion for data science and technology.\n\n\nSkills: machine learning,data visualization,r,nosql,deep learning,statistical analysis,scikit-learn,python,critical thinking,data wrangling,tensorflow,problem solving,hadoop,cloud computing,big data technologies,spark,sql,tableau,power bi,aws,communication skills\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-weekday-jobs-yc-w21-4137254321?position=7&pageNum=22&refId=Q8Kf9AiV%2Bqa0LUasfvZQ2A%3D%3D&trackingId=ZDJ%2FsSavMf1Y1neclbT1%2Fg%3D%3D"
}