{
    "job_id": "4137533161",
    "title": "Business Analyst",
    "company": "Rootquotient",
    "location": "Chennai, Tamil Nadu, India",
    "description": "As a Business Analyst, you'll be the detective who uncovers the secrets of business processes, the translator who turns complexity into clarity, and the requirements prodigy who brings a touch of magic to each sprint. Are you ready to join the adventure?\n\nRequirements Wizardry\n\nThe core responsibilities for the job include the following:\n\n\nEngage with business stakeholders like a friendly oracle, understanding their desires and dreams.\nElicit and document requirements, turning abstract wishes into concrete FRDs and user stories.\nCraft documentations that are so clear, they read like spell incantations.\n\n\nProcess Alchemist\n\n\nCreate user/ process flow diagrams that resemble treasure maps, revealing hidden pathways to efficiency.\nIdentify the application's bottlenecks, transforming them into golden opportunities for improvement.\nShare your secret recipes for process enhancement to make the business sparkle.\n\n\nCollaboration Enchanter\n\n\nClarify user stories for the development team, ensuring they understand the magic you've woven.\nGuide the QA team to make sure they're chasing the right unicorns during testing.\nCollaborate with the design team to bring the requirements written to life.\nMediate between the worlds of business and tech, resolving conflicts like a peace-making wizard.\n\n\nDocumentation Mage\n\n\nCreate functional specifications that are spellbinding in their detail, leaving no room for ambiguity.\nWrite user stories that read like magical tales, bringing systems to life with your words.\nConjure clear and effective communication spells, making sure everyone's on the same page.\n\n\nStakeholder Magician\n\n\nKeep stakeholders under your charm with regular updates and dazzling project demonstrations.\nCollect their valuable feedback like a master collector of rare artifacts, ensuring their voices are heard.\n\n\nScrum Sorcerer\n\n\nConjure user stories and prioritize them with the Product Owner/ team during Sprint Planning.\nWave your wand during Backlog Refinement to make user stories sparkle with clarity.\nShare your daily magic at stand-up meetings, ensuring the team stays enchanted with project updates.\n\n\nRequirements\n\n\nA Bachelor's degree in Business, IT, or a related field.\nProven experience as a Business Analyst or similar role, with a knack for making work feel like play.\nExceptional communication skills - your enchanting way with words is your superpower.\nStrong analytical skills and an eagle eye for detail.\nA good understanding of business analysis tools, methodologies, and Scrum practices.\nProficiency in turning complexity into clarity and details into magic.\n\n\nThis job was posted by Krishna Sharmathi from RootQuotient.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-rootquotient-4137533161?position=3&pageNum=87&refId=KM8cdGPQyPT7yvIRKZCULw%3D%3D&trackingId=nSv4hdxiQAohIqybhlrs0g%3D%3D"
}