{
    "job_id": "4137043076",
    "title": "Brainvire Infotech - Business Analyst - Odoo",
    "company": "Brainvire Infotech Inc.",
    "location": "Ahmedabad, Gujarat, India",
    "description": "Analyst - Odoo ERP.\n\nJob Description\n\nKey Responsibilities :\n\n\nConduct thorough analysis of customer business needs, workflows, and existing systems.\nGather detailed requirements from clients through meetings, workshops, and presentations.\nDocument and prioritize customer requirements effectively.\nIdentify and analyze business processes and suggest improvements.\nMap customer requirements to the appropriate Odoo modules and functionalities.\nDesign and configure Odoo solutions to meet specific client needs. Develop and maintain detailed system documentation.\nParticipate in project planning and execution, ensuring timely delivery and adherence to project timelines.\nCollaborate with the implementation team to ensure smooth project execution.\nConduct user acceptance testing (UAT) with clients.\nProvide post-implementation support and training to clients.\nBuild and maintain strong relationships with clients.\nAct as a trusted advisor to clients on ERP best practices and Odoo solutions.\nEffectively communicate technical information to both technical and non-technical audiences.\nPrepare and present proposals and presentations to clients.\nKeep abreast of the latest developments in Odoo ERP and industry best practices. Continuously improve your knowledge and skills through training and certifications.\n\n\nRequired Skills & Experience\n\n\n3+ years of experience in ERP implementation and support, with a strong preference for Odoo ERP.\nExcellent analytical and problem-solving skills.\nStrong understanding of business processes and workflows.\nExcellent communication, presentation, and interpersonal skills.\nAbility to work independently and as part of a team.\nStrong project management and organizational skills.\nAbility to adapt to changing priorities and deadlines.\nExcellent written and verbal communication skills. Proficiency in MS Office Suite.\n\n\nPreferred Skills\n\n\nExperience in specific industry verticals (e.g., manufacturing, retail, healthcare).\nExperience with Agile methodologies. Odoo certifications.\n\n\n(ref:hirist.tech)\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/brainvire-infotech-business-analyst-odoo-at-brainvire-infotech-inc-4137043076?position=4&pageNum=42&refId=xxyg9D9a0iqwhm5TUVsTxQ%3D%3D&trackingId=97dEs3LjTbuiHRh%2FvCcaUw%3D%3D"
}