{
    "job_id": "4137888288",
    "title": "Data Scientist",
    "company": "Persistent Systems",
    "location": "Pune, Maharashtra, India",
    "description": "About Position:\n\n\n\n\nWe are seeking passionate and innovative Generative AI Technology team to join our organization. As Data Scientist in Gen AI technology, you will work at the intersection of technology and industry knowledge, leveraging your expertise in generative AI tools to push the boundaries for building innovative solutions. As a Generative AI Technologist, you will play a crucial role in shaping and building the future of building solutions across business functions, industry domains and finding unique ways to bend emerging technologies. We are looking for GenAI Technologist to develop high-impact, high-visibility large language models and & improve the experience of millions of customers. If you're creative & passionate about solving real world conversational AI problems, come join us.\n\n\n\n\nRole: Data Scientist\nLocation: All PSL Locations\nExperience: 4 to 10 Years\nJob Type: Full Time Employment\n\n\n\n\nWhat You'll Do:\n\n\n\n\nDevelop and implement machine learning algorithms and models.\nDesign and build NLP applications and systems.\nResearch and explore new techniques in ML/NLP, including GenAI.\nCollaborate with cross-functional teams to integrate ML/NLP/GenAI models into products.\nStay up to date with the latest developments in ML/NLP/GenAI.\n\n\n\n\nExpertise you’ll Bring:\n\n\n\n\nDevelop and propose the solution architecture for Generative AI (especially LLMs), advanced Conversational AI chatbots & cloud AIaaS.\nDevelop and implement applications leveraging advanced Generative AI models such as OpenAI GPT, Anthropic Clude, Meta Llama2 and Google Gemini focusing on enhancing developer and business productivity.\nDevelop, Train, Finetune, and Deploy large language models to perform the domain specific tasks.\nApply instruction tuning, reinforcement learning from human feedback (RLHF), and parameter efficient finetuning such as, adaptors, LoRA, and so on to improve LLMs for different use cases.\nArchitect solutions incorporating advanced techniques like Retrieval Augmented Generation (RAG), Transformer Architectures, Lanchain, Sqlchain ensuring optimal model performance and scalability.\nHands on experience in RAG system, LLM fine tuning and Vector DB is must\nMeasure and benchmark of the various LLMs and application performance.\nDrive end-to-end implementation and deployment with extensive knowledge of Azure and AWS services\nStay abreast of emerging trends, complex patterns, data dependencies, and advancements in AI architecture, contributing to the refinement and innovation of application development processes.\nBachelor’s degree or master’s degree (or equivalent experience) or PhD in Computer Science, Electrical Engineering, Artificial Intelligence, or Applied Math with 8+ years of experience.\nExcellent programming skills in Python with strong fundamentals in programming, optimizations and software design\nStrong knowledge of ML/DL techniques, algorithms, and tools with exposure to CNN, RNN (LSTM), Transformers (BERT, BART, GPT/T5, Megatron, LLMs)\nHands-on experience on conversational AI Technologies like Natural Language Understanding, Natural Language Generation, Dialog systems (including system integration, state tracking and action prediction), Information retrieval and Question and Answering, Machine Translation etc.\nExperience with Training BERT, GPT and Megatron Models for different NLP and dialog system tasks using “PyTorch” Deep Learning Frameworks and performing NLP data wrangling and tokenization\nUnderstanding of MLOps life cycle and experience with MLOps workflows & traceability and versioning of datasets including knowhow of database management and queries (in SQL, MongoDB etc)\nExperience using end-to-end MLOps platform such as Kubeflow, MLFlow, AirFlow\nStrong collaborative and interpersonal skills, specifically a proven ability to effectively guide and influence within a dynamic matrix environment.\n\n\n\n\nBenefits:\n\n\n\n\nCompetitive salary and benefits package\nCulture focused on talent development with quarterly promotion cycles and company-sponsored higher education and certifications\nOpportunity to work with cutting-edge technologies\nEmployee engagement initiatives such as project parties, flexible work hours, and Long Service awards\nAnnual health check-ups\nInsurance coverage: group term life, personal accident, and Mediclaim hospitalization for self, spouse, two children, and parents\n\n\n\n\n\n\n\nOur company fosters a values-driven and people-centric work environment that enables our employees to:\n\n\n\n\nAccelerate growth, both professionally and personally\nImpact the world in powerful, positive ways, using the latest technologies\nEnjoy collaborative innovation, with diversity and work-life wellbeing at the core\nUnlock global opportunities to work and learn with the industry’s best\n\n\n\n\nLet’s unleash your full potential at Persistent\n\n\n\n\n“Persistent is an Equal Opportunity Employer and prohibits discrimination and harassment of any kind.”\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-persistent-systems-4137888288?position=20&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=SNGREidsxsMhwxhD4fhbhQ%3D%3D"
}