{
    "job_id": "4138242641",
    "title": "Business Analyst",
    "company": "Yulu",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Summary\n\nWe are seeking a motivated and experienced Business Analyst to join our team. The ideal candidate will possess strong analytical skills, proficiency in SQL, Tableau, and Python, and a passion for leveraging data to drive business decisions. You will collaborate closely with cross-functional teams to analyse business processes, develop insights.\n\nKey Responsibilities.\n\nData Analysis: Extract, analyse, and interpret complex data sets using SQL and Python to provide actionable business insights.\nReporting & Visualization: Develop and maintain dashboards, reports, and visualizations in Tableau to track key performance indicators (KPIs) and business metrics.\nBusiness Insights: Collaborate with operations, business, and finance teams to identify business opportunities, streamline processes, and improve decision-making.\nProcess Improvement: Analyse existing business processes and recommend improvements that align with company objectives.\nForecasting & Modelling: Create and manage data models to forecast trends, demand, and operational efficiency for our BaaS products.\nStakeholder Communication: Present findings and recommendations to stakeholders in a clear and concise manner, translating technical details into actionable business terms.\nAd-hoc Analysis: Support various teams with custom analyses, reports, and data requests as needed.\n\nQualifications\n\nExperience: 2-4 years of experience as a Business Analyst or in a similar analytical role.\nTechnical Skills:\nAdvanced Excel (Must)\nSQL for querying databases.\nStrong experience with Tableau, Power BI for data visualization.\nCompetency in Python for data manipulation, analysis, and automation.\nBusiness Acumen: Understanding of business processes and the ability to connect data analysis to business strategy.\nProblem-Solving: Strong analytical and problem-solving skills with the ability to think critically about business challenges.\nCommunication: Excellent written and verbal communication skills, with the ability to translate data findings into actionable insights.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-yulu-4138242641?position=23&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=oG8%2F7at6YmHnOzlipG5SLg%3D%3D"
}