{
    "job_id": "4138436105",
    "title": "Business Analyst, ROC, ROC",
    "company": "Amazon",
    "location": "Hyderabad, Telangana, India",
    "description": "Description\n\nAmazon Transportation Services (ATS) is seeking a highly skilled and a motivated team player to be part of a dynamic analytics team.\n\nAs Amazon Transportation Services (ATS) we strive to be the earth’s best logistics service provider. We make product journey in the supply chain smooth, to ensure best customer experience.\n\nAs Business Analyst in ATS you solve exciting logistics problems with potential saving millions of dollars!\n\nTo do this,\n\n\nYou eye to uncover trends to go beyond the obvious, identify the “whys”\nYou are comfortable dealing with ambiguity, asking questions and taking up challenges\nYou deal with multiple teams; understand newer areas of business with ease\nYou are comfortable owning multiple projects and driving them to closure\nYou are technically sound in finding and wrangling data you need to bring out the insight\nYou are comfortable presenting and reporting them effectively to Leaders of Amazon!\n\n\nProficient in SQL and conversant with AWS infrastructure\n\nKey job responsibilities\n\n\nUnderstand the various operations across ROC\nDesign and develop highly available dashboards and metrics using SQL and Excel/Quicksight\nUnderstand the requirements of stakeholders and map them with the data sources/data warehouse\nOwn the delivery and backup of periodic metrics, dashboards to the leadership team\nDraw inferences and conclusions, and create dashboards and visualizations of processed data, identify trends, anomalies\nExecute high priority (i.e. cross functional, high impact) projects to improve operations performance\nPerform business analysis and data queries using appropriate tools\nWork closely with internal stakeholders such as business teams, engineering teams, and partner teams and align them with respect to your focus area\n\n\nBasic Qualifications\n\n\nBachelor's degree or equivalent\nExperience defining requirements and using data and metrics to draw business insights\nKnowledge of SQL\n\n\nPreferred Qualifications\n\n\nAmazon is an Equal Opportunity Employer – Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation / Age\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI HYD 13 SEZ\n\nJob ID: A2886504\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-roc-roc-at-amazon-4138436105?position=4&pageNum=65&refId=c7sH5y8Mkcxycc0ZQ9ncOA%3D%3D&trackingId=xwGSsVq5WyjhTyYf6lgejA%3D%3D"
}