{
    "job_id": "4138433863",
    "title": "Business Analyst , In Stores BI",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nAre you customer obsessed, flexible, smart and analytical, strategic yet execution focused, hungry and passionate about e-commerce, experienced, and entrepreneurial leader with a strong work ethic? If yes, this opportunity will appeal to you.\n\nThe ideal candidate will be enthusiastic about managing challenging, lengthy projects across multiple teams and locations. We are looking for a Business Analyst who shares Amazon's passion for the customer—someone who understands the Engineering and Business both. This role requires an individual with excellent understanding of SQL and query development, good business acumen and the ability to work with business, program and product teams. The successful candidate will be a self-starter comfortable with ambiguity, with strong attention to detail, an ability to work in a fast-paced and ever-changing environment, and driven by a desire to innovate in this space.\n\nTo be successful in this role you should have superior communication, presentation and organizational skills. Operating in a fast-moving and sometimes ambiguous environment you will work autonomously taking control and responsibility for achieving the objectives of the role. This role provides opportunities to develop original ideas, approaches, and solutions in a competitive and ever changing business climate. You will also partner with product management teams as well to identify long term features and programs to improve the seller and customer experience on the Amazon platform.\n\nNote: This role is on a contract with Amazon for 9 months\n\nKey job responsibilities\n\n\nData analysis by writing ETL queries in SQL/Datanet platforms\nHighly proficient with MS Excel\nEnabling effective decision making by retrieving and aggregating data from multiple sources and compiling it into a digestible and actionable format\nAnalyzing and solving business problems with focus on understanding root causes and driving forward-looking opportunities\nDesigning new metrics and enhance existing metrics to support the future state of business processes and ensure sustainability\nUnderstanding tools and processes and driving seller adoption\nCommunicating complex analysis and insights to stakeholders and business leaders, both verbally and in writing.\n\n\nBasic Qualifications\n\n\n2+ years of data analytics or automation experience\nKnowledge of data pipelining and extraction using SQL\nBachelor's degree\nKnowledge of SQL and Excel at a moderate or advanced level\nExperience working directly with business teams to utilize metrics and analysis to determine improvement opportunities\n\n\nPreferred Qualifications\n\n\nExperience in data analytics or automation\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ASSPL - Karnataka\n\nJob ID: A2886636\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-in-stores-bi-at-amazon-4138433863?position=50&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=Ayl0XNutAzyoA1wrMspNmg%3D%3D"
}