{
    "job_id": "4138949966",
    "title": "Senior Business Analyst",
    "company": "HCLTech",
    "location": "Chennai, Tamil Nadu, India",
    "description": "HCLTech is hiring for Senior Business Analyst _ Insurance (UK/US Life Insurance and pension)\n\n\n\n\nPlease share resumes to shine.albert@hcltech.com who has worked in life and pension domain only.\n\n\n\n\nAbout the Company - HCLTech is a leading global technology company that helps enterprises reimagine their businesses for the digital age. Our technology products, services, and engineering are built on four decades of innovation, with a world-renowned management philosophy, a strong culture of invention and risk-taking, and a relentless focus on customer relationships.\n\n\n\n\n\n\n\nAbout the Role - We are looking for a Senior Business Analyst with expertise in UK/US Life Insurance and pension. The key responsibilities include analyzing business requirements, conducting market research, and developing strategies to improve business processes.\n\n\n\n\n\n\n\nResponsibilities:\n\n\n\n\nTo undertake an initial analysis of items received to demonstrate an understanding of the requirements, working with operations, to ensure a choice of solutions can be presented\nTo produce an impact assessment for approval by internal / external stakeholders\nTo ensure all documentation (E.g. Impact Assessment / Business requirement specification) is delivered to a high standard and is approved by all internal and external counterparts\nFollowing the initial approval of costs, work with key stakeholders to produce detailed project documentation identifying key requirements and responsibilities to deliver the required outcome\nWhere appropriate, work with systems analysts to assist with the understanding of required changes\nWhere appropriate, work with internal and external stakeholders to ensure policyholder documentation is issued to the expected standards\nTo assist the test team with regards to creating and approving a required test plan\nTo provide operational sign off, prior to systems release, through the final approval of any UAT evidence and to undertake operational verification of the enhancements following release\nTo engage with operational stakeholders, ensuring employees have an appropriate understanding of the item being delivered through Business Change\nTo manage, and own the integration of, items into BAU and to identify / evaluate further opportunities for operational change as part of continuous improvement\nMaintain high levels of productivity and quality, whilst supporting colleagues and stakeholders\nEnsure all regular events, including audit activities and actions, are completed / escalated\nTo adhere to local and corporate governance and controls ensuring business operating systems and procedures are utilized / updated as necessary\nTo adhere to all HCL policies and procedures\nTo comply with industry and regulatory requirements\nApplication of OpEX principles / focus on customer outcomes\nPromote good standards of professional working including verbal and written communication within a service delivery environment\nSupport the achievement of the Business Change team \"terms of reference\" and \"performance standards\" by undertaking activities relevant to the needs of the business\nManaging a group of junior BAs with their administrative tasks and project works\nResponsible for mentoring new hires\n\n\n\n\n\n\n\nQualifications:\n\nGraduation in any stream\nMBA\nCFA Certification from CII, UK\nCBAP certification (from International Institute of Business Analysis, US)\n\n\n\n\nRequired Skills:\n\n\n\n\nAwareness of Financial Services regulatory boundaries\nMS Office experience\nOperate within a workflow management environment\nExcellent communication skills – verbal and written\nUnderstanding of SQL\nUnderstanding of core insurance applications\nAt least 48 months of experience as Life & Pensions Business Analyst, or, at least 72 months of experience in Life & Pensions operations\nProven track record of delivering to a high standard in an operational environment\nProven track record in the ability to influence and achieve results\nExperience of managing process and/or cultural change\nStrong analytical skills\nExcellent communication skills\nExperience in UK/US Life Insurance and pension\n\n\n\n\n\n\n\nPreferred Skills\n\n\n\n\nWorkforce planning knowledge\nUnderstanding of Operational Processes and procedures\nAt least 2 years of experience of working in the UK Life and Pensions area\nExperience of working within a business process outsourcing environment\nAt least 3 years of experience in leading a team\n\n\n\n\n\n\n\nPay range and compensation package - Competitive salary based on experience and qualifications\n\n\n\n\n\n\n\nEqual Opportunity Statement - HCLTech is an equal opportunity employer committed to diversity and inclusivity in the workplace.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-hcltech-4138949966?position=5&pageNum=17&refId=otcMTVij75x3rORf5Q9zLA%3D%3D&trackingId=mEvAoMNh5LFUUEwFBKR2Cg%3D%3D"
}