{
    "job_id": "4138927145",
    "title": "Machine Learning Engineer",
    "company": "PepsiCo",
    "location": "Hyderabad, Telangana, India",
    "description": "🚀 PepsiCo is Hiring: Machine Learning Engineer in Hyderabad! 🚀\n\nAre you ready to revolutionize the future of Machine Learning and Artificial Intelligence? PepsiCo is looking for a talented Machine Learning Engineer to join our dynamic team in Hyderabad!\n\n\n\n\nAbout the Role:\n\nAs a Machine Learning Engineer, you will play a pivotal role in developing and deploying cutting-edge ML and AI solutions. You’ll work with advanced analytics toolsets in a CI/CD environment, leveraging technologies like Spark, Databricks, and Microsoft Azure. Your work will directly impact our ability to deliver scalable, automated, and innovative ML models that drive business value.\n\n\n\n\nKey Responsibilities:\n\n✅ Deliver Advanced Analytics/Data Science projects within time and budget, focusing on DevOps/MLOps and ML models.\n\n✅ Collaborate with data engineers and ML engineers to build and optimize data pipelines (batch to real-time).\n\n✅ Automate the end-to-end ML lifecycle using Azure Machine Learning and Azure Pipelines.\n\n✅ Set up cloud alerts, monitors, dashboards, and logging for ML infrastructure.\n\n✅ Deploy and automate ML models in production environments.\n\n\n\n\nWork Timing: 11:30 AM - 9:00 PM\n\n\n\n\nQualifications:\n\n✅ 8+ years of total IT experience, including 4+ years in Data Science/Machine Learning.\n\n✅ 4+ years of hands-on SQL experience.\n\n✅ Strong experience in DevOps and Machine Learning, with expertise in cloud platforms like Azure (preferred).\n\n✅ Bachelor’s degree in Computer Science, Math, Physics, or a related technical field.\n\n\n\n\nWhy PepsiCo?\n\nAt PepsiCo, you’ll be part of a collaborative, interdisciplinary team that values innovation and creativity. You’ll work on high-impact projects, interact with process owners and business users, and see the real-world impact of your work.\n\n\n\n\n📩 Interested? Share your resume with me at sana.iqwal.contractor@pepsico.com and let’s shape the future of ML and AI together!\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/machine-learning-engineer-at-pepsico-4138927145?position=8&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=DYL02ahEXuW%2BTRhObsM5pw%3D%3D"
}