{
    "job_id": "4138434460",
    "title": "Business Analyst, Advertising Trust Data",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nAdvertising Trust Data is looking for a Senior Business Analyst to help build out actionable and insightful metrics for both internal and external stakeholders. The goal of these actionable insights is to give our internal stakeholders a holistic view of how policies connect to our customers and to help our customers better understand their advertising on Amazon. We are looking for customer obsessed, data driven professionals to join our growing team and solve some of the hardest problems for our customers. To succeed in this role, you will have strong technical acumen and extensive experience in developing reporting, BI, and data warehouse solutions. The ideal candidate will be a self-starter, comfortable diving deep, and making data driven decisions with a strong customer focus. You will work closely with program managers, operations managers, and product owners to analyze massive data sets, identify areas to improve, define metrics to measure and monitor key programs.\n\nKey job responsibilities\n\n\nOwn the design, development, and maintenance of existing and new reports, analyses, dashboards, etc.\nDefine business metrics and KPIs to measure the success of strategic initiatives and build data visualization and analytical solutions.\nIdentify and interpret data sources, manage large amounts of data, ensure consistency of data-sets, create visualizations to aid in understanding data.\nDrive continuous improvement in the automation and standardization of data requirements\nPartnering with product, business and finance teams to create key performance indicators and new methodologies for measuring progress in various initiatives.\nConduct deep dive analysis to identify and address issues raised by business partners.\n\n\nAbout The Team\n\nCustomer trust is everything at Amazon. Our Advertising Trust organization develops policies, and builds the systems, which ensure customer trust in advertising. With a growing advertising technology business, and hundreds of thousands of active self-service advertisers across the globe, this organization is vital to ensuring we can scale while maintaining and ensuring strong customer trust. Leveraging AI, we build systemic solutions that ensure advertising adherence to the complex regulatory, legal, regional, cultural and customer expectations in over 30 countries.\n\nBasic Qualifications\n\n\nBachelor's degree in business, engineering, statistics, computer science, mathematics or related field\n3+ years of Excel or Tableau (data manipulation, macros, charts and pivot tables) experience\nExperience creating complex SQL queries joining multiple datasets, ETL DW concepts\nExperience with data visualization tools (like Tableau) and scripting languages (like R and Python)\nOutstanding analytical, problem solving, and organizational skills with attention to details.\nCapability to work on multiple projects in parallel.\n\n\nPreferred Qualifications\n\n\nExperience with AWS solutions such as S3, Quicksight and Redshift\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI - Karnataka\n\nJob ID: A2886839\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-advertising-trust-data-at-amazon-4138434460?position=1&pageNum=82&refId=N2DJYUFis9K%2FPRID1uM14Q%3D%3D&trackingId=ud3%2BU%2FEgH9iXalze42sxOA%3D%3D"
}