{
    "job_id": "4139628021",
    "title": "Data Scientist",
    "company": "People Tech Group Inc",
    "location": "Hyderabad, Telangana, India",
    "description": "Hi Connections,\n\n\n\n\nWe are hiring for Data Science, Please find below Job Description.\n\n\n\n\nRole Overview: We are seeking a Data Scientist with 3+ years of experience to develop and implement analytical models, perform deep analyses, and derive actionable insights from complex data sets. This role requires expertise in Python, SQL, machine learning, and NLP, along with hands-on experience in data visualization and cloud technologies.\n\n\n\n\nKey Responsibilities:\n\nData Analysis and Modeling: Design, build, and deploy machine learning and deep learning models to address business challenges. Utilize Python, SQL, and related tools for data manipulation and analysis.\nNatural Language Processing: Apply advanced NLP techniques using libraries such as SpaCy, NLTK, and Transformers for tasks like text classification, sentiment analysis, and named entity recognition.\nComputer Vision: Implement computer vision solutions to analyze and interpret visual data.\nData Visualization: Create visualizations and dashboards to effectively communicate insights using tools like Matplotlib, Seaborn, or similar.\nMLOps: Develop and manage MLOps pipelines for model deployment and monitoring using AWS, Docker, and FastAPI.\nGenerative AI and RAG: Work on generative AI models and retrieval-augmented generation (RAG) techniques, leveraging frameworks such as LangChain and Hugging Face.\nVector Databases and Multi-Model Approaches: Utilize vector databases and multi-vector methods to enhance retrieval and similarity tasks.\nKnowledge Graphs and Advanced RAG: Incorporate knowledge graphs and advanced RAG strategies for improved data retrieval and information extraction.\nCollaboration: Work with product managers, engineers, and other stakeholders to convert business requirements into technical solutions. Communicate findings clearly to both technical and non-technical audiences.\n\n\n\n\nBasic Qualifications:\n\nBachelor’s degree in Computer Science, Data Science, Statistics, Mathematics, or a related field.\n3+ years of professional experience in data science or a similar role.\nProficiency in Python and SQL.\nSolid experience with machine learning and deep learning frameworks (e.g., TensorFlow, PyTorch).\nExperience with NLP techniques and tools (e.g., SpaCy, NLTK).\nHands-on experience in data visualization and interpretation.\nBasic understanding of MLOps practices and tools (e.g., AWS, Docker).\nFamiliarity with generative AI models and RAG techniques.\nKnowledge of vector databases and multi-vector approaches.\nAbility to work effectively in a collaborative team environment.\n\n\n\n\nRequired Qualifications:\n\nStrong experience in developing and deploying machine learning models.\nProficiency in implementing advanced NLP techniques.\nHands-on experience with computer vision applications.\nDemonstrated ability to create insightful data visualizations.\nPractical experience with MLOps, including deploying models using cloud platforms like AWS and containerization tools like Docker.\nExperience with generative AI and RAG frameworks, including LangChain and Hugging Face.\nUnderstanding of knowledge graphs and advanced RAG methodologies.\n\n\n\n\nInterested candidate can share resume at kratika.rojade@peopletech.com\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-people-tech-group-inc-4139628021?position=5&pageNum=15&refId=YOJOA8ecJcY65rMZmx6Etg%3D%3D&trackingId=Bpzm5ntySRo9tSExIeFqgQ%3D%3D"
}