{
    "job_id": "4139169498",
    "title": "Data Scientist",
    "company": "ACG World",
    "location": "Mumbai, Maharashtra, India",
    "description": "Role Title: Data Scientist\n\nFunction / Department: Corporate Digitalization and Analytics\n\nLocation: Jogeshwari, Mumbai (On-Site) / Chennai (On-Site)\n\n\n\n\nAbout the Role: We are seeking an experienced Data Scientist (4-6 years) to lead AI-driven transformation in a globally recognized Pharma Manufacturing IIoT environment. Our AI/ML use cases have received recognition from the World Economic Forum's Global Lighthouse Network, making this a high-impact, innovation-driven role.\n\nThis position involves leading multiple use cases, working on exploratory technologies, and experimenting with cutting-edge AI tools. The role also entails working on vision-based use cases using quadrupeds (robotic systems) for industrial automation and process optimization.\n\n\n\n\nWhy Join Us?\n\nBe part of AI projects recognized by the World Economic Forum's Global Lighthouse Network.\nLead AI-driven decision-making & automation in a high-impact, mission-critical pharma environment.\nExperiment with AI innovations & next-gen robotics (quadrupeds, computer vision).\nCollaborate with top industry experts in a future-focused, technology-driven environment.\n\n\n\n\nKey Responsibilities:\n\nLead AI-Driven Use Cases: Develop and deploy machine learning models for predictive maintenance, yield optimization, and quality control.\nComputer Vision & Robotics Integration: Build and optimize vision-based analytics for Quadrupeds to automate inspections and detect anomalies.\nCutting-Edge Generative AI & NLP: Implement Generative AI models (e.g., GANs, Transformers) for manufacturing insights and process automation.\nBig Data Processing & AI Pipelines: Work with IIoT data streams, industrial sensors, and unstructured datasets for scalable AI deployment.\nInteractive Analytics & Decision Intelligence: Develop high-impact dashboards and visualizations for leadership decision-making.\nResearch & Experimentation: Explore and implement new AI tools and emerging technologies for digital transformation.\n\n\n\n\nQualifications:\n\nEducation:\n\nBachelor's degree in Engineering or a Master's in Statistics, Computer Science, IT, Analytics, or related fields.\n\nTechnical Skills:\n\nProgramming: Proficiency in Python and libraries such as NumPy, pandas, scikit-learn.\nMachine Learning & Deep Learning: Experience with TensorFlow, PyTorch, and classical ML models.\nComputer Vision: Familiarity with OpenCV, object detection models, and industrial vision analytics.\nGenerative AI: Exposure to GANs, NLP models, and Transformers.\nBig Data & IIoT: Experience with data pipelines, ETL processes, and IIoT data streams.\nVisualization: Expertise in Tableau, Power BI, or Plotly for interactive dashboards.\nGood to have: MLOps, Exposure to Azure or similar cloud platforms\n\n\n\n\nSkills and Competencies:\n\nStrategic Thinker: Ability to drive AI-powered decision-making in a fast-paced industrial setting.\nTech Explorer: Passion for working on emerging AI technologies, robotics, and experimental AI models.\nCollaboration & Leadership: Comfortable working with cross-functional teams and leading projects.\nProblem-Solving Mindset: Strong analytical skills to handle complex industrial datasets and drive impact.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-acg-world-4139169498?position=37&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=xM4cH55gp9SfH7%2FAbcZAkw%3D%3D"
}