{
    "job_id": "4140216001",
    "title": "Business Analyst - US Healthcare Industry - Software Product",
    "company": "Pivotrics",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Summary:\n\nWe are seeking a highly skilled Business Analyst with 8-15 years of experience, including a background as a software developer or QA engineer in the US healthcare domain. The ideal candidate will possess rich technical experience in developing or testing software products targeting the US healthcare market and have a deep understanding of industry standards, payer-provider workflows, and regulatory compliance. Strong communication skills and the ability to collaborate with both business stakeholders and technical teams are essential for success in this role.\n\n\n\n\nRequired Skills & Qualifications:\n\n8-15 years of experience in roles such as software developer, QA engineer, or business analyst in US healthcare software development.\nDeep understanding of healthcare industry workflows, including payer, provider, claims, and billing systems.\nExperience with healthcare regulatory frameworks like HIPAA, Medicare/Medicaid, CMS compliance, and ACA.\nTechnical proficiency, including knowledge of API integration, data models, and healthcare data standards (EDI, FHIR, HL7).\nFamiliarity with Agile development processes and tools like JIRA, Confluence, and Trello.\nStrong communication skills, with the ability to engage business and technical stakeholders.\nAnalytical and problem-solving abilities, with a focus on improving software products for complex healthcare systems.\nPrior experience developing or testing healthcare payer/provider software products.\nKnowledge of SaaS models and cloud-based healthcare platforms.\n\n\n\n\nKey Responsibilities:\n\nDomain Expertise:\n\nAct as a subject matter expert (SME) in US healthcare software, with knowledge of:\n\nPayer and provider workflows (e.g., enrollment, eligibility, claims processing, billing, provider networks).\nRegulatory and compliance requirements such as HIPAA, CMS guidelines, Medicare/Medicaid, and ACA regulations.\nHealthcare data standards, including EDI (837, 835, 270/271) and FHIR, HL7.\n\n\n\n\nRequirement Gathering & Analysis:\n\nWork with stakeholders from both technical and business units to gather, analyze, and document software product requirements.\nLeverage prior development or QA experience to ensure technical feasibility and alignment with healthcare regulations and business objectives.\nPerform gap analysis to identify improvements in existing healthcare products and workflows.\n\n\n\n\nProduct Development Support:\n\nCollaborate with software development teams, offering technical and domain expertise to guide product design and implementation.\nEnsure that key product features (e.g., claims management, provider portals, member services) meet healthcare business requirements and compliance standards.\nSupport integration efforts with EHR/EMR systems, payer and provider networks, and external healthcare platforms.\n\n\n\n\nCommunication & Collaboration:\n\nServe as a bridge between business stakeholders and technical teams, facilitating effective communication to drive product success.\nConduct and lead workshops, discovery sessions, and sprint planning meetings to align on product goals and deliverables.\nPresent updates, solutions, and key insights to clients, stakeholders, and senior management.\n\n\n\n\nTesting & Quality Assurance:\n\nSupport QA teams by reviewing and validating test cases against business and regulatory requirements.\nParticipate in user acceptance testing (UAT) to ensure healthcare software products meet business expectations.\nUtilize prior QA experience to help troubleshoot complex issues related to healthcare data workflows, compliance, and integrations.\n\nDocumentation:\n\nMaintain detailed documentation, including business process flows, system requirements, and technical integration points.\nDevelop training and support materials for end-users and stakeholders.\n\n\n\n\n\n\n\n\n\n\nBenefits:\n\nCompetitive salary and performance-based bonuses.\nWork with product engineering professional to gain valuable career guidance\nCollaborative, innovative, and growth-focused work environment.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-us-healthcare-industry-software-product-at-pivotrics-4140216001?position=1&pageNum=60&refId=RBk3qTVB%2BCNiFfiLUXOVnA%3D%3D&trackingId=T0cFVgf2fT7ONDQmL5JRzA%3D%3D"
}