{
    "job_id": "4141921398",
    "title": "Data Analyst Power BI",
    "company": "Walmart Global Tech India",
    "location": "Greater Chennai Area",
    "description": "What you'll do:\n\nDevelop and maintain daily, weekly and monthly report on operational metrics.\nConduct data and business analysis, and present summary of findings to management in a clear, concise, convincing, and actionable format\nCreate and maintain accurate Agent Database at all stages (Hiring, Training, Nesting, Production and Movement between LOBs)\nCreate and maintain Agent Scorecards to track and report on KPIs\nCreate and maintain all payroll related input detail\nCreate and maintain Attrition Dashboard\nGenerate and distribute management reports in accurate, and timely manner\nDevelops MIS documentation to allow for smooth operations and easy system maintenance\nProvide recommendations to improve reporting efficiency and consistency\nPerform data analysis for generating reports on periodic basis\nProvide strong reporting and analytical information support to management team\nGenerate both periodic and ad hoc reports as and when needed\nAnalyze business information to identify process improvements for increasing business efficiency and effectiveness.\nEstablish a strong relationship with Team Managers and Management through a demonstration of industry knowledge and of the business issues at hand\nCandidate should possess exceptional skills in preparing slide pack\n\n\n\n\n\n\n\nWhat you'll bring:\n\nBachelor's degree\nWilling to work in Rotational Shift\nAttention to detail and excellent analytical skills.\nEffective communication and interpersonal skills.\nExcellent problem-solving and management skills.\nExcellent Proficiency in Excel, Power BI and SQL\n\n\n\n\n\n\n\nAbout Walmart Global Tech\n\nImagine working in an environment where one line of code can make life easier for hundreds of millions of people. That’s what we do at Walmart Global Tech. We’re a team of software engineers, data scientists, cybersecurity expert's and service professionals within the world’s leading retailer who make an epic impact and are at the forefront of the next retail disruption. People are why we innovate, and people power our innovations. We are people-led and tech-empowered. We train our team in the skillsets of the future and bring in experts like you to help us grow. We have roles for those chasing their first opportunity as well as those looking for the opportunity that will define their career. Here, you can kickstart a great career in tech, gain new skills and experience for virtually every industry, or leverage your expertise to innovate at scale, impact millions and reimagine the future of retail.\n\nFlexible, hybrid work:\n\nWe use a hybrid way of working that is primarily in office coupled with virtual when not onsite. Our campuses serve as a hub to enhance collaboration, bring us together for purpose and deliver on business needs. This approach helps us make quicker decisions, remove location barriers across our global team and be more flexible in our personal lives.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-analyst-power-bi-at-walmart-global-tech-india-4141921398?position=1&pageNum=0&refId=BZHRvUcLUc4bYfhU1pUsCg%3D%3D&trackingId=JLTE6xxrBpraxuWgmDmv5g%3D%3D"
}