{
    "job_id": "4141984804",
    "title": "Applied Machine Learning Engineer",
    "company": "Avataar",
    "location": "Bengaluru, Karnataka, India",
    "description": "About the role:\n\n\n\n\nApplied Machine Learning Engineer (Applied ML & Model Development): Focuses more on AR, 3D reconstruction, and ML-driven product development; the role should reflect both the algorithmic research, developing ML models, training, optimizing the inferences from scratch, and developing the real-world application.\n\n\n\n\nAs an Applied ML Engineer, you'll play a key role in developing cutting-edge features for Avataar's Creator product, harnessing the latest advancements in GenAI Vision Models and LLMs to build AI systems that help brands create visual content for their products at scale. You'll collaborate closely with both product and engineering teams, managing the entire feature development process from initial concept to deployment.\n\n\n\n\nYou may be a good fit if you:\n\n\n\n\nHave 3+ years of relevant engineering experience in Computer Vision or large scale Machine Learning systems.\nResponsible for ML designing, training, and optimizing ML models while ensuring their seamless integration into Avataar's products.\nHold a Bachelor's degree in Computer Science, Electrical Engineering, or a related field with a focus on artificial intelligence, or possess equivalent industry experience.\nAre proficient in PyTorch, Transformer libraries, model training and serving frameworks\nStrong preference for candidates with experience in architecting large scale ML systems\nOpen source contributions and GPU optimization experience is a huge plus.\nExperience of shipping ML products to end users\nExcel at problem-solving and can work both independently and collaboratively.\nStrong analytical skills\nAbility to bridge the gap between research innovation and applied AI product development\n\n\n\n\nAbout Avataar :\n\nAvataar is revolutionizing the industry with the power of spatial storytelling, moving into a new era of visual discovery by enabling generative AI-powered visual experiences. Our cutting-edge 3D/AR technology is being used to elevate the online shopping experience, pushing beyond the boundaries of conventional 2D images for industry giants across US and Asia. Our globally first AI-led Computer Vision platform takes a deep learning approach to enabling interactive experience creation for diverse enterprises, brands and users.\n\n\n\n\nAvataar is at the forefront of driving neural innovation and contributing to setting interoperable industry standards. The company’s strategic partnerships with major stakeholders such as Khronos, Nvidia, Meta, Google, AWS underscore its dedication to driving a revolutionary shift on a global scale, reimagining product experiences and visual discovery like never before. We’ve raised $45mm Series-B from top-tier global investors, including Tiger Global and Sequoia Capital\n\n\n\n\nThe tech team at Avataar engages in regular research discussions to encourage exploration and experimentation, and we actively participate in leading international conferences such as CVPR, Siggraph, and ECCV\n\n\n\n\nWork Location: Vaishnavi Tech Park, Sarjapur Main Road, Bellandur, Bengaluru\n\nMode of Work: Office [6 days of WFH options are available on a monthly basis. Any unused WFH days will be carried forward to the next month]\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/applied-machine-learning-engineer-at-avataar-4141984804?position=3&pageNum=20&refId=BnXhiVGngDlsLf9MWrlaFw%3D%3D&trackingId=P%2Bo4q0titYeSUsemQiV6cQ%3D%3D"
}