{
    "job_id": "4141022441",
    "title": "Business Analyst",
    "company": "AlphaSense",
    "location": "Mumbai, Maharashtra, India",
    "description": "About AlphaSense\n\nThe world’s most sophisticated companies rely on AlphaSense to remove uncertainty from decision-making. With market intelligence and search built on proven AI, AlphaSense delivers insights that matter from content you can trust. Our universe of public and private content includes equity research, company filings, event transcripts, expert calls, news, trade journals, and clients’ own research content.\n\nThe acquisition of Tegus by AlphaSense in 2024 advances our shared mission to empower professionals to make smarter decisions through AI-driven market intelligence. Together, AlphaSense and Tegus will accelerate growth, innovation, and content expansion, with complementary product and content capabilities that enable users to unearth even more comprehensive insights from thousands of content sets. Our platform is trusted by over 4,000 enterprise customers, including a majority of the S&P 500. Founded in 2011, AlphaSense is headquartered in New York City with more than 2,000 employees across the globe and offices in the U.S., U.K., Finland, India, Singapore, Canada, and Ireland. Come join us!\n\nAbout The Team\n\nThe Content organization is responsible for identifying, creating, licensing and integrating best-in-class unstructured and structured data that is both self-sourced and from third party content providers. The various Content teams report to the Chief Content Officer and have strategy, product management, operations and support responsibilities for each of the Content verticals- Research, Web Curation, Company Documents, and Structured Data. We have been experiencing a rapid growth cycle across all content sets. We value and uphold transparency, trust and accountability in our relationships within the team and with internal and external stakeholders.\n\nAbout The Role\n\nThe Business Analyst II will be part of a newly formed Content Strategy, Planning and Analysis team- a horizontal function working across all the lanes within the Content Organization. As a Content Analyst, you will work closely with the Product, Engineering, Finance, Legal, Operations and Revenue teams and contribute to the ideation, integration, and support of a variety of in-demand structured and unstructured content within our industry-leading AI platform (SaaS and Enterprise) and content strategy, and ultimately ensure we are successfully and continuously driving value for our users. The Content Analyst candidate we seek has experience in consulting, B2B SaaS and/or enterprise software application companies, with ideally a background in financial and corporate industries.\n\nThis role will report into the Director, Content Strategy, Planning & Analysis.\n\nRequired\n\nWho You Are:\n\n\nMinimum 3 or more years experience in business intelligence, data analysis and due diligence, having worked in consulting management, financial and corporate services industries.\nA critical thinker, with attention to detail and effective organizational skills, who is able to manage diverse data and build effective presentations for product and content leaders with actionable suggestions to improve or influence operational decision making.\nStrong analytical skills, and ability to identify patterns from complex data, produce accurate conclusions, and report critical information or recommendations.\nIdeally some experience with data manipulation in SQL/Python/R, and Data visualization using Tableau/PowerBI/Looker.\nPossess the ability to multitask and work effectively under time pressure; a willingness to contribute independently; an eagerness to continue learning new skills; and a drive to deliver tangible results.\nExceptional Excel/Word/PowerPoint/Google Sheets/Google Docs/Google Slides experience\n\n\nStrongly Preferred\n\n\nExcellent domain knowledge, and familiarity with functions and user workflows across-buy-side/sell-side, investment banking/private Equity/Venture capital, Corporate and Consulting\nSubject-matter expertise with content feeds, metadata, assorted document and data delivery types\nA proactive self-starter who is able to develop and maintain effective working relationships with the wider team across different global locations, and stays focused to meet deadlines\nStrong presentation and effective communication skills - both written and verbal in English\nBachelor's Degree in the information systems, statistics, computer science, business administration or a related field\nExperience with Product Development frameworks such as Agile, Kanban, etc., or process improvement methodologies such as SAFE or Six Sigma\n\n\nWhat You’ll Do\n\n\nConduct due diligence and comparative analysis of existing and prospective content sources, and partnerships with the aim to support the build out of business cases/proposals/cost-benefit analysis scenarios\nAddress ad hoc requests for data analysis and reporting, including usage, readership, coverage details across the AlphaSense content landscape and product offerings\nProvide support in investigating and/or addressing inquiries from internal and external stakeholders, including clients, vendors\nRun detailed data analysis to build dashboards and reporting in support of projects/programs, collaborating with Content Team and Business Intelligence functions\nTrack, process and manage content requests in ProductBoard, and generate reports, dashboards and content presentations\nTrack new industry trends, source new content sets, and compile competitive intelligence to better inform product and content strategy\nRapidly get up to speed on AlphaSense, programs, processes and tools and be able to manipulate data effectively\nSupport and identify internal process improvement opportunities, by performing a gap analysis of current and future state processes/workflows,and implementing the improved target state\nCollaborate with the Content Leaders, BI Analytics, Finance and other key stakeholders for content usage trends, opportunities for improvement, and ad hoc analysis for content strategy inputs\n\n\nAlphaSense is an equal-opportunity employer. We are committed to a work environment that supports, inspires, and respects all individuals. All employees share in the responsibility for fulfilling AlphaSense’s commitment to equal employment opportunity. AlphaSense does not discriminate against any employee or applicant on the basis of race, color, sex (including pregnancy), national origin, age, religion, marital status, sexual orientation, gender identity, gender expression, military or veteran status, disability, or any other non-merit factor. This policy applies to every aspect of employment at AlphaSense, including recruitment, hiring, training, advancement, and termination.\n\nIn addition, it is the policy of AlphaSense to provide reasonable accommodation to qualified employees who have protected disabilities to the extent required by applicable laws, regulations, and ordinances where a particular employee works.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-alphasense-4141022441?position=10&pageNum=35&refId=Qg1XFYd2a5oBsKA4VCuZSA%3D%3D&trackingId=MBfDZ1Hezr4qvfbxyWAnpA%3D%3D"
}