{
    "job_id": "4141622467",
    "title": "Junior Business Analyst",
    "company": "Inizio",
    "location": "Gurugram, Haryana, India",
    "description": "Key Responsibilities:\n\n\nLiaising with senior leadership and local project teams to establish project delivery requirements\nManaging multiple client projects and their timelines to meet both internal and client’s deadlines\nBuilding and maintaining MS Excel databases from source data\nAnalysing client data using quantitative and qualitative methods to evaluate key performance indicators\nPressure testing data and identifying areas for investigation and training\nCollaborating with Project leaders and local teams to interpret data and formulate action plans and recommendations for clients\nProduce high quality presentations and other deliverables for clients using powerpoint\nSupporting members in the analysis team to meet client deadlines and drive development and efficiencies within the team both locally and on international projects.\n\n\nKey Requirements:\n\n\nThe ideal candidate must have an Economics or Science based degree in subjects with numerical emphasis (such as Chemistry, Physics, Mathematics, Engineering etc.)\nA few years of experience in a similar analysis job within the Pharmaceutical industry is preferable\nStrong communication and project management skills to handle multiple projects with different stakeholders\nAdvanced Level experience in using Excel and Powerpoint\nProactive individual with drive and ambition, a strong work ethic to grow in a dynamic environment with good opportunities to help develop and further the business as a whole.\n\n\nDon't meet every job requirement? That's okay! Our company is dedicated to building a diverse, inclusive, and authentic workplace. If you're excited about this role, but your experience doesn't perfectly fit every qualification, we encourage you to apply anyway. You may be just the right person for this role or others.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/junior-business-analyst-at-inizio-4141622467?position=10&pageNum=5&refId=lj%2BaylP9Zxb0xcLPbmF98Q%3D%3D&trackingId=Hy%2BSYVTDpq6etZ5fxECnbA%3D%3D"
}