{
    "job_id": "4141622624",
    "title": "Associate Business Analyst",
    "company": "Allvue Systems",
    "location": "Pune, Maharashtra, India",
    "description": "Requirements:\n\n\n\n\n2-6 years relevant experience\nCFA or other relevant professional certification preferred\nFamiliarity with the investment lifecycle process for a loan from inception, analysis, approval, trading (on either the primary or secondary market) and the post close monitoring process.\nAbility to work with product owners across the Allvue Credit and Equity teams to ensure successful execution of multi-product milestones.\nExpert knowledge of industry concepts and how they apply to Allvue solutions\nExpert Understanding of the software development lifecycle and its related processes through the Release Phase, experience with AGILE development a plus\nStrong knowledge of Roadmap and Backlog Management\nExecute product delivery on time and within budgets\nExpert knowledge of system functionality to perform user story gathering for requirements analysis\nStrong knowledge of Roadmap and Backlog Management\n\nDomain Skills:\n\nSoftware Product Experience – Fund Accounting Systems would be preferred\nAsset classes - Loans, private loans, Loan Markets and documentation driven transactions\nB2B Enterprise Integrations - market data sources, reference data sources (Markit, Bloomberg) Back-office Systems - Fund Accounting and Investment Accounting (WSO web/admin, Virtus, Investran), Settlement Systems (Clearpar).\n\n\n\n\nResponsibilities:\n\nProvide subject matter expertise on the business processes supported by Allvue's software solutions\nGather requirements and produce Business Requirement Documents (BRDs) for client approval and subsequent implementation by the Allvue team\nPrescribe solutions to clients based on best practices and recommend process changes as needed\nConduct end-user training with a goal of ensuring widespread adoption of the Allvue software\nAbility to work with product owners across the Credit and Equity teams to ensure successful execution of multi-product milestones.\nWork with product managers to ensure the product vision is delivered in a high quality, structured way, understand the dependencies and be able to escalate the conflict and roadblocks to the Head of Product.\nWork with engineering counterparts to ensure a healthy backlog is maintained, and R&D cycles are as efficient and productive as possible\nCollaborate with engineering leadership to oversee execution across the product lifecycle, include requirements definitions, acceptance criteria, QA, and release.\nServe as voice of the user in developing product requirements.\nWork with customers and customer success teams to ensure successful delivery of the product and review feedback.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/associate-business-analyst-at-allvue-systems-4141622624?position=4&pageNum=25&refId=kluirdiBIoCee5yDSaO06g%3D%3D&trackingId=C1FFBjB72H3y943603aeRg%3D%3D"
}