{
    "job_id": "4141634177",
    "title": "Capital- BA",
    "company": "Deloitte",
    "location": "Hyderabad, Telangana, India",
    "description": "What impact will you make?\n\n\n\n\nEvery day, your work will make an impact that matters, while you thrive in a dynamic culture of inclusion, collaboration and high performance. As the undisputed leader in professional services, Deloitte is where you’ll find unrivaled opportunities to succeed and realize your full potential.\n\n\n\n\nDeloitte is where you’ll find unrivaled opportunities to succeed and realize your full potential.\n\n\n\n\nThe Team\n\nDiscover the various Financial Risk services, we offer to help organizations across the full life cycle of financial transaction. From governance and processes to technology and reporting, our services can enhance transparency, efficiency, compliance, and financial integrity.\n\n\n\n\n\n\n\nWork you’ll do\n\n\n\n\nCapital Reporting expertise:\n\n\n\n\nLead the development and delivery of regulatory capital reports to relevant authorities according to established deadlines and standards (e.g., Basel III, Pillar 3 reports).\nIn-depth understanding of key capital adequacy ratios like Tier 1 capital, total capital ratio, and risk-weighted assets (RWA).\nMonitoring regulatory changes and implementing necessary adjustments to reporting processes.\nDraft, analyze, and maintain BRDs for regulatory programs, ensuring alignment with regulatory objectives.\nFacilitate workshops and discussions with stakeholders to gather requirements effectively.\nParticipate in Agile ceremonies, including sprint planning and retrospectives, to enhance project delivery.\nCollaborate with cross-functional teams to implement solutions that improve treasury operations.\nUtilize Qlik and Qlik Sense for data visualization to present insights on liquidity and risk metrics.\nConduct ad-hoc analysis as required to support treasury initiatives.\n\n\n\n\nKey Responsibilities:\n\n\n\n\nRequirement Gathering & Analysis\n\nWork with business stakeholders, including finance, treasury, risk management, and compliance teams, to gather and document capital reporting requirements.\nAnalyze current capital reporting processes and systems, identifying areas for improvement or automation.\nTranslate business requirements into functional specifications for technical teams.\n\nCapital Reporting Process Design\n\nDesign and document efficient capital reporting workflows, ensuring data accuracy and timeliness.\nEnsure that reporting outputs align with internal and regulatory requirements, such as capital adequacy, liquidity, and solvency ratios.\nCollaborate with IT and data teams to define data structures, reporting formats, and delivery methods.\n\nSystem Implementation & Support\n\nAct as a liaison between business users and technical teams to ensure smooth implementation of capital reporting solutions.\nParticipate in testing and validation of capital reporting systems to ensure that reports meet business needs and regulatory standards.\nProvide ongoing support and troubleshooting for capital reporting tools and systems.\n\nDocumentation & Training\n\nCreate and maintain detailed documentation for capital reporting processes, system configurations, and user guides.\nTrain end-users on new or updated capital reporting tools and processes.\n\nData Analysis & Reporting\n\nAnalyze data sources and reporting outputs to ensure consistency and accuracy of capital reporting metrics.\nProvide insights into capital reporting trends and performance, helping to drive business decision-making.\n\nStakeholder Communication\n\nRegularly communicate with senior management and stakeholders on project progress, challenges, and solutions.\nCollaborate with external auditors, regulators, and other third parties as necessary for capital reporting purposes.\n\nContinuous Improvement\n\nStay updated on changes in capital reporting regulations and industry best practices.\nRecommend and implement improvements to the capital reporting process and system functionality.\n\n\n\n\nRequirements:\n\n\n\n\nEducation: Bachelor’s degree in finance, Accounting, Business Administration, or a related field. An MBA is preferred.\nExperience: 5 to 10 years of experience as a Business Analyst in financial services, specifically focusing on Capital reporting.\nTechnical Skills: Proficiency in Qlik and Qlik Sense for data analysis and reporting.\nAnalytical Skills: Excellent analytical skills with the ability to interpret complex data.\nCommunication Skills: Strong verbal and written communication skills with the ability to present findings clearly to stakeholders.\nMethodology Knowledge: Familiarity with Agile methodologies and experience working in Agile environments.\n\n\n\n\nYour role as a leader\n\n\n\n\nAt Deloitte India, we believe in the importance of leadership at all levels. We expect our people to embrace and live our purpose by challenging themselves to identify issues that are most important for our clients, our people, and for society and make an impact that matters.\n\n\n\n\nIn addition to living our purpose, Assistant Manager across our organization:\n\n\n\n\n• Builds own understanding of our purpose and values; explores opportunities for impact\n\n•Demonstrates strong commitment to personal learning and development; acts as a brand\n\nambassador to help attract top talent\n\n• Understands expectations and demonstrates personal accountability for keeping performance on track\n\n• Actively focuses on developing effective communication and relationship-building skills\n\n• Understands how their daily work contributes to the priorities of the team and the business\n\n\n\n\nHow you’ll grow\n\n\n\n\nAt Deloitte, our professional development plan focuses on helping people at every level of their career to identify and use their strengths to do their best work every day. From entry-level employees to senior leaders, we believe there’s always room to learn. We offer opportunities to help build world-class skills in addition to hands-on experience in the global, fast-changing\n\n\n\n\nbusiness world. From on-the-job learning experiences to formal development programs at Deloitte University, our professionals have a variety of opportunities to continue to grow throughout their career. Explore Deloitte University, The Leadership Centre.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/capital-ba-at-deloitte-4141634177?position=1&pageNum=2&refId=dmyDsuYITNpOArSK52WyDg%3D%3D&trackingId=5MKWnoVn7eDlY4L0OfEAdw%3D%3D"
}