{
    "job_id": "4142996676",
    "title": "Functional Business Analyst",
    "company": "ValueLabs",
    "location": "Greater Hyderabad Area",
    "description": "Note: Looking for Immediate Joiner.\n\n\n\n\nJob Title: Functional Business Analyst\n\nJob Summary:\n\nWe are seeking an experienced Functional Business Analyst to join our team immediately. The ideal candidate will have a strong background in business analysis, with experience in gathering and documenting business requirements, developing business cases, and implementing process improvements. The successful candidate will be responsible for working closely with stakeholders to understand business needs and develop solutions that meet those needs.\n\nKey Responsibilities:\n\nGather and document business requirements through interviews, surveys, and other research methods.\nDevelop and maintain business cases, including cost-benefit analyses and return on investment (ROI) calculations.\nAnalyze business processes and identify areas for improvement.\nDevelop and implement process improvements, including workflow changes and system updates.\nCollaborate with stakeholders to understand business needs and develop solutions that meet those needs.\nDevelop and maintain business requirements documentation (BRD), including functional and non-functional requirements.\nDevelop and maintain business process documentation, including process maps and flowcharts.\nParticipate in business process re-engineering (BPR) initiatives to improve business efficiency and effectiveness.\nCollaborate with IT teams to develop and implement system solutions that meet business needs.\nDevelop and maintain business metrics and key performance indicators (KPIs) to measure business performance.\nStay up-to-date with industry trends and best practices in business analysis.\n\nRequirements:\n\n3+ years of experience in business analysis, including experience in gathering and documenting business requirements.\nStrong understanding of business analysis methodologies, including BABOK and Business Analysis Body of Knowledge.\nExperience with business process modeling, including process maps and flowcharts.\nExperience with business requirements documentation, including functional and non-functional requirements.\nExperience with business case development, including cost-benefit analyses and ROI calculations.\nStrong analytical and problem-solving skills, with the ability to analyze complex business problems and develop effective solutions.\nExcellent communication and collaboration skills, with the ability to work effectively with stakeholders and IT teams.\nExperience with agile development methodologies, including Scrum and Kanban.\nFamiliarity with business architecture and enterprise architecture frameworks.\nExperience with IT service management (ITSM) tools, including ServiceNow and BMC Helix.\n\nNice to Have:\n\nExperience with business intelligence (BI) tools, including data visualization and reporting.\nExperience with data analytics, including data mining and predictive analytics.\nExperience with cloud-based services, including AWS and Google Cloud Platform.\nExperience with containerization technologies, including Docker and Kubernetes.\nExperience with machine learning and artificial intelligence, including TensorFlow and PyTorch.\n\nImmediate Joiner:\n\nWe are looking for an experienced Functional Business Analyst to join our team immediately.\nThe ideal candidate will have a strong background in business analysis, with experience in gathering and documenting business requirements, and be able to start working on day one.\nWe offer a competitive salary and benefits package, as well as opportunities for career growth and professional development.\n\nWhat We Offer:\n\nCompetitive salary and benefits package.\nOpportunities for career growth and professional development.\nCollaborative and dynamic work environment.\nFlexible working hours and remote work options.\nAccess to cutting-edge business analysis tools and technologies.\nRecognition and rewards for outstanding performance.\n\n\n\n\n\n\n\n\n\n\nNote: Looking for Immediate Joiner.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/functional-business-analyst-at-valuelabs-4142996676?position=41&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=NmjFuKNI1K%2BLIuAwKYJk%2Bg%3D%3D"
}