{
    "job_id": "4142498287",
    "title": "Business Analyst",
    "company": "BT Group",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Req ID:\n\nPosting Date:\n\nFunction:\n\nLocation:\n\nSalary:\n\nWhy this job matters\n\nThe Agile Business Analysis Specialist executes a range of workstreams in delivering Agile initiatives as a key member of the Agile delivery team working closely with business stakeholders and product owners to shape the analysis of business processes, elicit requirements and transform these into opportunities for development teams.\n\nWhat You’ll Be Doing\n\n1 - Drives the solutions to business problems providing functional/domain expertise to identify, evaluate and develop systems and applications that are cost-effective and meet user requirements.\n\n2 - Collaborates with technical delivery teams to ensure that internal processes are documented appropriately as well as any external facing documentation is well informed.\n\n3 - Collaborates with internal stakeholders and help execute a business technology strategy that meets user expectations, provide operational and process efficiency, and builds team knowledge.\n\n\nMentors other Business Analysis professionals, helping to improve the team's abilities by acting as a technical resource.\nChampions, continuously develops and shares with team knowledge on emerging trends and changes in Business Analysis.\nEnsures positive change throughout the full project lifecycle, from the initial benefits case through to detailed scoping/design, operational readiness and to support benefits realisation once live.\nImplements key metrics and analytics that will allow management to clearly understand outcomes achieved against expectations, delivering insightful analysis and recommendations to optimise results.\nSupports coaching new teams on Agile ways of working, in relation to design and analysis activities.\nDrives value-based scoping at a workstream level, providing recommendations of the minimum viable product and break down of scope into logical features and phases of development/delivery.\nAssesses business risk and issues, details business impact creating mitigation plans, including any handover or operational early life support for a smooth transition.\n\n\nThe Skills You’ll Need\n\nCollaboration\n\nAgile Development\n\nData Modelling\n\nRequirements Gathering\n\nProblem Solving\n\nValue Stream Mapping\n\nStakeholder Management\n\nBusiness Analysis\n\nSystems Thinking\n\nData Analysis\n\nProcess Design\n\nRequirements Management\n\nBusiness Partnering & Consulting\n\nDesign Thinking\n\nUser Centred Design\n\nDecision Making\n\nGrowth Mindset\n\nInclusive Leadership\n\nOur leadership standards\n\nLooking in:\n\nLeading inclusively and Safely\n\nI inspire and build trust through self-awareness, honesty and integrity.\n\nOwning outcomes\n\nI take the right decisions that benefit the broader organisation.\n\nLooking out:\n\nDelivering for the customer\n\nI execute brilliantly on clear priorities that add value to our customers and the wider business.\n\nCommercially savvy\n\nI demonstrate strong commercial focus, bringing an external perspective to decision-making.\n\nLooking to the future:\n\nGrowth mindset\n\nI experiment and identify opportunities for growth for both myself and the organisation.\n\nBuilding for the future\n\nI build diverse future-ready teams where all individuals can be at their best.\n\nWith over 175 years of heritage, BT is now the flagship business brand of BT Group. We’ve brought together our best people and capabilities into a B2B powerhouse serving 1 -2 million business customers internationally.\n\nWe’re a global leader for secure connectivity and collaboration platforms for businesses of all shapes and sizes, from big household names and government departments, right through to sole traders and new start-ups. But it’s not just the technology that matters, it’s what it can do to help them build stronger, smarter, more secure businesses.\n\nWe value diversity and inclusion and believe in making a positive impact. We connect for good by championing digital inclusion and equipping people, businesses, and communities with digital skills to thrive.\n\nAs a member of our team, you will be part of an organisation that celebrates difference, fosters innovation and provides you with opportunities to be your best. With millions of businesses relying on us daily, joining BT means you can be part of a diverse and multi-skilled team that makes a significant impact to society.\n\nA FEW POINTS TO NOTE:\n\nAlthough these roles are listed as full-time, if you’re a job share partnership, work reduced hours, or any other way of working flexibly, please still get in touch.\n\nWe will also offer reasonable adjustments for the selection process if required, so please do not hesitate to inform us.\n\nDON'T MEET EVERY SINGLE REQUIREMENT?\n\nStudies have shown that women and people who are disabled, LGBTQ+, neurodiverse or from ethnic minority backgrounds are less likely to apply for jobs unless they meet every single qualification and criteria. We're committed to building a diverse, inclusive, and authentic workplace where everyone can be their best, so if you're excited about this role but your past experience doesn't align perfectly with every requirement on the Job Description, please apply anyway - you may just be the right candidate for this or other roles in our wider team.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-bt-group-4142498287?position=7&pageNum=12&refId=0qwF5I591Ogz%2FBtLFZTetg%3D%3D&trackingId=yhlNZ5E3vnbQGCTdLhFnjQ%3D%3D"
}