{
    "job_id": "4142972754",
    "title": "Business Analyst Lending",
    "company": "Saransh Inc",
    "location": "Hyderabad, Telangana, India",
    "description": "Job Title: Business Analyst – Lending & Risk Domain\n\nLocation: Hyderabad, India\n\nExperience: 6 - 11 years\n\n\n\n\nJob Description:\n\nWe are seeking a highly skilled Business Analyst with expertise in the Lending and Risk domain to join our team in Hyderabad. The ideal candidate should have strong experience in Capital Market Products, Credit/Margin Lending, and Wealth Management.\n\n\n\n\nKey Responsibilities:\n\nGather, analyze, and document business requirements by preparing BRDs, FRDs, Epics, and User Stories.\nConduct requirement clarification and triage calls with stakeholders across diverse geographies.\nUtilize SQL to run queries and analyze data independently.\nFacilitate discussions with business teams, developers, and testing teams, ensuring smooth project execution.\nCreate data flow diagrams, process workflows (Visio/Confluence), and presentation decks as required.\nWork within Agile methodologies (Scrum, Kanban, SAFe) and actively contribute to Agile ceremonies.\nManage tasks and documentation using JIRA, Confluence, SDLC frameworks.\nSupport business stakeholders with data-driven insights, leveraging strong analytical skills.\nEnsure seamless collaboration with cross-functional teams throughout the project lifecycle.\n\n\n\n\nKey Skills & Experience Required:\n\n5+ years of experience as a Business Analyst in Lending, Risk, or Wealth Management domains.\nStrong understanding of Capital Market Products, Credit/Margin Lending.\nProven expertise in data visualization and analysis for business reporting.\nExcellent communication, documentation, and negotiation skills.\nHands-on experience in SQL for data analysis and report generation.\nProficiency in MS Excel (Advanced), SharePoint, MS Word, and PowerPoint.\nExperience using JIRA and Confluence for Agile project management.\nExperience in BI tools (Power BI, Tableau, etc.) is a plus but not mandatory.\nRelevant certifications (Agile, Business Analysis, Project Management, or SQL-related) are preferred.\n\n\n\n\nPreferred Qualifications:\n\nBachelor's or Master's degree in Finance, Business, IT, or a related field.\nCertifications in Agile (CSM, SAFe), Business Analysis (CBAP, CCBA), or SQL are advantageous.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-lending-at-saransh-inc-4142972754?position=1&pageNum=22&refId=0jgrzIiQy2IEpj2UlbmQnQ%3D%3D&trackingId=VRqBlkGggSJPnXwKANtPmQ%3D%3D"
}