{
    "job_id": "4142793211",
    "title": "Machine Learning Engineer - 3",
    "company": "ShareChat",
    "location": "Bengaluru, Karnataka, India",
    "description": "Senior / Lead Machine Learning Engineer, Sharechat\n\n\n\n\nWho are we and What do we do?\n\nShareChat (https://sharechat.com/about) is India's largest homegrown social media company, with 400+ million monthly active users across all its platforms including Moj, a leading short video app which was launched in a record 30 hours.\n\nFounded in October 2015, with a vision of building an inclusive community that encourages & empowers each individual to share their unique journey and valuable experiences with confidence.\n\nShareChat is valued at $5 bn. We are spearheading India's internet revolution by building products through world-class AI & tech to evangelize the content ecosystem for India in regional languages.\n\nWe believe in complete ownership of problem-solving while committing to speed and integrity in everything we do. We place the utmost importance on user empathy & strive to work towards creating a world-class experience for them every day. Join us to drive how the next billion users will interact on the internet!\n\n\n\n\nWhat does the team do?\n\nEnsuring platform safety and integrity through AI driven moderation of user uploaded content across Moj and Sharechat which includes multimedia posts, live streams, chatrooms and comments. Leverage cutting-edge NLP and CV algorithms for effectively detecting and preventing harmful content among millions of daily uploaded content. As part of the Trust and Safety team, you will design and develop machine learning models that identify and mitigate risks on our platform.\n\n\n\n\nWhat You’ll Do?\n\nWe are seeking a highly skilled Machine Learning Engineer to join our Trust and Safety team. You will be designing, developing and deploying models that detect and prevent harmful content on our platform.\n\nThe role gives you the opportunity to:\n\nDesign and implement pipelines for data collection and processing.\nDesign solution for detecting NSFW visual/textual content using NLP/CV.\nConduct experiments and document the results on a regular basis.\nCode up the solution and conduct extensive offline experiments for validating the solution.\nMonitor the deployed solution and make iterative improvements.\nCollaborate with peers and stakeholders to define problem areas and deliver actionable solutions.\nContribute to research and development efforts in Trust and Safety to stay ahead of threats.\n\n\n\n\nWho are you?\n\n5+ years of industry experience with solid understanding of Machine Learning Fundamentals.\nExperience in distributed systems and shipping machine learning models to the production.\nExperience in developing end-to-end solutions for problems specific to either Computer Vision / Natural Language Processing.\nProficiency in Python and good knowledge of deep learning frameworks like Tensorflow / PyTorch. Experience with OpenCV / NLTK is a bonus.\nAwareness of recent research publications (specific to domain) and ability to translate them into working code.\nOwnership of the problem and drive to deliver results.\nAbility to work in an ambiguous problem setting and collaborate with others to drive clarity. Strong focus towards action and rapid iteration in a fast paced environment.\n\n\n\n\nWhere you’ll be?\n\nBengaluru, Karnataka, India\n\n\n\n\nKnow more about us:\n\nAI @ ShareChat | AI Projects @ ShareChat/\nScaling AI to billion users\nShareChat Ads\nGet to know our Co-Founder & CEO YT\nGet to know our Co-Founder & CEO Spotify\nOur Blog\n\n\n\n\nWhat's in it for you?\n\nAt ShareChat, our values - Ownership, Speed, User Empathy, Integrity, and First Principles - are at the core of our ways of working. We believe in hiring top talent and grooming future leaders by providing a flexible environment to aid growth and development. We also offer several benefits to our employees - like ESOPs, monthly childcare allowance for women employees, insurance coverage, and more.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/machine-learning-engineer-3-at-sharechat-4142793211?position=6&pageNum=20&refId=BnXhiVGngDlsLf9MWrlaFw%3D%3D&trackingId=Elyr7u6BimTha2cx5YCa5A%3D%3D"
}