{
    "job_id": "4142683755",
    "title": "Business Analyst - Cash Management Group",
    "company": "BlackRock",
    "location": "Gurgaon, Haryana, India",
    "description": "About This Role\n\nBlackRock is one of the world’s preeminent asset management firms and a premier provider of global investment management, risk management and advisory services to institutional, intermediary and individual investors around the world. BlackRock offers a range of solutions — from rigorous fundamental and quantitative active management approaches aimed at maximizing outperformance to highly efficient indexing strategies designed to gain broad exposure to the world’s capital markets. Our clients can access our investment solutions through a variety of product structures, including individual and institutional separate accounts, mutual funds and other pooled investment vehicles, and the industry-leading iShares® ETFs.\n\nBusiness Unit Overview:\n\nThe Cash Management Group manages a suite of products that includes Prime and Government Money Market and Ultra-Short Duration Mutual funds and Separate Accounts. BlackRock’s cash management style is designed to meet each client’s objectives of capital preservation, liquidity and yield – in that order. This philosophy is built on a risk-controlled framework, featuring careful analysis of credit, interest rate trends, and relative value opportunities which ultimately produce investment returns on a risk adjusted basis. Our disciplined approach to investing originated in 1973 when we pioneered the first constant-dollar money market fund dedicated to institutional investors.\n\nThe Cachematrix Technical Product Strategy team is part of the Global Cash Management team. The team works directly with the Cachematrix Liquidity Management platform, which is a single instance, multi-tenant software as a service (SaaS) based product. It powers custom trading solutions for many of the world’s leading and most innovative financial institutions, including regional and global banks and asset management firms. The platform can be integrated into any core cash management system as a seamless, single sign-on module or operate as a stand-alone system.\n\nJob Purpose/Background/Responsibilities:\n\nThe Cachematrix team is seeking a Junior Technical Product Strategist to support the global product function, with a diverse set of responsibilities encompassing business analysis, testing and product ownership.\n\nAbout This Role\n\nWe are looking for someone to work as a liaison among stakeholders to elicit, analyze, document and validate requirements for new features and changes to business processes, policies and information systems. The ideal candidate understands business problems and opportunities in the context of the requirements and recommends solutions that enable the project team to achieve its goals. The ideal candidate has strong communication and organization skills, and the ability to manage multiple projects effectively, while working with cross-functional teams.\n\nRoles & Responsibilities:\n\nAnalysis and Solution Definition\n\n\nCollaborate with stakeholders to gather and document business requirements.\nCreate and maintain Business Requirement Documents (BRDs), Functional Requirement Documents (FRDs) and Business Process Requirements (BPRs)\nDevelop and execute test strategy User acceptance testing (UAT) and provide feedback for improvements.\n\n\nTechnical Recommendation and Testing\n\n\nIdentify, document, report and track defects and issues.\nManage issue reporting and triage, providing timely escalation as needed.\n\n\nProject Execution and Support\n\n\nOffer business and platform support, ensuring smooth operations of platform.\nVendor data oversight to maintain data integrity, verifying accuracy and consistency reconcilation.\nSet up and oversight of client data extracts for seamless integrations.\nBuild and maintain reports, including ad-hoc reports and automated reports, to support business needs.\n\n\nCommunication\n\n\nDeliver support and training demos to stakeholders as required, and document operating models and handoff processes.\nResponsible for stakeholder management between business and development teams.\n\n\nPreferred Experience:\n\n\n1-3 years of experience as a Business Analyst or UAT Tester.\nBachelor’s degree in Business Administration, Information Technology, or a related field.\nStrong understanding of software development lifecycle (SDLC) and testing methodologies.\nExcellent analytical and problem-solving skills.\nFamiliarity with Agile & Scrum methodologies.\nIndustry knowledge of financial services and processes.\nExperience with JIRA, Confluence, Miro, Visio, Aha or similar tools.\nProficiency in SQL for querying and data analysis.\nExperience in building data visualization and business intelligence using tools such as Power BI, Tableau, Adobe Analytics, or similar platforms is preferred.\nFamiliarity with programming languages like Python.\n\n\n#EarlyCareers\n\nOur Benefits\n\nTo help you stay energized, engaged and inspired, we offer a wide range of benefits including a strong retirement plan, tuition reimbursement, comprehensive healthcare, support for working parents and Flexible Time Off (FTO) so you can relax, recharge and be there for the people you care about.\n\nOur hybrid work model\n\nBlackRock’s hybrid work model is designed to enable a culture of collaboration and apprenticeship that enriches the experience of our employees, while supporting flexibility for all. Employees are currently required to work at least 4 days in the office per week, with the flexibility to work from home 1 day a week. Some business groups may require more time in the office due to their roles and responsibilities. We remain focused on increasing the impactful moments that arise when we work together in person – aligned with our commitment to performance and innovation. As a new joiner, you can count on this hybrid model to accelerate your learning and onboarding experience here at BlackRock.\n\nAbout BlackRock\n\nAt BlackRock, we are all connected by one mission: to help more and more people experience financial well-being. Our clients, and the people they serve, are saving for retirement, paying for their children’s educations, buying homes and starting businesses. Their investments also help to strengthen the global economy: support businesses small and large; finance infrastructure projects that connect and power cities; and facilitate innovations that drive progress.\n\nThis mission would not be possible without our smartest investment – the one we make in our employees. It’s why we’re dedicated to creating an environment where our colleagues feel welcomed, valued and supported with networks, benefits and development opportunities to help them thrive.\n\nFor additional information on BlackRock, please visit @blackrock | Twitter: @blackrock | LinkedIn: www.linkedin.com/company/blackrock\n\nBlackRock is proud to be an Equal Opportunity Employer. We evaluate qualified applicants without regard to age, disability, family status, gender identity, race, religion, sex, sexual orientation and other protected attributes at law.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-cash-management-group-at-blackrock-4142683755?position=6&pageNum=75&refId=oawIpd1n3a%2BRa%2FbhSX9Nsw%3D%3D&trackingId=2BreLVTsYqmumFPslMS49A%3D%3D"
}