{
    "job_id": "4142496901",
    "title": "Business Analyst – Pelican",
    "company": "Capco",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Title: Senior Business Analyst – Pelican Programme\n\nAbout Us\n\n“Capco, a Wipro company, is a global technology and management consulting firm. Awarded with Consultancy of the year in the British Bank Award and has been ranked Top 100 Best Companies for Women in India 2022 by Avtar & Seramount. With our presence across 32 cities across globe, we support 100+ clients across banking, financial and Energy sectors. We are recognized for our deep transformation execution and delivery.\n\nWHY JOIN CAPCO?\n\nYou will work on engaging projects with the largest international and local banks, insurance companies, payment service providers and other key players in the industry. The projects that will transform the financial services industry.\n\nMAKE AN IMPACT\n\nInnovative thinking, delivery excellence and thought leadership to help our clients transform their business. Together with our clients and industry partners, we deliver disruptive work that is changing energy and financial services.\n\n#BEYOURSELFATWORK\n\nCapco has a tolerant, open culture that values diversity, inclusivity, and creativity.\n\nCAREER ADVANCEMENT\n\nWith no forced hierarchy at Capco, everyone has the opportunity to grow as we grow, taking their career into their own hands.\n\nDIVERSITY & INCLUSION\n\nWe believe that diversity of people and perspective gives us a competitive advantage.\n\nMAKE AN IMPACT\n\nResponsibilities\n\nJob Description-\n\n\nDefine and execute the process to identify client fee agreements, extract data and compare and reconcile data to legacy platform static data.\nCollate and maintain tracker for client migration.\nComplete detailed analysis of client billing requirements for comparison against SSv Standard rate card and reconcile to existing billing static data.\nElicit requirements using interviews, process analysis, requirements workshops, surveys, business process descriptions, use cases, scenarios, business analysis, task and workflow analysis.\nCritically evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and distinguish user requests from the underlying true needs.\nProactively communicate and collaborate with end-users to analyse information needs and functional business requirements and deliver artefacts as needed in line with project templates and methodologies.\nWork independently and with users to define requirements under direction of project manager and/or senior business analysts.\nDevelop requirements specifications according to standard templates and standards\n\n\nQualifications & Experience\n\n\nAt least 3 years’ experience in BA role\nPreferred SSv or MSS experience.\nPreferred detailed analysis experience in complex financial services.\nRequired experience in complex analysis and solution mapping, as-is process analysis.\nPreferred experience working with JIRA, Agile development sprints.\nRequired Project lifecycle experience.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-%E2%80%93-pelican-at-capco-4142496901?position=5&pageNum=37&refId=7Scw1Dd0tMof41tt6zSiVA%3D%3D&trackingId=V%2BYhL%2FwJb511yFOJgQeRNQ%3D%3D"
}