{
    "job_id": "4142991641",
    "title": "SFDC BA",
    "company": "Zensar Technologies",
    "location": "Pune, Maharashtra, India",
    "description": "Position-SFDC BA\n\nExp- 5-8 Yrs\n\nLocation- Pune, Bangalore, Chennai, Hyderabad & Kolkata.\n\nNotice- Immediate to 15 Days\n\n\n\n\nJob Summary\n\nWe are seeking a Salesforce Business Analyst with 5+ years of experience to join our team. The ideal candidate will be responsible for gathering requirements, analyzing business processes, and delivering high-quality Salesforce solutions that align with organizational goals. You will work closely with stakeholders, developers, and administrators to optimize and enhance Salesforce functionalities for Sales, Service, and other business units.\n\nKey Responsibilities\n\n1. Requirement Gathering & Analysis:\n\nCollaborate with stakeholders to understand business needs and translate them into Salesforce requirements.\nConduct workshops, interviews, and surveys to gather functional and non-functional requirements.\nDocument business processes, workflows, and system integrations.\n\n2. Salesforce Solution Design & Implementation:\n\nWork with technical teams to design, configure, and implement Salesforce solutions.\nCreate and manage reports, dashboards, and workflows to support business needs.\nAssist in developing custom objects, fields, validation rules, and process automation (Flows, Workflow Rules, Process Builder).\n\n3. Stakeholder Communication & Documentation:\n\nAct as a liaison between business teams and technical teams.\nPrepare user stories, functional specifications, and requirement documents.\nConduct training sessions and create user manuals to improve adoption.\n\n4. Data Management & Integration:\n\nEnsure data integrity and accuracy within Salesforce through best practices.\nWork on data migration and cleansing activities as needed.\nAssist with Salesforce integrations (APIs, third-party apps, middleware tools like MuleSoft).\n\n5. Testing & Deployment:\n\nConduct UAT (User Acceptance Testing) and facilitate feedback collection.\nSupport deployment and post-implementation troubleshooting.\nIdentify and resolve system issues, working closely with Salesforce admins and developers.\n\n6. Continuous Improvement & Best Practices:\n\nStay updated with Salesforce releases and new features.\nPropose enhancements to maximize Salesforce ROI.\nSupport change management and adoption strategies.\n\nRequired Skills & Qualifications\n\n5+ years of experience as a Salesforce Business Analyst.\nStrong knowledge of Salesforce Sales Cloud, Service Cloud, Experience Cloud.\nExperience with requirement gathering, user stories, process mapping, and documentation.\nHands-on experience with Flows, Process Builder, Validation Rules, Reports, and Dashboards.\nFamiliarity with Salesforce data model, objects, and security model.\nExperience working with Salesforce integrations (APIs, third-party tools, middleware like MuleSoft, Jitterbit, or Boomi).\nStrong problem-solving, analytical, and communication skills.\nExperience working in an Agile/Scrum environment.\nSalesforce Certified Administrator or Business Analyst (Preferred).\n\nPreferred Qualifications\n\nExperience in industries like healthcare, financial services, telecom, or manufacturing.\nFamiliarity with CPQ, Field Service Lightning (FSL), or Marketing Cloud.\nExperience with JIRA, Confluence, or other Agile tools.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/sfdc-ba-at-zensar-technologies-4142991641?position=7&pageNum=37&refId=7Scw1Dd0tMof41tt6zSiVA%3D%3D&trackingId=3VmClWsrQWEPJPdsdXJxjw%3D%3D"
}