{
    "job_id": "4142546604",
    "title": "Business Analyst - Business Analysis Job",
    "company": "YASH Technologies",
    "location": "Hyderabad, Telangana, India",
    "description": "YASH Technologies is a leading technology integrator specializing in helping clients reimagine operating models, enhance competitiveness, optimize costs, foster exceptional stakeholder experiences, and drive business transformation.\n\nAt YASH, we’re a cluster of the brightest stars working with cutting-edge technologies. Our purpose is anchored in a single truth – bringing real positive changes in an increasingly virtual world and it drives us beyond generational gaps and disruptions of the future.\n\nWe are looking forward to hire Business Analysis Professionals in the following areas :\n\nPrimary Skills\n\n\n4+ years of full-time experience as a Business Analyst.\nExperience in Business Analysis, Requirements Analysis & Elicitation, Managing Requirements, Scope & Stakeholders\nExpertise in business process modeling and diagramming techniques\nWorking knowledge of Agile framework - to have worked on Scrum/Kanban/others\nShould be self-motivated and PROACTIVE\nShould have experience working with US/UK customers and have ability to engage positively with customers\nUnderstanding of multiple business domains and various file and data formats used across domains\nShould have experience creating business and functional requirement specifications\nShould have experience working with multiple teams & stakeholders to deliver project requirements\nShould be able to work in the EU/UK time\n\n\nDesirable Skills\n\n\nExcellent interpersonal skills and need to coordinate directly with customer's customer, i.e. the end user\nGood convincing skills, ability to get the point across without aggravating the opposite party\nExpertise on multiple business domains and data file formats will be a plus\n\n\nGood To Have\n\n\nLogistics domain experience\nKnowledge in EDI - knowledge of X12 standards and working with file formats like EDI, Flat file, XML etc.\n\n\nResponsibilities\n\n\nAbility to handle/work on multiple discrete projects concurrently\nRequirements analysis and Elicitation - to gather requirements from business over phone and email\nUnderstanding the as-is and to-be states of the business need and thereby the system needs\nManaging scope - working with stakeholders to avoid scope creep and ensuring all agreed scope is delivered\nEstimation - providing BA and coordinating Developer estimates. Responsible for project estimation\nTracking and reporting of project metrics for the projects undertaken\nCreating a requirements matrix and business process flow for development\nWorking with developers to help understand the required enhancement/development, provide clarifications\nCreating test scenarios based on the requirement and change transition\nTest execution - Integration, System, Regression testing\nProblem reporting, defect tracking\nDocumentation - Creating supporting documentation for projects, involve in training and documentation at engagement level\nWorking effectively with multiple (support) teams to see project through to production and turnover to support.\n\n\nAt YASH, you are empowered to create a career that will take you to where you want to go while working in an inclusive team environment. We leverage career-oriented skilling models and optimize our collective intelligence aided with technology for continuous learning, unlearning, and relearning at a rapid pace and scale.\n\nOur Hyperlearning workplace is grounded upon four principles\n\n\nFlexible work arrangements, Free spirit, and emotional positivity\nAgile self-determination, trust, transparency, and open collaboration\nAll Support needed for the realization of business goals,\nStable employment with a great atmosphere and ethical corporate culture\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-business-analysis-job-at-yash-technologies-4142546604?position=5&pageNum=70&refId=HPHgp9Y9QvXuYD8UMhcuvA%3D%3D&trackingId=6CzNBB98W52WY2SQG%2BcF4Q%3D%3D"
}