{
    "job_id": "4142253014",
    "title": "Senior Data Scientist - ML Ops",
    "company": "Visa",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Description\n\n\n\n\nTo ensure that Visa’s payment technology is truly available to everyone, everywhere requires the success of our key bank or merchant partners and internal business units. The Global Data Science group supports these partners by using our extraordinarily rich data set that spans more than 3 billion cards globally and captures more than 100 billion transactions in a single year. Our focus lies on building creative solutions that have an immediate impact on the business of our highly analytical partners. We work in complementary teams comprising members from Data Science and various groups at Visa. To support our rapidly growing group we are looking for ML Engineers focused on generating value for the payments ecosystem. We are dreaming of the next generation of AI features and products.\n\n\n\n\nResponsible for building end-to-end automated pipelines for AI/ML models including model training, model validation, model refit, model recalibration, model monitoring, model serving, etc.\nWork collaboratively with Data Scientists, Data Engineers and cross-functional partners to design and deploy AI/ML based solutions and products\nLead end to-end deployment and maintenance of machine learning models in production, from concept, design, implementation, to rollout, ensuring the highest quality and performance\nMentor team members, share knowledge, and contribute to the technical growth of the team. Provide guidance on machine learning best practices and methodologies.\nConduct A/B tests and experiments to iterate and fine-tune algorithms and models.\nStay updated on state-of-the-art algorithmic techniques and recognize promising innovations, adapting them to Visa’s unique business and offerings.\nDesign, implement, and maintain reliable, high-performance distributed systems.\nSupport Strategic planning, business analysis and technical knowledge of ML Engineering, tools, and data architecture solutions.\nStrong problem-solving capabilities and ability to quickly propose feasible solutions and effectively communicate strategy and risk mitigation approaches to leadership.\n\n\n\n\nEssential Functions\n\nBuild AI/ML pipelines to support model development, model production, model validation, model performance monitoring, model recalibration, continuous integration, continuous delivery of AI/ML models.\nNew model development and existing model re-training, performance evaluation and score optimization. Preferable to have data science knowledge and experience in designing, developing and implementing Deep Learning methodologies, and newer ML model implementations at scale.\nBuild and maintain high performing ETL processes including data quality and testing aligned across technology, internal reporting and other functional teams.\nBuild ETL pipelines in Spark, Python, HIVE or Scala, Airflow that process transaction and account level data and standardize data fields across various data sources\nExposure to model management and governance practices. Ability to take decisions around model drift to monitor and refine models continuously.\nCreate data dictionaries, setup/monitor data validation alerts and execute periodic jobs like performance dashboards, predictive models scoring for client’s deliverables\nDefine and build technical/data documentation and experience with code version control systems (for e.g., git). Ensure data accuracy, integrity and consistency\n\n\n\n\nQualifications\n\nBasic Qualifications\n\n• 4 years of work experience with a bachelor’s degree or at least 2 years of work experience with an Advanced degree (e.g. Master’s, MBA, JD, MD) or 0 years of work experience with a PhD degree\n\n\n\n\nPreferred Qualifications\n\n• 6-8 years of work experience with a bachelor’s degree or 4-6 years of work experience with an Advanced Degree (e.g. Master’s, MBA, JD, MD) or 3 years of experience with a PhD\n\n• 4+ years’ experience in data-based decision-making or quantitative analysis\n\n• Master’s degree in Statistics, Operations Research, Applied Mathematics, Economics, Data Science, Business Analytics, Computer Science, or a related technical field\n\n• Extracting and aggregating data from large data sets using SQL/Hive or Spark\n\n• Analyzing large data sets using programming languages such as Python, R, SQL and/or Spark\n\n• Generating and visualizing data-based insights in software such as Tableau\n\n• Advanced knowledge and experience of AI/ML model development and implementation\n\n• Experienced with building AI/ML model pipelines and creating robust and scalable AI/ML solutions.\n\n• Track record of creating robust and scalable AI/ML/Data Science solutions and products\n\nTechnical Skills:\n\n• Working knowledge of Hadoop ecosystem and associated technologies, (For e.g. Apache Spark, MLlib, GraphX, iPython, sci-kit, Pandas etc.)\n\n• Advanced programming ability in different programming languages such as Spark, Python, SQL, Scala.\n\n• Experience working with Airflow, Github, ML flow for building and maintain ETL pipeline.\n\n• Proficient in advanced data mining and statistical modeling techniques, including Predictive modeling (e.g., binomial and multinomial regression, ANOVA), Classification techniques (e.g., Clustering, Principal Component Analysis, factor analysis), Decision Tree techniques (e.g., CART, CHAID).\n\n• Expert knowledge in Deep Learning techniques and LLM.\n\n• Experience working with large scale data ingestion, processing and storage in distributed computing environments / big data platforms (Hadoop) as well as common database systems and value stores (Parquet, Avro, HBase, etc.).\n\n• Familiarity with both common computing environments (e.g., Linux, Shell Scripting) and commonly used IDE’s (Jupyter Notebooks).\n\n• Experience working in building and integrating the code in the defined CI/CD framework using git.\n\n• Experience working with AWS for MLOps model development and model implementation is preferred but not required.\n\n• Preferred experience with Visualization Tools like Tableau, Power BI and D3\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-data-scientist-ml-ops-at-visa-4142253014?position=1&pageNum=22&refId=Q8Kf9AiV%2Bqa0LUasfvZQ2A%3D%3D&trackingId=NCfV7Orvd%2FSjfizgN71zmA%3D%3D"
}