{
    "job_id": "4143104279",
    "title": "Machine Learning Engineer",
    "company": "Voya India",
    "location": "Bengaluru, Karnataka, India",
    "description": "About Voya India\n\nVoya India, formerly known as VFI SLK, is a technology-driven, business process transformation company, driving the evolution of the financial services customer experience through the art of technology, innovation, and human creativity.\n\nAs a subsidiary of Voya Financial, Inc., we are dedicated to delivering cutting-edge solutions to Voya’s Health (employee benefits), Wealth (retirement), and Investment Management businesses. Our focus lies in crafting inventive customer-centric solutions by digitizing, automating, and optimizing technology and business processes.\n\nWe are committed to fostering an environment that celebrates learning, growth, and inclusivity while developing and deploying innovative and impactful solutions for Voya Financial, Inc.\n\n\n\n\nAbout the Role\n\nWe are looking for a Junior Machine Learning Engineer (MLE) to join our team and contribute to the development, deployment, and optimization of machine learning models. This role is ideal for a mid-level professional with prior experience to apply ML techniques to real-world problems while collaborating with data scientists, engineers, and product teams.\n\n\n\n\nKey Responsibilities\n\n- Assist in designing, implementing, and optimizing machine learning models.\n\n- Preprocess and clean data to improve model performance and accuracy.\n\n- Collaborate with data scientists and software engineers to integrate ML models into production systems.\n\n- Conduct experiments, analyze results, and improve model accuracy using feedback loops.\n\n- Optimize model performance through hyperparameter tuning and feature engineering.\n\n- Maintain documentation of experiments, models, and code.\n\n- Stay updated on the latest advancements in machine learning and AI.\n\n\n\n\nRequired Skills & Qualifications\n\n- Bachelor's (with 3 yrs of work experience), Master's (with 2 yrs of work experience) in Computer Science, Data Science, Mathematics, Economics, Statistics or a related field.\n\n- Knowledge of machine learning concepts, algorithms, and frameworks (e.g., Scikit-learn, TensorFlow) are required.\n\n- Hands-on experience through internships, real-world projects are required.\n\n- Prior experience of model deployment is required.\n\n- Proficiency in Python and familiarity with data science libraries (NumPy, Pandas, Matplotlib, etc.) is required.\n\n- Experience with data preprocessing and feature engineering techniques is required.\n\n- Understanding of model evaluation and performance metrics is required.\n\n- Familiarity with version control systems (e.g., Git) and cloud platforms (AWS, GCP, or Azure) is a plus.\n\n- Familiarity with DataBricks platform and PySpark is required.\n\n- Experience working with databases and SQL is required.\n\n- Knowledge of MLOps practices and tools such as MLflow is required. Additional knowledge/experience on Docker or Kubernetes, or GitHub Actions is a plus.\n\n- Experience working with databases and SQL is required.\n\n- Strong problem-solving skills and the ability to work in a team environment.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/machine-learning-engineer-at-voya-india-4143104279?position=3&pageNum=17&refId=rr4SH1GbEVcdwcmKQOXfGg%3D%3D&trackingId=cTr93mKDZ%2BVhpN81jmv2Nw%3D%3D"
}