{
    "job_id": "4143607672",
    "title": "Business Analyst - ISO20222",
    "company": "Capco",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Title: Collateral BA - ISO20222\n\nAbout Us\n\n“Capco, a Wipro company, is a global technology and management consulting firm. Awarded with Consultancy of the year in the British Bank Award and has been ranked Top 100 Best Companies for Women in India 2022 by Avtar & Seramount. With our presence across 32 cities across globe, we support 100+ clients across banking, financial and Energy sectors. We are recognized for our deep transformation execution and delivery.\n\nWHY JOIN CAPCO?\n\nYou will work on engaging projects with the largest international and local banks, insurance companies, payment service providers and other key players in the industry. The projects that will transform the financial services industry.\n\nMAKE AN IMPACT\n\nInnovative thinking, delivery excellence and thought leadership to help our clients transform their business. Together with our clients and industry partners, we deliver disruptive work that is changing energy and financial services.\n\n#BEYOURSELFATWORK\n\nCapco has a tolerant, open culture that values diversity, inclusivity, and creativity.\n\nCAREER ADVANCEMENT\n\nWith no forced hierarchy at Capco, everyone has the opportunity to grow as we grow, taking their career into their own hands.\n\nDIVERSITY & INCLUSION\n\nWe believe that diversity of people and perspective gives us a competitive advantage.\n\nMAKE AN IMPACT\n\nProven experience as a Business Analyst in the payments or settlements domain, preferably within a large-scale project environment.\n\n\nStrong capability in handling and analyzing large datasets with attention to detail.\nFamiliar with Business Analysis & Concepts, Process Related documentation and User Testing.\nExpertise in payments with MT and MX ISO20022 format.\nStrong problem solving and analytical skills.\nOrganized individual who can manage multiple priorities with tight timelines.\nExcellent written communication skills to clearly and concisely present requirements in a manner appropriate to the audience.\nProactive and self-starting and able to work autonomously on projects.\nStrong communicator and excellent at building relationships with peers, stakeholders and delivery teams.\n\n\nWhat additional skills will be good to have:\n\n\nExperience and knowledge of the trade and payment lifecycle is ideal\nUnderstanding of the MSS business\nUnderstanding of the regulatory and market landscape\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-iso20222-at-capco-4143607672?position=7&pageNum=40&refId=EgsHbWy8%2FUnqSRbzGFEs%2Fw%3D%3D&trackingId=estmM0CEEIP2Ov3nPZKnsg%3D%3D"
}