{
    "job_id": "4143824855",
    "title": "Business Analyst, Global Payroll Business Analyst",
    "company": "Amazon",
    "location": "Pune, Maharashtra, India",
    "description": "Description\n\nThis position is for a Payroll Operational Excellence Program Consultant. The candidate will be responsible for introducing and managing My HR related initiatives within the payroll space.\n\nWhat is My HR? It’s an application to enable employees to self-serve their hire to retire cycle queries via content (FAQs) and self-service workflows.\n\nThe Global Payroll Operational Excellence team is seeking a highly skilled and motivated individual to pull and analyze data with ease, translate business challenges into problem statements, create user-friendly contents, drive global projects, standardize processes, and eliminate the root cause of defects. This is an exciting opportunity to join a stable team in a huge growth area for Amazon.\n\nAn ideal candidate has a background in business analysis, content writing, and project management. Experience in driving global projects in a tech or non-tech environment This job will require exceptional communication and interpersonal skills while having the ability to work independently in a highly dynamic environment and exercise sound judgment based on artifacts and data.\n\nKey Responsibilities\n\n\nAct as a project manager by directing, supporting, and coaching project(s) team members and stakeholders and reporting on the project progress and status.\nCollaborate with payroll operations, payroll upstream teams, and technology teams on joint initiatives and reports.\nPreparation of user-friendly contents that enable self-service and improve the customer experience\nCommunicate with stakeholders in a manner that enables them to have a common understanding of the project or metric status, risks, and decision points of system or process changes.\nRepresent Global Payroll OE in local and global meetings and conference calls.\n\n\nBasic Qualifications\n\n\nBachelor’s or equivalent degree in finance, statistics, or engineering\nExcellent interpersonal skills with the ability to communicate and influence at all levels in a matrix organization\nProficient in English (verbal, written, and listening)\nProficiency in using MS-Excel, including advanced functions such as importing and exporting data, pivot tables, and macros\nMinimum 2+ years of project management and process improvement techniques, including managing a project portfolio, driving a timeline to completion, following up, and organizing multiple action plans within multiple stakeholders\n\n\nPreferred Qualifications\n\n\n2-3 years of experience in tax, finance, or a related analytical field\n4+ years of identifying, leading, and executing opportunities to improve, automate, standardize, or simplify finance or business tools and processes\nCertified PMP, CAPM, or Content Writer.\n\n\nThe Global Payroll Operational Excellence team is a group of highly skilled and motivated individual engaged in data analysis, translate business challenges into problem statements, create user-friendly contents, drive global projects, standardize processes, and eliminate the root cause of defects. This is an exciting opportunity to join a stable team in a huge growth area for Amazon.\n\nBasic Qualifications\n\n\n3+ years of tax, finance or a related analytical field experience\n4+ years of Accounts Receivable or Account Payable experience\n4+ years of applying key financial performance indicators (KPIs) to analyses experience\n4+ years of creating process improvements with automation and analysis experience\n4+ years of identifying, leading, and executing opportunities to improve, automate, standardize or simplify finance or business tools and processes experience\nBachelor's degree in engineering, statistics or business, or Bachelor's degree and 5+ years of quantitative role (engineering, process re-engineering, quality assurance) experience\nSix Sigma Black Belt\nExperience with advanced use of SQL for data mining and business intelligence\nExperience as a lean sensei, or experience working as a Quality Assurance Engineer\n\n\nPreferred Qualifications\n\n\n4+ years of participating in continuous improvement projects in your team to scale and improve controllership with measurable results experience\nMBA, or CPA\nKnowledge of Tableau\nExperience working with large-scale data mining and reporting tools (examples: SQL, MS Access, Essbase, Cognos) and other financial systems (examples: Oracle, SAP, Lawson, JD Edwards)\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI - Maharashtra\n\nJob ID: A2891435\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-global-payroll-business-analyst-at-amazon-4143824855?position=4&pageNum=92&refId=Cg5sPd6Nkk2JaEAHs4OCRg%3D%3D&trackingId=wMzQucgii9tJsSGLPLM%2Bzg%3D%3D"
}