{
    "job_id": "4143252193",
    "title": "Business Analyst",
    "company": "Deutsche Bank",
    "location": "Pune, Maharashtra, India",
    "description": "\n\n\nJob Title- Business Analysis Chapter Lead, VP\n\nLocation- Pune, India\n\nRole Description\n\nYou will be joining Foundational Platforms team within Cloud and Platform/CTO. The team is responsible for engineering of ServiceNow platform that runs bank's ITSM processes (Incident, Problem, Change, Configuration, Service Request and others), Integrated Risk Management etc. which is the second most used application within the Bank.\nYou will have an opportunity to design and implement solutions used by tens of thousands of users across the world. We are a global team and you will work with the best ServiceNow Engineers and Business Analysts within the teams spanning three locations (UK, US and India).\n\nWhat we’ll offer you\n\nAs part of our flexible scheme, here are just some of the benefits that you’ll enjoy\n\nBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and above\n\nYour key responsibilities\n\nBeing a Subject Matter Expert for several ITSM, SAMPro, IRM, CMDB, CSDM processes and providing support to the relevant development teams\nExpert in Agile Business Analysis processes, stakeholder engagement, requirement elicitation etc.\nLiaising with the Product Team, customers, and other stakeholders as appropriate and acting as the business/functional counterpart for solution identification\nParticipating in the analysis of incoming demand requests and progressing them to technical stores for the backlog.\nSupporting Agile ceremonies: sprint planning, daily stand-up, Show & Tell and retrospectives\nActively supporting the business strategy, plans and values, contributing to the achievement of a high-performance team culture\nDefining and documenting the standards for how the professional discipline operates\nTraining and educating the chapter (and others where helpful) on these standards\nProviding oversight and measuring how well those standards are adopted\nDeveloping the professional growth of the discipline (e.g. measuring improvements and maturity)\nLine manager responsibility for all resources within BA chapter, ensuring clear development and career paths, succession planning, and hiring of resources\n\nYour skills and experience\n\nServiceNow ITSM, SAMPro, IRM, CMDB, CSDM in-depth product knowledge is required, ITOM (Discovery/CMP/Service Mapping) or ITBM are beneficial\nProven experience of taking very high level requirements and working with stakeholders of different seniorities to translate them into technical stories\nExperience working in Agile environment using SCRUM methodology. Any SCRUM master experience is beneficial.\nAssisting onboarding of new capabilities and transitioning traditional business analysis methods to new industry norms.\nAdvanced analytical and problem-solving experience, ability to multi-task and effectively manage priorities\nExcellent communication skills, both written and verbal, ability to work effectively in virtual teams across multiple locations\n\nHow we’ll support you\n\nTraining and development to help you excel in your career\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needs\n\nAbout us and our teams\n\nPlease visit our company website for further information:\n\nhttps://www.db.com/company/company.htm\n\n\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-deutsche-bank-4143252193?position=8&pageNum=2&refId=dmyDsuYITNpOArSK52WyDg%3D%3D&trackingId=PfJEA96LxX0aQjp8BMvT9w%3D%3D"
}