{
    "job_id": "4143379149",
    "title": "Team Lead - Business Analysis & Testing",
    "company": "BNP Paribas",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Description - APAC\n\nAbout BNP Paribas Group:\n\nBNP Paribas is a top-ranking bank in Europe with an international profile. It operates in 71 countries and has almost 199000 employees. The Group ranks highly in its three core areas of activity: Domestic Markets and International FinancialServices (whose retail banking networks, and financial services are grouped together under Retail Banking & Services) and Corporate & Institutional Banking, centered on corporate and institutional clients. The Group helps all its clients (retail, associations, businesses, SMEs, large corporate and institutional) to implement their projects by providing them with services in financing, investment, savings, and protection. In its Corporate & Institutional Banking and International Financial Services activities, BNP Paribas enjoys leading positions in Europe, a strong presence in the Americas and has a solid and fast-growing network in the Asia/Pacific region.\n\nAbout BNP Paribas India Solutions\n\nEstablished in 2005, BNP Paribas India Solutions is a wholly owned subsidiary of BNP Paribas SA, a leading bank in\n\nEurope with an international reach. With delivery centers located in Bengaluru, Chennai, and Mumbai, we are a 24x7 global delivery center. India Solutions services three business lines: Corporate and Institutional Banking, Investment Solutions and Retail Banking for BNP Paribas across the Group. Driving innovation and growth, we are harnessing the potential of over 6000 employees, to provide support and develop best-in-class solutions\n\nAbout Business Line/Function\n\nCIB Client Engagement and Protection IT is having focus on applications servicing Client Lifecycle management, Due Diligence /KYC, Customer Relation Management, Service Request Management, Referential and Data Quality, PreTrade Transaction Screening and Anti-Money Laundering. For testing tools & technologies being used include Java, VB Script, Selenium, BDD, TestNG, Rest assured, Postman etc... Agile and DevSecOps practices are widely used. Landscape includes projects that are a mix of established and some under transition to new platforms.\n\nCEP IT comprises of development and maintenance of plethora of applications used in various phases of Client Enablement. CRM and SRM projects within CEP IT are one of the key projects designed to cater to various complex needs and processes arising during various stages of Client Onboarding Journey, and Client maintenance.\n\nIN BNP ISPL, testing team provides different testing services – Functional, Regression, Automation, Performance, Security & Application Security Review\n\nCommitment To Diversity And Inclusion\n\nAt BNP Paribas, we passionately embrace diversity and are committed to fostering an inclusive workplace where all employees are valued, respected and can bring their authentic selves to work. We prohibit Discrimination and Harassment of any kind, and our policies promote equal employment opportunity for all employees and applicants, irrespective of, but not limited to their gender, gender identity, sex, sexual orientation, ethnicity, race, color, national origin, age, religion, social status, mental or physical disabilities, veteran status etc. As a global Bank, we truly believe that inclusion and diversity of our teams is key to our success in serving our clients and the communities we operate in.\n\nJob Title\n\nTeam Lead – Business Analysis & Testing\n\nDate\n\n30-Jan-25\n\nDepartment\n\nCEP IT\n\nLocation:\n\nBangalore\n\nBusiness Line / Function\n\nCIB – CEP IT - CRSM (SRM)\n\nReports To\n\n(Direct)\n\nManager\n\nGrade\n\n(if applicable)\n\n(Functional)\n\nNumber Of Direct Reports\n\nNA\n\nDirectorship / Registration\n\nNA\n\nPosition Purpose\n\nWe are seeking a highly skilled and experienced Team Lead - Business Analyst & Tester to oversee business analysis and software testing functions.\n\nThis role requires a blend of analytical expertise, leadership, and quality assurance skills to ensure successful project delivery.\n\nThe ideal candidate will be responsible for gathering and analyzing business requirements, leading testing efforts, and mentoring a team to achieve business objectives.\n\nExperience/knowledge in automation testing frameworks is needed to drive this role as mentoring for maintaining regression test pack will be a major objective for the candidate. Knowledge on Selenium + Java framework will be beneficial.\n\nResponsibilities\n\nDirect Responsibilities\n\nBusiness Analysis Responsibilities\n\n\nCollaborate with stakeholders to gather, analyze, and document business and functional requirements.\nTranslate business needs into clear specifications, user stories, and workflows.\nWork closely with developers, designers, and other teams to ensure alignment with business goals.\nConduct gap analysis and identify process improvement opportunities.\nAssist in creating wireframes, process diagrams, and other documentation to support requirements.\nEnsure traceability between business needs and technical implementation.\n\n\nTesting Responsibilities\n\n\nDevelop comprehensive test plans, test cases, and test scripts based on business requirements.\nLead solution validation efforts, including user acceptance testing (UAT), to confirm that deliverables meet requirements.\nPerform various types of testing, including functional, regression, integration, and performance testing.\nIdentify, document, and track defects, working closely with developers for resolution.\nEnsure that delivered software meets quality standards and business expectations.\nAutomate testing processes where applicable to improve efficiency.\nGuide and support existing automation team to add tests to correct layer of application and ensure the tests stay relevant and optimized.\n\n\nLeadership & Collaboration\n\n\nLead and mentor a team of business analysts and testers, fostering collaboration and growth.\nEnsure project deadlines and deliverables are met with high quality.\nRaise the relevant risks, challenges after evaluating the items properly, with mitigation plan.\nCoordinate with cross-functional teams to ensure smooth execution of business and testing activities.\nProvide regular updates, reports, and risk assessments to stakeholders.\nPromote best practices in business analysis, testing, and quality assurance.\n\n\nContributing Responsibilities\n\n\nKPI generation for reporting, Project level meetings\nTraining and knowledge sharing\nContribute towards technical initiatives and drive them, wherever applicable\n\n\nTechnical & Behavioral Competencies\n\n\nExperience in Selenium + Java automation framework is must.\nKnowledge of GIT, Bit Bucket\nHands-on experience on SQL\nKnowledge of CI/CD, Jenkins is an added advantage.\nKnowledge of test management tools is required – JIRA, ALM\nKnowledge on API testing tools like Postman\nStrong Experience in Test Planning & Estimation Knowledge\nStrong team management skill\nExpected to drive releases and work on handling risks early.\nShould have a learning attitude to seamlessly merge with project.\nThe candidate should be self-motivated, proactive, flexible and a good team player.\nAttention to detail and excellent problem solving and analysis skills.\nUnderstanding testing principles and practices\nShould have functional Specification Analysis Experience\nExcellent verbal and written communication skills. Should be able to communicate effectively with IT teams as well as Business Teams.\nFamiliarity with Agile and Scrum methodologies is a plus.\nCertification in Business Analysis (CBAP, CCBA) or Testing (ISTQB) is a plus.\n\n\nSpecific Qualifications (if Required)\n\n\nOverall 8+ yrs of experience, in Testing along with business analysis.\n3+ years of experience in business analyst role\n3+ years of experience in Automation Testing\n2+ years of experience in Manual/ Functional testing\nWorking Knowledge of at least one Database (Oracle/MS SQL)\nBanking domain knowledge mandatory\n\n\nSkills Referential\n\nBehavioural Skills: (Please select up to 4 skills)\n\nAbility to deliver / Results driven\n\nCommunication skills - oral & written\n\nCreativity & Innovation / Problem solving\n\nAbility to collaborate / Teamwork\n\nTransversal Skills: (Please select up to 5 skills)\n\nAnalytical Ability\n\nAbility to develop and adapt a process\n\nAbility to understand, explain and support change\n\nAbility To Develop Others & Improve Their Skills\n\nChoose an item.\n\nEducation Level\n\nBachelor Degree or equivalent\n\nExperience Level\n\nAt least 7 years\n\nOther/Specific Qualifications (if Required)\n\nNA\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/team-lead-business-analysis-testing-at-bnp-paribas-4143379149?position=3&pageNum=97&refId=HcfnYd3BMGIT%2FuoEZTo%2FBg%3D%3D&trackingId=ClsZ37JF2N%2FzbFi8WBtvlw%3D%3D"
}