{
    "job_id": "4143278458",
    "title": "Junior Data Scientist",
    "company": "6thStreet.com",
    "location": "Bengaluru, Karnataka, India",
    "description": "6thStreet.com is an omnichannel fashion & lifestyle destination that offers 1400+ fashion & beauty brands in the UAE, KSA, Kuwait, Oman, Bahrain & Qatar. Customers can shop the latest on-trend outfits, shoes, bags, beauty essentials and accessories from international brands such as Tommy Hilfiger, Calvin Klein, Hugo, Marks & Spencers, Dune London, Charles & Keith, Aldo, Crocs, Birkenstock, Skechers, Levi’s, Nike, Adidas, Loreal and Inglot amongst many more. 6thStreet.com recently opened GCC’s first phygital store at Dubai Hills Mall; an innovative tech-led space which combines the best of both online & offline shopping with online browsing & smart fitting rooms.\n\n\n\n\nThe Junior Data Scientist will extract insights and build models that will drive key business decisions. The candidate will work closely with other data scientists, software engineers and product managers to design, build, optimize and deploy machine learning systems and solutions. This role is ideal for someone with a strong analytical mindset, a passion for data, and a desire to grow in a fast-paced e-commerce environment.\n\n\n\n\nResponsibilities:\n\n• Design and implement machine learning models, algorithms, and systems\n\n• Build and maintain end-to-end machine learning pipelines- model training, validation, and deployment\n\n• Experiment with different algorithms and approaches to optimize model performance\n\n• Collaborate with software engineers, product managers, analysts to build scalable, production-ready solutions\n\n• Communicate complex technical concepts to non-technical stakeholders\n\n• Stay updated with the latest advancements in machine learning and deep learning.\n\n• Evaluate and experiment with new tools, libraries, and algorithms that could improve model performance\n\n• Collaborate on proof-of-concept (POC) projects to validate new approaches and techniques\n\n\n\n\nRequirements:\n\n• Python: Proficiency in python, with knowledge of popular libraries like pandas, numpy, scipy, scikit-learn, tensorflow, pytorch\n\n• SQL: Strong ability to write and optimize complex SQL queries to extract and manipulate large datasets from relational databases\n\n• Data Analysis & Visualization: Ability to work with large datasets and extract meaningful insights and able to leverage data visualization tools and libraries\n\n• Data Wrangling & Preprocessing: Expertise in cleaning and transforming raw data into structured formats\n\n• Statistical Analysis: A solid understanding of descriptive and inferential statistics, including hypothesis testing and probability theory\n\n• Machine Learning & Deep Learning: Familiarity with supervised and unsupervised learning algorithms such as regression, tree based methods, clustering, boosting and bagging methodologies\n\n• Machine learning workflows: feature engineering, model training, model optimization , validation and evaluation\n\n• ML Deployment: Deploying machine learning models to production environments, ensuring they meet the scalability, reliability, and performance requirements\n\n• DevOps: Git, CI/CD pipelines, dockerization, model versioning (mlflow), monitoring platforms\n\n• Cloud Platforms: Experience with cloud platforms like AWS, Google Cloud or Azure for deploying models\n\n• Problem-Solving & Analytical Thinking: Ability to approach complex problems methodically and implement robust solutions\n\n• Collaboration & Communication: Strong ability to work with cross-functional teams and communicate technical concepts to non-technical stakeholders.\n\n• Adaptability & Learning: Willingness to quickly learn new tools, technologies, and algorithms\n\n• Attention to Detail: Ability to carefully test and validate models, ensuring they work as intended in production\n\n\n\n\nGood to have:\n\n• Familiarity with big data technologies such as Spark or Hadoop\n\n• Object-oriented programming (OOP)\n\n• Knowledge of data privacy and security practices when working with sensitive data\n\n• Experience working with big data tools (e.g., Apache Kafka, Apache Flink) for streaming data processing\n\n• Familiarity with feature stores like Feast\n\n• Experience working with e-commerce data\n\n\n\n\nBenefits:\n\n• Full-time role\n\n• Competitive salary + bonus\n\n• Company employee discounts across all brands\n\n• Medical & health insurance\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/junior-data-scientist-at-6thstreet-com-4143278458?position=19&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=%2B1Gg5fG5dimc2VSiG9nroQ%3D%3D"
}