{
    "job_id": "4143152207",
    "title": "Data Scientist",
    "company": "hackajob",
    "location": "Bengaluru, Karnataka, India",
    "description": "hackajob is a matching platform partnering with GSK helping them to hire the best talent and build the future. To get the chance to get matched to this role and other similar roles, click on Apply to set up your free profile.\n\n\n\n\nGSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease – so the health of billions of people can be positively impacted and so stronger, more sustainable shareholder returns can be delivered – as an organisation where people can thrive. Getting ahead means preventing disease as well as treating it, and GSK aims to impact the health of 2.5 billion people around the world in the next 10 years.\n\n\n\n\nDatabase manipulation & reporting (SQL,Python):\n\nCapabilities: Good Understanding on Azure data Lake, Azure SQL Database, Data Bricks and Azure SQL Data warehouse.\nHands on experience on using Python & SQL in Databricks for data extraction, transformation, and aggregation from multiple file formats for analyzing & transforming the data. Will need to be agile and understand new data sets as they are ingested\nProject Examples: Cleaning and preparing data for dashboard builds, analyses, and other projects. Being able to pick up and (when needed) modify existing code, along with creating new code to build datasets.\nPowerBI Developer: Greater than 3 years experience\nCapabilities: Ability to take above blob storage and Databrick tables and further develop them as PowerBI dashboards.\nExperience integrating Microsoft Powerapps, Power BI Dax, and Power Query, and Modeling.\nStrong understanding of Power BI Architecture, deployment, and sharinig mechanisms\nExperience in design and development of ETL using Databricks (PySpark, Python, R) and Informatica.\nExperience in evaluating business requirements, apply data modeling to transform client requests into data deliverables.\nAbility to work across different BU’s, Tech, and with other offshore Data AnalystProject Examples: Create, maintain, and enhance Power-BI Dashboards utilizing mutlipe data sources, including appropriate handling of confidential data.\n\nData Science, AI/ML Capabilities:\n\nCapabilities: Experience running simple data science, AI/ML projects such as gradient boosting and random forest to better leverage our wide data sets and build our capabilities\nExperience in strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.\nHands-on experience in Analyzing National and Xponent data (TRx, NRx, NBRx , Prescriber Data), APLD, data processing, data normalizations, KPI Computing and creating numerous business KPI’s and visualizing them on Power BI & other reporting tools for higher leadership and decision makers.\nExperience with linear regression modeling to understand relations and key impact of drivers to overall performance.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-hackajob-4143152207?position=2&pageNum=17&refId=rr4SH1GbEVcdwcmKQOXfGg%3D%3D&trackingId=qUggnqFReEa0sQi6RQbXIQ%3D%3D"
}