{
    "job_id": "4143046092",
    "title": "Guidewire Business Analyst",
    "company": "Capgemini",
    "location": "Hyderabad, Telangana, India",
    "description": "Capgemini is seeking a highly motivated and detail-oriented Application Developer III to join our team to work for a top 10 US Insurance Carrier.\n\nAgile Dev Team Members, regardless of their primary discipline (development or testing), share responsibility for the full software development lifecycle, ensuring high-quality, user-centric, and adaptable systems are delivered that meet business objectives.\n\nMAIN RESPONSIBILITIES:\n\n Business Analysis:\n\n\nUnderstands customer needs and translates them into technical requirements and user stories\nPerforms impact assessments, estimates user stories, and supports the creation of business cases\nCollaborates with product owners to ensure that software meets business needs\nGood functional understanding about Guidewire\nExperience in Business Analyst role\nGuidewire certification (Associate Level) - MUST to have\nExperience in Personal Lines Insurance\n\n\n\n Agile Practices:\n\n\nActively participates in Agile ceremonies, including sprint planning, daily stand-ups, retrospectives, and demos\nPlans and commits to team goals, delivers working software each sprint, and participates in backlog refinement\n\n\n\n Teamwork & Collaboration:\n\n\nCollaborates effectively with other team members, including developers, testers, product owners, and business stakeholders\nMentors junior team members and provides guidance as needed\nParticipates in and contributes to a community of practice\n\n\n\n Continuous Improvement:\n\n\nContinuously seeks opportunities to improve skills, processes, and the overall software development lifecycle\nImplements innovative solutions and fosters a culture of continuous learning and improvement\n\n\n\n Technical Expertise:\n\n\nPossesses technical skills in software development, testing\nUnderstands and applies best practices in software engineering, such as design patterns, security, and performance\nExperience with software products for creating process flows (Microsoft PowerPoint, Visio, etc)\n\n\n\n Problem-Solving & Decision-Making:\n\n\nAnalyzes and solves complex problems, identifies and mitigates risks, and makes informed decisions\nTroubleshoots technical issues and supports the resolution of environmental problems\n\n\nOur Client is one of the United States' largest insurers, providing a wide range of insurance and financial services products with gross written premiums well over US$25 Billion (P&C). They proudly serve more than 10 million U.S. households with more than 19 million individual policies across all 50 states through the efforts of over 48,000 exclusive and independent agents and nearly 18,500 employees. Finally, our Client is part of one the largest Insurance Groups in the world.\n\nLocation: India\n\nRequirements\n\nEDUCATION\n\nBachelor's degree preferred.\n\nExperience\n\n5 + years experience in Business Analysis role\n\nAdditional Qualifications\n\n\nStrong verbal communication and listening skills\nExcellent collaboration and team building skills\nDemonstrated problem solving skills\nAbility to influence internal and/or external constituents\nPossesses a high degree of initiative\nEffectively coaches and delivers constructive feedback\nPossesses strong product knowledge\n\n\n\nOther Critical Skills:\n\n\nSubject Matter Expertise - Advanced\nAgile Methodology - Intermediate\nApplication Support - Intermediate\nQuality Engineering - Intermediate\nApplication Development Tools - Intermediate\n\n\n\nSoftware / Tool Skills\n\n\nGuidewire Policy Center or similar policy processing product - Intermediate\nJava, Java Script , GOSU - Intermediate\nWeb Service Integration/Restful Services (API) - Intermediate\nSQL and experience with accessing databases - Intermediate\n\n\n\nBenefits\n\nCompetitive compensation and benefits package:\n\n\nCompetitive salary and performance-based bonuses\nComprehensive benefits package\nCareer development and training opportunities\nFlexible work arrangements (remote and/or office-based)\nDynamic and inclusive work culture within a globally renowned group\nPrivate Health Insurance\nPension Plan\nPaid Time Off\nTraining & Development\n\n\nNote: Benefits differ based on employee level.\n\nAbout Capgemini\n\nCapgemini is a global leader in partnering with companies to transform and manage their business by harnessing the power of technology. The Group is guided everyday by its purpose of unleashing human energy through technology for an inclusive and sustainable future. It is a responsible and diverse organization of over 340,000 team members in more than 50 countries. With its strong 55-year heritage and deep industry expertise, Capgemini is trusted by its clients to address the entire breadth of their business needs, from strategy and design to operations, fueled by the fast evolving and innovative world of cloud, data, AI, connectivity, software, digital engineering and platforms. The Group €22.5 billion in revenues in 2023.\n\nhttps://www.capgemini.com/us-en/about-us/who-we-are/\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/guidewire-business-analyst-at-capgemini-4143046092?position=4&pageNum=50&refId=%2FVyrdZh82hXsETPuNBCAVQ%3D%3D&trackingId=MFPXwntlEtWMXRedFwQYZw%3D%3D"
}