{
    "job_id": "4143245861",
    "title": "Business Analyst",
    "company": "ADP",
    "location": "Hyderabad, Telangana, India",
    "description": "JD for Mainframes Business Analyst –\n\n4-6 years of strong working experience as a business analyst for a product development team.\n\nKnowledge of Payroll domain, Taxation in specific is a plus.\nProven experience in working with complex projects.\nWorking experience on SQL and Mainframe CICS screens.\nStrong problem solving & analytical skills.\nExcellent verbal and written communication skills.\nProficient in MS Word\nSelf-starter should be able to work with minimal supervision in addition to being a strong team player.\nExperience/Ability to communicate ideas well and convince people about the same.\nExperience/Ability to discuss and review strategies/plans with all the team members.\nWillingness/Commitment to be open, agile and contribute as an individual contributor.\nWillingness/Commitment to work with highly demanding project teams.\nWillingness/Commitment to work through uncertainties to deliver things.\nWilling to adapt to sudden changes based on seasonal volumes.\nExperience/knowledge on agile projects (SCRUM or similar flavor) will be added plus.\n\n\n\n\nProfile Description:\n\nOwns up the functional analysis of the statutory changes made by various US agencies and translate them into product specific requirements.\nDeliverables include detailed analysis documents that maps the agency requirements to product requirements\nResponsible for high quality deliverables on-time.\nGreat eye for detail.\nKeeps up-to-date on emerging techniques\nWorks with highly demanding teams due to the nature of function, compliance.\nIdentifies, plans and works on improvement areas for self and team.\nBuilds rapport and communicates with the statutory analysts for discussing the challenges.\nCommunicates the status update and risks on tasks (self and related team) to the project management.\nMust be able to work well under pressure and have a strong understanding of business process, organizational readiness and change management\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-adp-4143245861?position=48&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=O5pjxLabHZvfVTS5avoJDw%3D%3D"
}