{
    "job_id": "4143280541",
    "title": "Business Analyst",
    "company": "Aveosoft Pvt Ltd",
    "location": "Ahmedabad, Gujarat, India",
    "description": "Position title\n\nBusiness Analyst\n\n\n\n\nDescription\n\nAveosoft Pvt. Ltd. a leading provider of innovative IT solutions based in Ahmedabad, is seeking a motivated and detail-oriented Business Analyst to join our dynamic team. The ideal candidate will have a minimum of 1 year of experience working in an IT company and will support our business operations by analyzing processes, identifying requirements, and delivering data-driven recommendations.\n\n\n\n\nResponsibilities\n\n\n\n\nRequirement Gathering and Analysis:\n\nCollaborate with stakeholders to gather and document business requirements.\nAnalyze business processes to identify areas for improvement.\n\nData Analysis and Reporting:\n\nConduct data analysis to support business decisions.\nPrepare reports, presentations, and documentation to communicate findings.\n\nProject Support:\n\nAssist in the planning and execution of projects.\nSupport project managers with tracking project progress and deliverables.\n\nStakeholder Communication:\n\nMaintain clear and consistent communication with stakeholders.\nFacilitate meetings and workshops to gather information and discuss requirements.\n\nDocumentation:\n\nCreate and maintain comprehensive documentation for processes, requirements, and system changes.\nEnsure all documentation is up-to-date and accessible.\n\nQuality Assurance:\n\nAssist in the testing of new systems and processes to ensure they meet requirements.\nIdentify and report any issues or discrepancies.\n\nWireframe and Flowchart Creation:\n\nDesign and develop wireframes and flowcharts to visualize business processes and requirements.\n\nUser Story Writing:\n\nWrite detailed user stories to capture system requirements and user needs.\n\nBRD and FRD Development:\n\nDevelop Business Requirements Documents (BRD) and Functional Requirements Documents (FRD) to ensure clear and comprehensive project specifications.\n\nPresentation and Demo:\n\nPrepare and deliver presentations and demos to stakeholders to showcase findings and project progress.\n\nAI Tool Utilization:\n\nEffectively use AI tools to enhance data analysis and decision-making processes.\n\n\n\n\nSkills\n\nBachelor’s degree in Business Administration, Information Technology, Computer Science, or a related field.\nBasic understanding of business processes and analysis techniques.\n Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint).\n Familiarity with data analysis tools and methodologies.\n Strong analytical and problem-solving skills.\n Excellent written and verbal communication skills.\n Ability to work collaboratively in a team environment.\nDetail-oriented with strong analytical skills.\n\nQualifications\n\nExperience with project management tools (e.g., JIRA, Trello).\nFamiliarity with Agile/Scrum methodologies.\n Certification in Business Analysis (e.g., CBAP, CCBA) is a plus.\n Experience and knowledge in creating wireframes and flowcharts.\n Proficiency in writing user stories, BRDs, and FRDs.\n Skilled in preparing and delivering presentations and demos.\n Effective use of AI tools for analysis and decision-making.\n\nJob Benefits\n\nCompetitive salary and benefits package.\nFlexible shift timings\nOpportunities for professional growth and development.\nA collaborative and inclusive work environment.\nExposure to a variety of projects and technologies.\n\n\n\n\nOnly shortlisted candidates will be contacted. Thank you for your understanding and interest in joining AveoSoft Pvt Ltd.\n\n\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-aveosoft-pvt-ltd-4143280541?position=2&pageNum=75&refId=oawIpd1n3a%2BRa%2FbhSX9Nsw%3D%3D&trackingId=S8gzvE0zr3fWxPP3VJ%2FkTA%3D%3D"
}