{
    "job_id": "4143565388",
    "title": "Lead Business Analyst",
    "company": "Virtusa",
    "location": "Gurgaon, Haryana, India",
    "description": "BA\n\nExperience- 10-12 years.\n\nJob Description:-\n\nRequirements, Planning and Management\n\nBe self-sufficient in identifying and understanding business requirements/issues through engagement with key stakeholders.\n\nEnsure that all stakeholders have a common understanding of what is being delivered and how it is aligned to the overall target operating model (TOM).\n\nIdentify & escalate as appropriate, issues & instances where any elements risking successful delivery are identified, assisting in the resolution of these issues.\n\nSupporting the effective management of the necessary JIRA boards and backlogs with the necessary teams and stakeholders\n\nOwnership of activities deliverables and outputs; Supporting PM on scope, timelines, plans, and RAID logs.\n\nProcess Analysis and Automation\n\nUnderstand the application of practical and appropriate Generative AI with a mindset to automate and innovate.\n\nBe able to apply effective analysis techniques to deliver the required outcomes that are fit for purpose.\n\nUse your analytical skills to constructively challenge and achieve the right outcomes working collaboratively with the technical teams and wider stakeholders.\n\nExperience in working in complex process, data, and tooling solutions.\n\nProduce different forms of analysis output to an appropriate and agreed level of depth and audience.\n\nDevelop detailed target business processes that are aligned and support delivery of the TOM.\n\nFacilitate workshop sessions on processes, data, and tooling requirements/solutions with working groups across the globe including taking a lead role in co-ordinating the successful delivery of any Proof of Concepts (POC)\n\nRegularly review and edit requirements, specifications, business processes and recommendations relating to the proposed solution, to ensure they are up to date throughout the life cycle of the project.\n\nProficiency with Visio, JIRA and Microsoft Office tools.\n\nExperience of working as a BA on projects that have a PPM focus using PPMs tools such as Clarity.\n\nEmbedding (e.g. Testing, Training, Support)\n\nBuild out test approaches, co-ordinate detailed documentation of test scenarios and manage end to end testing of the solution.\n\nWork with the testers to define defects, acceptable tolerances within various types of testing.\n\nTake ownership to ensure staff are provided with all training required including the creation of appropriate training materials.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/lead-business-analyst-at-virtusa-4143565388?position=7&pageNum=95&refId=oHWbHPyc2vtOBB1ZeF%2F1RA%3D%3D&trackingId=YiHukZzkDAUZjq1gUASYLw%3D%3D"
}