{
    "job_id": "4143149755",
    "title": "SFDC - Business Function Analysis & Business Architect",
    "company": "Zensar Technologies",
    "location": "Pune, Maharashtra, India",
    "description": "Job Title: Lead Business Analyst – Salesforce\n\nExp- 10-15yrs\n\nNotice- Immediate- 15 days\n\nLocation: Pune, Bangalore, Chennai, Hyderabad & Kolkata\n\n\n\n\nJob Summary:\n\nThe Lead Business Analyst will serve as the key liaison between stakeholders and the technical teams, ensuring seamless translation of business needs into Salesforce solutions. The role requires expertise in requirement gathering, business process design, and project delivery using Salesforce platforms. The candidate will also lead efforts to ensure the successful implementation of projects by collaborating with clients, architects, developers, and QA teams.\n\nKey Responsibilities:\n\nBusiness Analysis & Requirement Gathering:\nCollaborate with stakeholders to gather, document, and analyze business requirements.\nCreate detailed business process flows, including As-Is and To-Be states, using tools such as Lucidchart.\nTranslate high-level business requirements into functional and non-functional requirements.\nWork with cross-functional teams to validate requirements and ensure alignment with business goals.\nProject Delivery:\nTrack project deliverables, review for quality, and ensure timely closure.\nConduct UAT (User Acceptance Testing) and provide support during deployment.\nCollaborate with architects, developers, and QA teams to ensure successful project delivery.\nSupport post-implementation reviews to capture lessons learned and drive continuous improvement.\nStakeholder Management:\nAct as the primary point of contact for client coordination and communication.\nManage stakeholder expectations and provide regular project updates.\nEscalate issues and risks appropriately to ensure project timelines are maintained.\nDocumentation and Reporting:\nPrepare business requirement documents (BRDs), functional specifications, and test scenarios.\nMaintain project artifacts and ensure traceability for audit and compliance purposes.\nDevelop and present dashboards and reports summarizing project progress and outcomes.\nTechnical Expertise and Guidance:\nLeverage Salesforce technologies, including Sales Cloud, Service Cloud, and Marketing Cloud, to propose effective solutions.\nCollaborate with the development team to design and implement Salesforce configurations and customizations.\nEnsure seamless integration with third-party tools such as JIRA, MuleSoft, DocuSign, and Jitterbit.\nCertifications and Compliance:\nEnsure adherence to compliance requirements such as FDA or industry-specific standards.\nProvide support in preparing project summaries and monitoring reports for regulatory bodies.\n\nQualifications:\n\nEducation:\nMBA in Finance or equivalent educational background.\nProfessional Experience:\n5+ years of experience in Business Analysis, preferably in Salesforce projects.\nDemonstrated expertise in requirement gathering, client coordination, and project delivery.\nProven ability to manage multiple projects with competing deadlines.\nCertifications:\nSalesforce Marketing Cloud Email Specialist\nSalesforce Admin\nSalesforce Community Cloud Consultant\nTechnical Skills:\nExpertise in Salesforce tools and modules.\nProficiency with MS Office Suite (Excel, PowerPoint, Word).\nFamiliarity with integration tools such as MuleSoft and Jitterbit.\nExperience with issue tracking tools like JIRA.\nCore Competencies:\nStrong analytical and problem-solving skills.\nExcellent communication and interpersonal abilities.\nAbility to work collaboratively with cross-functional teams.\nStrong organizational and multitasking skills.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/sfdc-business-function-analysis-business-architect-at-zensar-technologies-4143149755?position=8&pageNum=67&refId=6wIEzwS4x6APeTXACdRUdw%3D%3D&trackingId=nnm8TUzyUe2U7aluDDXRvA%3D%3D"
}