{
    "job_id": "4143789220",
    "title": "Sr ITSM Business Analyst",
    "company": "Providence India",
    "location": "Hyderabad, Telangana, India",
    "description": "Key Responsibilities\n\nProduct Strategy and Vision\n\nDevelop and maintain a comprehensive product strategy and vision for ServiceNow ITSM solutions, ensuring alignment with the organization's overall IT and business strategies.\nConduct market research and competitive analysis to identify trends, opportunities, and potential areas for improvement in ITSM offerings.\nCollaborate with stakeholders to define and prioritize product features, enhancements, and roadmap initiatives.\n\nProduct Development and Management\n\nLead the end-to-end product development lifecycle, from concept and design to development, testing, and deployment.\nWork closely with cross-functional teams, including developers, engineers, and quality assurance, to ensure successful product delivery.\nDefine and manage product requirements, user stories, and acceptance criteria, ensuring clarity and alignment with business objectives.\nUtilize agile methodologies to manage product backlogs, sprints, and release cycles, ensuring timely delivery of high-quality ITSM solutions.\n\nStakeholder Engagement and Communication\n\nServe as the primary point of contact for stakeholders, including IT teams, business units, and executive leadership, providing regular updates on product status, milestones, and performance metrics.\nFacilitate communication and collaboration between technical and non-technical teams to ensure a shared understanding of product goals and requirements.\nGather and incorporate feedback from users and stakeholders to continuously improve ITSM solutions.\n\nPerformance Monitoring and Optimization\n\nEstablish and monitor key performance indicators (KPIs) and metrics to evaluate the success and impact of ITSM solutions.\nAnalyze data and user feedback to identify areas for improvement and optimization, driving continuous enhancement of ITSM products.\nEnsure compliance with industry standards, best practices, and regulatory requirements.\n\nProfessional Experience\n\n5+ years of experience in product management, with a focus on ITSM solutions and the ServiceNow platform.\nProven track record of successfully delivering complex ITSM projects, from inception to deployment.\nExperience working in an agile development environment, with a strong understanding of agile methodologies and practices.\n\nTechnical Skills\n\nIn-depth knowledge of the ServiceNow platform, including ITSM, HAM modules, workflows, and customization capabilities.\nFamiliarity with ITIL (Information Technology Infrastructure Library) principles and best practices.\nStrong analytical and problem-solving skills, with the ability to translate business requirements into technical solutions.\n\nSoft Skills\n\nExcellent communication and interpersonal skills, with the ability to effectively engage and influence stakeholders at all levels of the organization.\nStrong leadership and team management abilities, with a focus on fostering collaboration and driving results.\nAdaptability and flexibility to manage changing priorities and demands in a fast-paced environment.\n\nKey Competencies\n\nStrategic Thinking: Ability to develop and execute a strategic vision for ITSM products that aligns with organizational goals and objectives.\nCustomer Focus: A commitment to understanding and meeting the needs of users and stakeholders, with a focus on delivering exceptional value and user satisfaction.\nInnovation: A proactive approach to identifying and implementing innovative solutions that enhance ITSM capabilities and drive business growth.\nCollaboration: A strong emphasis on teamwork and collaboration, with the ability to build and maintain positive working relationships across diverse teams.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/sr-itsm-business-analyst-at-providence-india-4143789220?position=3&pageNum=62&refId=9DAZTOuB47vYA4MZxFKVVA%3D%3D&trackingId=N5WkgcBoR6jHWeOIcetHnQ%3D%3D"
}