{
    "job_id": "4143436277",
    "title": "Business Analyst",
    "company": "noon",
    "location": "Gurugram, Haryana, India",
    "description": "Job title: Business Analyst\n\nLocation: Gurugram, India\n\n\n\n\nAbout noon\n\nnoon, the region's leading consumer commerce platform. On December 12th, 2017, noon launched its consumer platform in Saudi Arabia and the UAE, expanding to Egypt in February 2019. The noon ecosystem of services now includes marketplaces for food delivery, quick-commerce, fintech, and fashion. noon is a work in progress; we’re six years in, but only 5% done.\n\n\n\n\nnoon’s mission: Ring every doorbell, everyday.\n\n\n\n\nWhat you'll do:\n\nTeam noon has some of the fastest, smartest, and hardest-working people we've encountered. With a young, aggressive, and talented team, we're driving major missions forward.\n\n\n\n\nIn this role, you will:\n\nIdentify the problem, and structuring it to deliver the desired outcomes independently.\nBuild, develop and maintain data models, reporting systems, dashboards and performance metrics.\nManage and optimize processes for data intake, validation, mining and engineering as well as modeling, visualization and communication outputs.\nInterpret and report results for various growth aspects to relevant stakeholders.\n\n\n\n\nWhat you'll need:\n\n1-2 years of hands-on experience in SQL or any programming language is mandatory.\nExcellent analytical skills and problem-solving capabilities.\nAdvanced Excel/Google Sheets knowledge.\nKnowledge of Programming Languages - R/Python preferred.\nExperience in the e-commerce industry is preferred but not mandatory.\nAn individual who has strong problem-solving and team skills.\nAvid curiosity and passion to take on tough challenges.\nAbility to multitask and work on a diverse range of requirements.\nExperience with LookML\n\n\n\n\nWho will excel?\n\nWe’re looking for people with high standards, who understand that hard work matters.\nYou need to be relentlessly resourceful and operate with a deep bias for action.\nWe need people with the courage to be fiercely original.\nnoon is not for everyone; readiness to adapt, pivot, and learn is essential.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-noon-4143436277?position=5&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=ZTyGwOuXKp5OOf3Yb%2Bq97w%3D%3D"
}