{
    "job_id": "4144175593",
    "title": "Tender Management -Data Business Analyst",
    "company": "PSA BDP",
    "location": "Kakinada, Andhra Pradesh, India",
    "description": "Job Description\n\nAbout BDP International:\n\nPSA BDP, a member of the PSA Group, is a leading provider of globally integrated and port-centric supply chain, transportation, and logistics solutions. The company is headquartered in Philadelphia, PA, and employs more than 5,500 people worldwide.\n\nWe are a team that celebrates our unique diversity and close-knit community atmosphere. Our core values begin at the very top and span the broad reach of our global community.\n\nWe offer dynamic careers for those individuals looking to be a part of something bigger and provide unequivocal opportunities for growth within the organization.\n\nPSA BDP serves over 5,000 customers, including some of the world's leading multinational companies within the chemical, retail & consumer, life sciences & pharmaceuticals, and electric vehicle & industrial verticals.\n\nThe Data Analyst is dedicated to supporting the TM team in data ETL tasks as well as business intelligence reporting. They use data science, statistics and DB normalization tools and resources to help TM maintain structure treatment and use of its data in order to minimize tasks, guarantee data availability and accuracy, and to ultimately impact the team’s success ratio and productivity.\n\n\nDevelop and maintain a ETL framework for TM using tools including MS Excel Power Query, Power PVT, etc.\nDevelop and maintain a business intelligence and reporting network using tools including MS Power BI\nCreate and maintain a structure repository of data\nSupport the TM team members in their everyday data needs\n\n\nExplore, present, develop and implement innovative ideas to facilitate TM data processing, the team’s workflow, our productivity and our success ratio\n\nKey competencies\n\nGeneric standards\n\nFunctional standards\n\n\nSelf-starter, flexible, accountable\nCritical thinker\nKeen to submerge in PSABDP’s domain\nEffective communicator\nAdept in complex and detailed work\nPlanning, coordination, and result oriented\nThink and act as a project manager\nBe a bridge between the world of data science and PSA BDP’s core domain\nManage stakeholders to get thing done\nStrong multitasking skills and work prioritization skills\nPrecision in managing data\n\n\nJob Requirements\n\nAcademic Qualifications:\n\n\nGeneral:\nProficient in English for professional communication purposes\nA Bachelor’s degree in a relevant field such as:\nData Analytics\nBusiness Administration\nComputer Science\nMathematics/Statistics\nCertifications in Microsoft tools are a plus, e.g.:\nMicrosoft Certified: Power BI Data Analyst Associate\nMicrosoft Office Specialist (MOS) Excel Expert\nAdditional Tools (nice-to-have):\nSQL knowledge for data extraction and querying.\nKnowledge of Python/R for advanced data manipulation.\nAt least 3 years of experience working in roles involving advanced Excel and Power BI, such as:\nData Analyst\nBusiness Intelligence Specialist\nReporting Analyst\nMIS (Management Information Systems) Analyst\n\n\nPlease visit our website: psabdp.com\n\n*** This is a great opportunity to advance your career! Come join our growing BDP team!***\n\nBDP International - The Employer of Choice\n\nFollow BDP International Career Pages!\n\nFacebook l Twitter l LinkedIn\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/tender-management-data-business-analyst-at-psa-bdp-4144175593?position=6&pageNum=97&refId=HcfnYd3BMGIT%2FuoEZTo%2FBg%3D%3D&trackingId=Kz46ECB0%2FdpXdhVrZdQ0uA%3D%3D"
}