{
    "job_id": "4144134172",
    "title": "Data Scientist",
    "company": "Jubilant FoodWorks Ltd.",
    "location": "Noida, Uttar Pradesh, India",
    "description": "Analytics & insights function:\n\nOur vision is to build Analytics & insight function as a strategic differentiator for the company. What do we do –\n\nEmbed analytics across the organization to help increase revenue, improve operational efficiency, enable cost optimization, improve guest & employee experience and manage risk.\nHelp decision-makers in the business anticipate and respond faster to emerging trends.\n\n\n\n\nA lean team of data scientists, ML engineers, analysts & storytellers.\n\nWe are driven more by the commercial value of the data science than Kaggle submissions\nOur first instinct to improve model performance is data quality, feature engineering & validation vs trying 3 more techniques\nWe have a strong appetite for constant learning, thinking out of the box, questioning the problems & solutions with the intent to understand and solve better\nWe are finicky about version control, commented codes & documentation\nWe want to build strong personal connections & a fun workplace\n\n\n\n\nWhat is the purpose of this role?\n\nBuild data science capabilities that help Jubilant FoodWorks drive exponential growth\nEquip business to focus attention when & where it matters through assisted / predictive decision-making\n\n\n\n\nWhat will be your key responsibilities?\n\nSolve business problems by applying Machine Learning / Deep Learning models on large volumes of data\nWork on a full spectrum of activities from framing solutions, identifying data sources (internal & external), conducting experiments, and delivering production-ready models to model management\nKnowledge management (well-documented codes, code repository, project briefs, interim Excel files, presentations, research)\nProactive communication to understand the problem, work progress & results\nManage individual project priorities, deadlines, and deliverables\n\n\n\n\nA little bit about you:\n\n4-8 years of experience building scalable models in a production setting on a large volume of data\nStrong data wrangling & programming skills(Python, SQL) & experience with cloud technologies, experience with Scala, Spark gives you additional points\nIntermediate level understanding in any of the areas – Machine Learning, Deep Learning, experience with unstructured data is a plus\nPractical knowledge of working with code repository & agile framework\nStrong match with our value system & DNA\nPreferred domain experience - Supply chain network optimization/forecasting/inventory management, Personalization / Customer Science\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-jubilant-foodworks-ltd-4144134172?position=3&pageNum=7&refId=7K0A6BY3KVkrDHUGwB%2BKXQ%3D%3D&trackingId=vu2grKHnresmrmyKpDG3AQ%3D%3D"
}