{
    "job_id": "4144355735",
    "title": "Business Analyst || Life Insurance || International Market Exposure(Immediate Joiners)",
    "company": "Damco Solutions",
    "location": "India",
    "description": "Position Title: Business Analyst || Life Insurance || International Market Exposure(Immediate Joiners)\n\nExperience Level: 6+ Years\n\nLocation: Remote\n\n\n\n\nExpected Skills/ Competency/JD\n\nGood knowledge on Policy Administration system for Individual Life, Annuities and Group Life.\nKnowledge and hands on experience in Quotation & Illustrations, Agency management and Commissions, Accounting, Portals, Reinsurance.\nActively participate in requirement gathering, gap analysis, and feasibility study, prepare functional requirement/Design document, coordination and walk thru with developers/business users, testing and implementing the changes in the system.\nExcellent written and verbal communication skills to clearly and concisely present requirements.\nReview delivered solutions for quality and accuracy.\n\n\n\n\nMust have Skill set\n\nStrong understanding of policy administration processes and systems specific to Individual Life, Annuities, and Group Life Insurance.\nProficiency in navigating, configuring, and managing policy lifecycle events such as issuance, servicing, renewals, and cancellations.\nPractical experience in Quotation and Illustration generation to support life and annuity policy proposals.\nSolid knowledge of Agency Management and Commissions processes, including agent onboarding, commission structures, and payout calculations.\nStrong skills in eliciting and documenting requirements through workshops, stakeholder interviews, and documentation review.\nAbility to conduct gap analysis to identify areas of improvement and feasibility studies to assess the impact and practicality of proposed changes.\nProficiency in creating Functional Requirement Specifications (FRS) and Design Documents to clearly outline system capabilities and solutions.\nDemonstrated experience in facilitating requirement walkthroughs and design discussions with both technical and business stakeholders.\nEffective collaboration with developers and QA teams to ensure accurate implementation and testing of system changes.\nSkilled in coordinating and communicating with business users to ensure alignment on requirements and expected outcomes.\nExcellent written and verbal communication skills to effectively translate technical and business requirements for various audiences.\nSkilled in producing clear and comprehensive documentation including requirements, functional specifications, and user guides.\n\n\n\n\nGood to have Skill set\n\nFamiliarity with regulatory standards like HIPAA, GDPR, and IFRS17, especially as they pertain to life insurance, annuities, and group life.\nKnowledge of state-specific regulations for insurance and compliance considerations for policy administration.\nFamiliarity with Agile methodologies (e.g., Scrum, Kanban) and experience in tools like JIRA, Confluence, or Azure DevOps for project tracking and collaboration.\nUnderstanding of product lifecycle management for designing, launching, and maintaining new insurance products, including experience with product configuration tools.\nStrong stakeholder engagement skills to effectively collaborate with diverse teams, including business users, developers, and executives.\nProficiency in conflict resolution techniques to handle competing priorities or differing requirements.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-life-insurance-international-market-exposure-immediate-joiners-at-damco-solutions-4144355735?position=1&pageNum=37&refId=7Scw1Dd0tMof41tt6zSiVA%3D%3D&trackingId=yWPJXjVr%2Fvx9OB1tpj97Fw%3D%3D"
}