{
    "job_id": "4144857418",
    "title": "Business Analyst-Telecom",
    "company": "BT Group",
    "location": "Bengaluru, Karnataka, India",
    "description": "Experience working across Waterfall and Agile methodology driven projects\nExperience working in complex projects & across different technologies.\nSelf-starter who can lead the way by setting up prototypes for vendor technical teams to follow\nContribute to the definition of the team processes and standards\nKnowledge of Microservices based architecture, CICD DevOps framework and associated tools, Camunda based workflow is an advantage.\n\n\n\n\nPrepare system specification document based on functional specifications\nUnderstand business requirements and translate them into component specific designs, provide design walkthrough to the development team, validate the outcome meets the business requirements.\nAbility to understand how technology supports business and organization goals & accordingly propose and review solutions/ approaches using various technologies/ tools available in market, based on which the implementation very well fit within allotted budget and timelines.\nRegular review of various ongoing project implementations to ensure maximum efficiency and performance from the deliverables.\nEnsure compliance with company standards and procedures by ensuring timely review with Chief and platform architects.\nBuild and maintain strong relationship with various stakeholders within BT Technology and Openreach through regular meetings and communications.\nProvide direction and guidance to internal teams on technology front.\nRegular upskilling of various technologies (as required for the role) by learning latest developments in the market.\nConducting training sessions and seminars on various technologies and tools, for internal (within BT) and external (Vendor) teams.\nCome up with innovative and exciting ideas those can add value to business\nCoordinate and work with vendor teams across various locations, while performing his/ her roles and responsibilities.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-telecom-at-bt-group-4144857418?position=5&pageNum=10&refId=I3x5Bv9xaOmHYCAjSz8m9w%3D%3D&trackingId=JYG8UHBIZSp7qOZ%2BG7Y9ZA%3D%3D"
}