{
    "job_id": "4144642185",
    "title": "Business Analyst",
    "company": "Emkay Global Financial Services Ltd",
    "location": "Mumbai Metropolitan Region",
    "description": "Job Responsibilities\n\n______________________________________________________________________________________\n\nClosely working with respective users & vendors to note down their requirements and drive the development with software solutions team.\n\nExhibits strong leadership qualities, working both independently and in team oriented collaborative environments.\n\nIs proactive, resourceful and a self-starter. Oversees and effectively leads multiple priorities/projects simultaneously from inception through post implementation review.\n\nAble to perform high level analysis for business requests and develops summary documents with executive finish.\n\nEngages in the planning, execution, and delivery of programs and projects intended to accomplish business goals and objectives within prescribed timeframes and budgets.\n\nDevelops an advanced understanding of how project activities contribute to the achievement of strategic business goals and operational objectives.\n\nCollaborates with key stakeholders and project/software solutions team to ensure objectives are met.\n\nDrives implementation of multiple, complex project initiatives, working closely with cross-functional teams and resources to achieve milestones within established timeframes.\n\nPlans, directs, and coordinates activities for complex programs and projects through the development of project plans intended to accomplish goals and objectives within prescribed timeframes and budgets.\n\nEnsures consistent visibility for teams by monitoring and reporting business objectives, program/project achievements, and key indicators.\n\nCommunicates with project stakeholders and provides insight on issues through root cause analysis.\n\nFacilitates collaboration on creative alternatives to project challenges with subject matter experts\n\nRemoves obstacles and impediments to ensure business and operational objectives are met.\n\nDrives adoption and challenges standards. Identifies and applies best practices and needed process improvements.\n\nEstablishes advanced capabilities in program and project design where possible.\n\nEnsures compliance with company policies and procedures. Monitors project execution to deliver incremental business value.\n\n\n\n\nRelationships Management\n\nBusiness team\nSoftware Solutions team\nTechnology team\n\n\n\n\nSkills\n\n--------------------------------------------------------------------------------------------------------------------------------------------\n\nStrong presentation development and communication skills\nStrong and demonstrable in Banking & Financial Services Domain experience\nExperienced in business process development and improvement\nIntermediate level user of Microsoft Excel, PowerPoint, and Visio\nKnowledge of Microsoft Access, SQL (MS 2016, MySQL, Oracle),\nKnowledge of ASP.Net, VB, C++ and MVC platforms will be a plus\n\n\n\n\nCompetencies required\n\n-------------------------------------------------------------------------------------------------------------------------------------------\n\nLives the company values of Emkay\nBusiness Awareness & Market Knowledge\nCustomer Centricity\nPeople connect\nExecution Excellence\nPersonal Effectiveness\n\n\n\n\n\n\n\nExperience\n\n-------------------------------------------------------------------------------------------------------------------------------------------\n\nProven proactive problem solver; identifying efficiencies, problem areas and potential improvements supporting key business objectives\nDemonstrated ability to apply technology solutions to business problems\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-emkay-global-financial-services-ltd-4144642185?position=1&pageNum=10&refId=I3x5Bv9xaOmHYCAjSz8m9w%3D%3D&trackingId=67Pjul9N%2FptbaDxr4%2B2heg%3D%3D"
}