{
    "job_id": "4144963471",
    "title": "Machine Learning Engineer",
    "company": "Lytx, Inc.",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Description\n\nWhy Lytx?:\n\nAs our Machine Learning Engineer, you will join our Applied Machine Learning Team in India, who develops machine learning and computer vision algorithms to monitor and assess the state of drivers and their environments to identify risk and improve safety for our clients. You will contribute to all aspects of the DL/ML model development and deployment cycle to improve the accuracy and throughput at reduced latency to help enhance and differentiate us as the leader in the Video Safety and Telematics industry. If this sounds like you, we encourage you to apply!\n\n\n\n\nWhat You'll Do:\n\nEnd-to-End development of DL/ML models – prototyping, formulation, data engineering, model training, etc.\nImplement, debug, and improvise DL/ML models.\nDevelop and optimize cloud/Edge deployment of DL models.\nOptimize DL models – quantization, model pruning, etc.\nOther duties as assigned.\n\n\n\n\nWhat You'll Need:\n\nBachelor's/MS degree in CS, EE, EC, or related fields\n2+ years of experience in prototyping a given problem, surveying literature & coming up with a suitable methods & training the models using one of the DL/ML frameworks.\nStrong understanding of core ML concepts, and hands on experience with at least 2 DL frameworks like PyTorch/TF\nStrong analytical & problem-solving skills with fundamental knowledge on relevant math, probability, and algorithms\nExperience in computer vision problems such as detection, classification, and segmentation. Additional experience with non-vision problems is a plus.\nAbility to work under minimal supervision and run structured experiments with end goal in mind.\nAbility to work in collaboration with developers on model implementation to ensure adequate system performance (latency and accuracy), security, scalability, and availability.\nFamiliarity with AWS Services (EC2, Sagemaker, DynamoDB, ECR, Lambda etc.) is preferred. Experience with MLOps tools such as SageMaker, Airflow, MLFlow, H2O, etc., is a plus.\nExperience with SQL or similar DB query language.\nExperience working with large dataset / long running / distributed training.\nExperience with any low-level programming language like C/C++ or deeper understanding of system architecture.\nStrong teammate who enjoys working in a collaborative, fast-paced team-focused environment\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/machine-learning-engineer-at-lytx-inc-4144963471?position=9&pageNum=10&refId=3OwYoZiMWUBkemlaz%2FA01Q%3D%3D&trackingId=PiQZO%2F8KWO%2BQSp7Yobh55g%3D%3D"
}