{
    "job_id": "4144920346",
    "title": "Business Analyst",
    "company": "Capco",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Title: Business Analyst with Coupa\n\n\n\n\nAbout Us\n\n“Capco, a Wipro company, is a global technology and management consulting firm. Awarded with Consultancy of the year in the British Bank Award and has been ranked Top 100 Best Companies for Women in India 2022 by Avtar & Seramount. With our presence across 32 cities across globe, we support 100+ clients across banking, financial and Energy sectors. We are recognized for our deep transformation execution and delivery.\n\nWHY JOIN CAPCO?\n\nYou will work on engaging projects with the largest international and local banks, insurance companies, payment service providers and other key players in the industry. The projects that will transform the financial services industry.\n\nMAKE AN IMPACT\n\nInnovative thinking, delivery excellence and thought leadership to help our clients transform their business. Together with our clients and industry partners, we deliver disruptive work that is changing energy and financial services.\n\n#BEYOURSELFATWORK\n\nCapco has a tolerant, open culture that values diversity, inclusivity, and creativity.\n\nCAREER ADVANCEMENT\n\nWith no forced hierarchy at Capco, everyone has the opportunity to grow as we grow, taking their career into their own hands.\n\nDIVERSITY & INCLUSION\n\nWe believe that diversity of people and perspective gives us a competitive advantage.\n\nMAKE AN IMPACT\n\n\n\n\nJob Title: Business Analyst\n\n\n\n\nAbout the Role: Business Analyst with Coupa\n\n\n\n\nExperience: 7-13 Years\n\nLocations: Open to Bangalore, Pune, and Mumbai, with Bangalore as the top preference.\n\nNotice Period: Immediate to 45 Days\n\n\n\n\nJob Description:\n\n\n\n\nWe are looking for an experienced and results-driven Business Analyst to join our team. The ideal candidate will bring exceptional analytical skills, experience with Coupa implementation, and a deep understanding of the banking domain.\n\n\n\n\nKey Responsibilities:\n\n• Collaborate with stakeholders to gather, analyze, and document business requirements (BRD) and functional requirements (FRD).\n\n• Lead and support the implementation of Coupa solutions, ensuring alignment with business objectives.\n\n• Act as the primary liaison between business stakeholders and technical teams, ensuring clear communication and understanding.\n\n• Analyze and document workflows, processes, and system dependencies in the banking environment.\n\n• Facilitate workshops and meetings to drive alignment on requirements, priorities, and deliverables.\n\n• Perform gap analysis and recommend effective solutions to meet business needs.\n\n• Support testing activities, including creating test plans, executing test cases, and facilitating user acceptance testing (UAT).\n\n• Monitor project progress, identify risks, and propose mitigation strategies to ensure successful project delivery.\n\n\n\n\nQualifications:\n\n• Proven experience as a Business Analyst with strong expertise in creating BRD and FRD documents.\n\n• Hands-on experience with Coupa implementation or similar procurement systems.\n\n• Solid understanding of banking processes, regulations, and workflows.\n\n• Exceptional communication and stakeholder management skills.\n\n• Strong problem-solving abilities with a focus on delivering practical solutions.\n\n• Proficiency in business analysis tools and methodologies.\n\n• Bachelor's degree in Business Administration, Finance, Information Systems, or a related field (preferred).\n\n\n\n\nPreferred Skills:\n\n• Experience in Agile methodologies and working in cross-functional teams.\n\n• Knowledge of procurement and expense management systems in the banking sector.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-capco-4144920346?position=6&pageNum=30&refId=8iL61BV3%2BLG7BSz3Qgjsxw%3D%3D&trackingId=57UPEkBsXeZm2dHEeQbncg%3D%3D"
}