{
    "job_id": "4144807056",
    "title": "Data Scientist",
    "company": "Weekday Jobs (YC W21)",
    "location": "Bengaluru, Karnataka, India",
    "description": "This role is for one of the Weekday's clients\n\nThe Role\n\nWe are seeking a Senior Data Scientist to join our dynamic team and lead the development of machine learning components for our innovative MRV and decarbonization platform. This role will be crucial in integrating advanced AI, satellite remote sensing, and comprehensive carbon footprint tracking to provide a holistic solution for agricultural enterprises, government agencies, and farmers.\n\nKey Responsibilities\n\n\nAnalyze large datasets to identify trends, patterns, and insights.\nDevelop predictive models using machine learning techniques.\nCreate visualizations to effectively communicate findings.\nWork closely with stakeholders to understand business objectives.\nConduct experiments and A/B testing for data validation.\nDesign and maintain databases to support data collection and storage.\nCollaborate with IT and data engineering teams to enhance data infrastructure.\nMonitor model performance and implement improvements.\nImplement data mining techniques to extract useful information.\nPrepare reports by summarizing data insights and recommendations.\nUtilize statistical methodologies for data analysis.\nStay updated with industry trends and new technologies.\nTrain and mentor junior data scientists and analysts.\nAssist in the interpretation of data and sharing insights across teams.\nEnsure data quality and integrity throughout the analysis process.\n\n\nRequired Qualifications\n\n\nBachelor’s or Master’s degree in Data Science, Statistics, Computer Science, or a related field.\nProven experience as a Data Scientist or similar role.\nStrong background in statistical analysis and computational techniques.\nProficiency in programming languages, particularly Python or R.\nExperience with data visualization tools (e.g., Tableau, Power BI).\nSolid understanding of SQL and database management.\nFamiliarity with big data technologies (e.g., Hadoop, Spark).\nKnowledge of machine learning frameworks (e.g., TensorFlow, Scikit-learn).\nExcellent problem-solving skills and strategic thinking.\nStrong communication skills to effectively present data insights.\nAbility to work collaboratively in a team environment.\nExperience with data preprocessing and feature engineering.\nAbility to handle multiple projects and meet deadlines.\nDetail-oriented with a commitment to data integrity.\nPrior experience in a specific industry (e.g., finance, healthcare) is a plus.\nContinuous learner with a passion for data-driven solutions.\n\n\nSkills: python,tensorflow,feature engineering,data scientist,r,statistical analysis,sql proficiency,data preprocessing,machine learning,spark,scikit-learn,problem solving,model deployment,hadoop,data visualization,sql,data analysis\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-weekday-jobs-yc-w21-4144807056?position=5&pageNum=17&refId=rr4SH1GbEVcdwcmKQOXfGg%3D%3D&trackingId=pWo%2BPag0Zy5zOaUAickJsQ%3D%3D"
}