{
    "job_id": "4145363837",
    "title": "Business Analyst - RCM",
    "company": "Credence Global Solutions",
    "location": "Pune, Maharashtra, India",
    "description": "Job Roles & Responsibilities:\n\n\n\n\nCreates data integrity protocols and controls over business processes to ensure data management best practices.\nOperationalize business intelligence solutions to highlight strengths and opportunities to meet organizational strategies, objectives, and goals.\nAnalyze, maintain and generate large data sets of structured, semi-structured unstructured data to discover data insights and collaborate with business partners to deliver business value.\nSupports data related automation, ETL and dynamic data transfers such as API.\nPerforms other duties as assigned.\nSupports Finance, Billing, Market Access, Product and other teams on projects by preparing adhoc analysis and presentations as required.\nIdentifies and project manages opportunities for process improvements through to execution.\nCreates & conveys management reports, custom dashboards, visualizations and presentations.\nInitiates and supports projects, initiatives, solutions and other change management.\nTrain team members to enable them to generate reports\nEnhance RCM reports with clinical information to enable customers improve their practice operations\nUse applications like Power BI, Power apps, Advance excel, SQL, R\n\n\n\n\nCandidate Requirements:\n\n\n\n\nAt least 2 + years of relevant work experience in similar role / data analytics\nGood Communication and Interpersonal skills\nStrong Analytical and Problem Solving skills\nExtremely organized and good time management skills\nHealthcare Revenue Cycle management domain knowledge is must.\nStrong Power BI, SQL and Advance Excel knowledge is a must\nKnowledge of statistical tools like SAS / R preferred\nKnowledge of R / Python / MSBI would be added advantage\nWillingness to work in Night shifts (Rotational)\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-rcm-at-credence-global-solutions-4145363837?position=4&pageNum=17&refId=otcMTVij75x3rORf5Q9zLA%3D%3D&trackingId=0rglLl9pEx3Q8ZDH4zxQOQ%3D%3D"
}