{
    "job_id": "4145081177",
    "title": "Data Scientist",
    "company": "Microsoft",
    "location": "Bengaluru, Karnataka, India",
    "description": "Overview \n\nThe Business & Industry Copilots group is a rapidly growing organization that is responsible for the Microsoft Dynamics 365 suite of products, Power Apps, Power Automate, Dataverse, AI Builder, Microsoft Industry Solution and more. Microsoft is considered one of the leaders in Software as a Service in the world of business applications and this organization is at the heart of how business applications are designed and delivered. \n\nThis is an exciting time to join our group Customer Zero Engineering and work on something highly strategic to Microsoft. The goal of Customer Zero Engineering is to build the next generation of our applications running on Dynamics 365, AI, Copilot, and several other Microsoft cloud services to deliver high value, complete, and Copilot-enabled application scenarios across all devices and form factors. We innovate quickly and collaborate closely with our partners and customers in an agile, high-energy environment. Leveraging the scalability and value from Azure & Power Platform, we ensure our solutions are robust and efficient. If the opportunity to collaborate with a diverse engineering team, on enabling end-to-end business scenarios using cutting-edge technologies and to solve challenging problems for large scale 24x7 business SaaS applications excite you, please come and talk to us!  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nJob Description\n\nWe are looking for a highly motivated and skilled Machine Learning Scientist II / MLOps Engineer II to join our team. The ideal candidate will have a strong background in machine learning, MLOps/AIOPs, and software engineering practices, and will be responsible for the development, deployment, and operationalization of machine learning models at scale. This role will work closely with data scientists, software engineers, and product teams to ensure the models are secure, reliable, and performant.\n\nResponsibilities\n\nKey Responsibilities:\n\n\nModel Development & Deployment:\nCollaborate with data scientists and engineers to design, build, and deploy machine learning models at scale.\nDevelop and maintain MLOps/AIOPs pipelines to automate the end-to-end lifecycle of machine learning models (from development to deployment, monitoring, and retraining).\nWork on the integration of models into production systems while ensuring scalability, security, and performance.\nModel Operationalization:\nImplement CI/CD pipelines for ML models, ensuring smooth deployments with minimal downtime.\nDesign and deploy robust monitoring and alerting systems for ML models in production to detect issues such as model drift or data skew.\nImplement model governance, version control, and logging systems to ensure compliance with internal standards and external regulations.\nOptimization & Scalability:\nOptimize machine learning models and pipelines for performance and cost efficiency (compute, storage).\nManage infrastructure for ML workloads using cloud-native tools (Azure, Kubernetes, Docker) or other container orchestration platforms.\nCollaboration & Communication:\nPartner with cross-functional teams, including Data Engineering, Product Management, and other Engineering teams to build cohesive solutions.\nProvide technical guidance to junior engineers and drive best practices for MLOps/AIOPS within the team.\nSecurity & Compliance:\nWork on securing models, data pipelines, and infrastructure in compliance with Microsoft's security standards.\nEnsure that the entire ML lifecycle adheres to privacy and compliance requirements (e.g., GDPR, CCPA).\n\nQualifications\n\nRequired Skills:\n\n\n4+ years of experience in machine learning, MLOps/AIOPs, or software engineering roles.\nProven track record of deploying large-scale machine learning systems in production.\nStrong experience with cloud platforms (Azure preferred) and infrastructure as code (e.g., Terraform, ARM templates).\nAdvanced knowledge of MLOps/AIOPs practices, including pipeline automation, monitoring, and orchestration.\nExperience optimizing ML models for performance and scalability in production environments.\nDemonstrated ability to lead initiatives, mentor junior team members, and influence cross-functional teams.\nSolid understanding of security and compliance frameworks relevant to ML operations.\nHands-on experience in building and deploying ML models in a cloud environment (preferably Azure).\nProficiency in Python and experience with ML frameworks (e.g., TensorFlow, PyTorch).\nExperience with containerization (Docker, Kubernetes) and microservices architecture.\nStrong knowledge of CI/CD tools and workflows (Azure DevOps, GitHub Actions).\nBasic understanding of model monitoring, retraining, and model governance practices.\n\n\nDesired Skills\n\n\nExperience with Azure Machine Learning, Azure Fabric, Synapse, or similar platforms.\nStrong understanding of data versioning, governance, and reproducibility in ML workflows.\nKnowledge of responsible AI practices, including fairness, transparency, and bias mitigation.\nStrong communication skills and the ability to work in a fast-paced, collaborative environment.\n\n\n#BICJobs\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-microsoft-4145081177?position=24&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=1nBQJ%2Fr%2FistjD85aVsMj0Q%3D%3D"
}