{
    "job_id": "4145617310",
    "title": "Senior Business Analyst",
    "company": "Gameskraft",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Description:\n\nDesignation: Senior Business Analyst\n\nThe Business Analyst role is one of the most crucial roles in any organization and so is it in Gameskraft. This role offers to take the initiative, deal with challenging problems, find insights from existing data and present it through the power of data visualization\n\n\n\n\nWhat you'll do\n\n● You’ll be a part of the revenue/business function and will deal with key data sets like revenue trends, Arpu retention, reactivation, user cohorts, new vs old users etc.\n\n● You’ll be involved in solving complex business problems which will directly impact the company's growth.\n\n● Solving these problems, will involve data analysis, and insights generation using tools like SQL, Python, Tableau, Excel etc.\n\n● You’ll be involved in multiple cycles of data analysis – forming an initial hypothesis, extracting, analyzing, dissecting that data as per the hypothesis, presenting the insights in a crisp actionable manner; and then keep re-iterating the whole process till you reach the conclusion\n\n● You’ll also be responsible for fixing data issues in coordination with the data engineering team and conducting root cause analysis.\n\n● You’ll also get a chance to coordinate and interact with multiple stakeholders from product, marketing and Cx teams\n\n\n\n\nWhat you will bring\n\nWell, apart from a few cookies every day, it’d be great if you came with these\n\n● Bachelor’s degree in engineering, Operations Research, Maths, or related discipline\n\n● 2-3 yrs. experience in the data analytics domain preferably for a product-oriented company.\n\n● Candidate needs to exhibit structured thinking and strong analytical skills\n\n● Hands-on experience with data manipulation tools like SQL, R, Python, Excel etc. ● Exposure to visualization tools like Tableau, Power BI etc\n\n\n\n\nWhat can you expect?\n\n\n\n\nWork Culture\n\n• A true startup culture - young, fast-paced, where you are driven by personal ownership of solving challenges that help you grow fast\n\n• Focus on innovation, data orientation, being results-driven, taking on big goals, and adapting fast • A high-performance, meritocratic environment, where we share ideas, debate, and grow together with each new product\n\n• Massive and direct impact on the work you do. Growth through solving dynamic challenges Leveraging technology & analytics to solve large-scale challenges\n\n• Working with cross-functional teams to create great products and take them to market • Rub shoulders with some of the brightest & most passionate people in the gaming & consumer internet industry\n\n\n\n\nCompensation & Benefits\n\n• Attractive compensation and ESOP package\n\n• INR 5 Lakh medical insurance cover for yourself and your family\n\n• Fair & transparent performance appraisals\n\n• An attractive Car Lease Policy\n\n• Relocation benefits\n\n• A vibrant office space with fully stocked pantries. And your lunch is on us!\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-gameskraft-4145617310?position=10&pageNum=2&refId=dmyDsuYITNpOArSK52WyDg%3D%3D&trackingId=S9ln9m7wikojxYD%2B9fGz6A%3D%3D"
}