{
    "job_id": "4145901399",
    "title": "Senior Business Analysis - (Data Ops ) -Front to Back Office",
    "company": "Capco",
    "location": "India",
    "description": "Job Title:Senior Business Analysis - (Data Ops ) - Front to Back Office\n\nAbout Us\n\n“Capco, a Wipro company, is a global technology and management consulting firm. Awarded with Consultancy of the year in the British Bank Award and has been ranked Top 100 Best Companies for Women in India 2022 by Avtar & Seramount. With our presence across 32 cities across globe, we support 100+ clients across banking, financial and Energy sectors. We are recognized for our deep transformation execution and delivery.\n\nWHY JOIN CAPCO?\n\nYou will work on engaging projects with the largest international and local banks, insurance companies, payment service providers and other key players in the industry. The projects that will transform the financial services industry.\n\nMAKE AN IMPACT\n\nInnovative thinking, delivery excellence and thought leadership to help our clients transform their business. Together with our clients and industry partners, we deliver disruptive work that is changing energy and financial services.\n\n#BEYOURSELFATWORK\n\nCapco has a tolerant, open culture that values diversity, inclusivity, and creativity.\n\nCAREER ADVANCEMENT\n\nWith no forced hierarchy at Capco, everyone has the opportunity to grow as we grow, taking their career into their own hands.\n\nDIVERSITY & INCLUSION\n\nWe believe that diversity of people and perspective gives us a competitive advantage.\n\nMAKE AN IMPACT\n\nRole Description\n\n\nReview the TOM delivery in the Hub, assessing (but not limited to) consistency of account scope, sufficiency of the BSS reconciliation & substantiation process, adequacy of tooling & automation, assessment of staffing and location strategy, sufficiency of governance, key risk & performance indicators, and the MSS Operations BSS policy. Also including the adequacy of the escalation methodology & account documentation.\nComplete a gap analysis of the current BSS TOM against Germany's current operating model.\n\n\nRequired Capabilities Across The Resources Will Include\n\n\nExperience in best practice target operating model design and implementation\nExperience designing and documenting complex process flows\nExperience of working within a global Operations function.\nCapital Markets knowledge (across asset classes).\nStrong communication skills, with the ability to build relationships and navigate ambiguity.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analysis-data-ops-front-to-back-office-at-capco-4145901399?position=1&pageNum=42&refId=xxyg9D9a0iqwhm5TUVsTxQ%3D%3D&trackingId=pkEuxG34tIXC4IeYI%2B8UXw%3D%3D"
}