{
    "job_id": "4145754789",
    "title": "Technical Business Analyst - ERP Tririga [T500-16211]",
    "company": "McDonald's",
    "location": "Hyderabad, Telangana, India",
    "description": "Work location: Hyderabad, India\n\n\n\n\nWork pattern: Full time role.\n\n\n\n\nWork mode: Hybrid.\n\n\n\n\nJob Title: Business Technical Analyst\n\nJob Summary:\n\nWe are seeking a skilled Business Technical Analyst with a strong background in IBM TRIRIGA and its integration areas. This role involves working closely with Business and Solution Architects to understand business needs, translating those needs into functional and technical requirements, and ensuring the successful implementation of TRIRIGA solutions.\n\n\n\n\nJob Description:\n\nThe Business Technical Analyst (BTA) supports the Product Management team in defining, prioritizing, and developing capabilities for the assigned product area. Responsibilities include writing requirements / user stories and acceptance criteria for features on the product roadmap, maintaining product documentation, supporting system integration, data management, user support, and aiding in the testing process. The role requires experience with requirement gathering, working with Agile frameworks and methodologies, and collaborating effectively with vendors, Product Managers, and other internal team members to deliver capabilities per defined requirements.\n\n\n\n\nResponsibilities:\n\nCollaborate with Product Owners and Proxy Product Owners to gather and document business requirements.\nAnalyze and document current business processes, identify gaps, and propose improvements. Work with stakeholders to streamline processes and enhance efficiency.\nWrite clear and concise user stories and acceptance criteria. Ensure that development teams understand the requirements and deliver solutions that meet business needs.\nParticipate in the testing process, including reviewing test scenarios, validating QA test results, and ensuring that solutions meet acceptance criteria.\nAbility to demo functionalities to Product Owners and Proxy Product Owners.\nExpertise in documenting complex functional requirements and creating and maintaining detailed design documentation.\nStrong communication skills and the ability to work across time zones are essential.\n\n\n\n\nRequired Skills & Qualifications:\n\nProven working experience as a Business Data Analyst.\nStrong analytical skills and the ability to solve complex business challenges related to lease and financial integration.\nExcellent communication and stakeholder management skills, with the ability to engage both business and IT teams.\nExperience with SAFe Agile processes, Scrum methodologies, and tools like Jira and Confluence.\nBachelor’s degree in computer science, Information Technology, or a related field.\n\n\n\n\nAdditional Information:\n\nMcDonald’s is committed to providing qualified individuals with disabilities with reasonable accommodations to perform the essential functions of their jobs. McDonald’s provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to sex, sex stereotyping, pregnancy (including pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), race, color, religion, ancestry or national origin, age, disability status, medical condition, marital status, sexual orientation, gender, gender identity, gender expression, transgender status, protected military or veteran status, citizenship status, genetic information, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n\n\n\n\nMcDonald’s Capability Center India Private Limited (“McDonald’s in India”) is a proud equal opportunity employer and is committed to hiring a diverse workforce and sustaining an inclusive culture. At McDonald’s in India, employment decisions are based on merit, job requirements, and business needs, and all qualified candidates are considered for employment. McDonald’s in India does not discriminate based on race, religion, colour, age, gender, marital status, nationality, ethnic origin, sexual orientation, political affiliation, veteran status, disability status, medical history, parental status, genetic information, or any other basis protected under state or local laws.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/technical-business-analyst-erp-tririga-t500-16211-at-mcdonald-s-4145754789?position=1&pageNum=15&refId=rYf7Kk8Eb63jO7gIoGSEug%3D%3D&trackingId=qHwLp6xpszopRFcVxaGQeA%3D%3D"
}