{
    "job_id": "4146733541",
    "title": "Business Analyst",
    "company": "GHX",
    "location": "Hyderabad, Telangana, India",
    "description": "Role Summary:\n\nBusiness Analyst is responsible for the implementation of new initiatives within the Customer Care team and technical exposure to IPA (Intelligent Process Automation). The individual will work with the Operations Team to own the process to operationalize strategy as it relates to new products, scope of services and technology. The role provides input into Automation Support as it relates to IPA Bots, automation, efficiency, product growth and knowledge management. The individual works cross functionally across Product, Customer Care, Automation, Technology and GHX India.\n\nRoles & Responsibilities:\n\n\nEvaluating business processes, uncovering areas for improvement, and developing and implementing solutions within Customer Operations\nGet Trained on Intelligent Process Automation and collaborate with technical product team and customer support team.\nDocument existing and future business process flows across various systems\nGather and analyze data from various sources to support strategic decision-making.\nDevelop and maintain key performance indicators (KPIs) to measure the success of strategic initiatives.\nCollaborate with different departments and teams to understand their needs, challenges, and opportunities.\nEvaluate corporate systems initiatives and determine best method for implementation\nFacilitate workshops and meetings to gather input and insights from stakeholders.\nCreate project plans, timelines, and milestones to facilitate initiative implementation.\nProvide regular updates on the progress of strategic initiatives to relevant stakeholders.\nMonitor and evaluate the performance of implemented initiatives, recommending adjustments and improvements as necessary.\nConduct scenario analysis to assess the impact of different variables on project outcomes.\nReporting on Power BI with the use of other Power Apps.\n\n\nRequired Skills:\n\n\nExperience with CRM tools such as Salesforce\nExperience in RPA (Robotic Process Automation), AI (Artificial Intelligence), API (Application Program Interface), DBMS, SQL, Microsoft Office Dynamics 365.\nProven experience as a business analyst or in a similar analytical role.\nStrong analytical skills with the ability to interpret complex data sets.\nExcellent communication and presentation skills.\nProject management experience is desirable.\nFamiliarity with business intelligence tools and data visualization techniques.\nAbility to work collaboratively in a team and across different functional areas.\nStrategic thinking and problem-solving capabilities.\nData analysis: Proficiency in using data analysis tools like Excel, SQL, or BI tools to extract, analyze, and interpret data.\nProcess mapping: Ability to create process maps and diagrams to visualize business processes\nRequirements elicitation: Strong skills in interviewing stakeholders, conducting workshops, and using various elicitation techniques.\nDocumentation: Ability to write clear, concise, and well-structured documentation, such as requirements specifications and process models.\nProject management: Basic understanding of project management methodologies and tools.\nCustomer service orientation: A focus on providing excellent customer service and support.\nAdaptability: Ability to adapt to changing requirements and priorities.\nProfessional Use of Excel, Power BI, Tableau, Microsoft Office 365 applications, Power Automate & Power Apps is good to have.\n\n\nRequired Experience\n\n\nBS. degree in Computer Science, MIS, Engineering, or related discipline/experience, or a combination of education and related work experience\nExperience in RPA (Robotic Process Automation), AI (Artificial Intelligence), API (Application Program Interface), DBMS - SQL, Microsoft Office Dynamics 365 (good to have) .\nExperience in Healthcare, Supply Chain, Procurement / Customer Support is preferred.\n2+ years' work experience as a Business Analyst / Operations Business Analyst.\n\n\nGHX: It's the way you do business in healthcare\n\nGlobal Healthcare Exchange (GHX) enables better patient care and billions in savings for the healthcare community by maximizing automation, efficiency and accuracy of business processes.\n\nGHX is a healthcare business and data automation company, empowering healthcare organizations to enable better patient care and maximize industry savings using our world class cloud-based supply chain technology exchange platform, solutions, analytics and services. We bring together healthcare providers and manufacturers and distributors in North America and Europe - who rely on smart, secure healthcare-focused technology and comprehensive data to automate their business processes and make more informed decisions.\n\nIt is our passion and vision for a more operationally efficient healthcare supply chain, helping organizations reduce - not shift - the cost of doing business, paving the way to delivering patient care more effectively. Together we take more than a billion dollars out of the cost of delivering healthcare every year. GHX is privately owned, operates in the United States, Canada and Europe, and employs more than 1000 people worldwide. Our corporate headquarters is in Colorado, with additional offices in Europe.\n\nDisclaimer\n\nGlobal Healthcare Exchange, LLC and its North American subsidiaries (collectively, “GHX”) provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, national origin, sex, sexual orientation, gender identity, religion, age, genetic information, disability, veteran status or any other status protected by applicable law. All qualified applicants will receive consideration for employment without regard to any status protected by applicable law. This EEO policy applies to all terms, conditions, and privileges of employment, including hiring, training and development, promotion, transfer, compensation, benefits, educational assistance, termination, layoffs, social and recreational programs, and retirement.\n\nGHX believes that employees should be provided with a working environment which enables each employee to be productive and to work to the best of his or her ability. We do not condone or tolerate an atmosphere of intimidation or harassment based on race, color, national origin, sex, sexual orientation, gender identity, religion, age, genetic information, disability, veteran status or any other status protected by applicable law. GHX expects and requires the cooperation of all employees in maintaining a discrimination and harassment-free atmosphere. Improper interference with the ability of GHX’s employees to perform their expected job duties is absolutely not tolerated.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-ghx-4146733541?position=3&pageNum=60&refId=RBk3qTVB%2BCNiFfiLUXOVnA%3D%3D&trackingId=EkppvV9qmhGYEQssGJNjEw%3D%3D"
}