{
    "job_id": "4146351094",
    "title": "Business Analyst (Consulting)",
    "company": "Gartner",
    "location": "Gurgaon, Haryana, India",
    "description": "About this role:\n\nConsulting, Strategy & Operations is a division within Gartner which encompasses Consulting Technology and other core functions to support Gartner’s Consulting team. This role will partner with key business stakeholders across the company to support a Consulting organization of more than 1,000 associates. Consulting Technology is on the forefront of innovation helping Consulting Associates to sell and deliver high quality engagements.\n\nWe are seeking a skilled Business Analyst to join a group of professionals who are participating in the exciting phase of revolutionizing Analytics for Consulting Business Unit. In this role, you will play a pivotal role in driving data-driven decision-making for our business. You will work closely with cross-functional teams to understand business needs, translate them into actionable insights, and deliver impactful solutions. If you are excited about delivering impact within a fast-moving environment and passionate about delivering customer-center solutions, this is the role for you.\n\nWhat you’ll do:\n\n\nCollaborate with internal stakeholders to understand their business objectives, challenges, and opportunities.\nCreate clear and concise presentations to communicate findings to both technical and non-technical audiences.\nManage and prioritize multiple initiatives simultaneously, ensuring timely delivery and adherence to project timelines.\nCollaborate with project teams to define project scope, milestones, and deliverables.\nMonitor project progress and identify potential risks, taking proactive measures to mitigate them.\nBuild strong relationships with stakeholders, understanding their needs and exceeding their expectations.\nProactively engage with stakeholders and analytics team to identify new opportunities and efficiencies.\nProvide exceptional client service, ensuring timely communication and responsiveness.\n\n\nExpected Results:\n\n\nFocus on Business – Calibrate solutions to business problems\nRecognize business problems and work with Analytics team members to come up with the best solution.\nStrong relationship with the business stakeholders to ensure understanding of business needs\nEnsure that all assigned Consulting Analytics demonstrate business value and satisfy all defined business requirements gathered through consistent customer feedback\nHelp prioritizing work that will have the biggest business impact\n\n\nWhat you’ll need:\n\n\nGraduate or equivalent level qualification, preferably in a related discipline\n3-5 years of experience, preferable working in data analytics and visualization, business intelligence, or analytical consulting.\nExceptional Excel and PowerPoint skills. Experience in JIRA is a plus.\nStrong knowledge of Agile principles and process; experience driving requirements and delivery with SCRUM teams\nAbility to solve complex problems and successfully manage ambiguity and unexpected change\nAbility to thrive in a fast-paced, technical, and mission-focused environment.\nSolid written and verbal communication skills and knowledge to build strong relationships and influence across Consulting\nKnowledge in data warehousing architecture, and dimensional data modeling is a plus.\nAbility to work independently and with little direction, a self-starter.\n\n\nWho you are:\n\n\nMotivated, high-potential performer, with demonstrated ability to influence and lead.\nStrong communicator with excellent interpersonal skills.\nForward thinking, highly influential, and can walk people through the rationale behind a decision and convince them\nTeachable, embraces best practices, and leverages feedback as a means of continuous improvement\n\n\nWho are we?\n\nAt Gartner, Inc. (NYSE:IT), we guide the leaders who shape the world.\n\nOur mission relies on expert analysis and bold ideas to deliver actionable, objective insight, helping enterprise leaders and their teams succeed with their mission-critical priorities.\n\nSince our founding in 1979, we’ve grown to more than 20,000 associates globally who support ~15,000 client enterprises in ~90 countries and territories. We do important, interesting and substantive work that matters. That’s why we hire associates with the intellectual curiosity, energy and drive to want to make a difference. The bar is unapologetically high. So is the impact you can have here.\n\nWhat makes Gartner a great place to work?\n\nOur sustained success creates limitless opportunities for you to grow professionally and flourish personally. We have a vast, virtually untapped market potential ahead of us, providing you with an exciting trajectory long into the future. How far you go is driven by your passion and performance.\n\nWe hire remarkable people who collaborate and win as a team. Together, our singular, unifying goal is to deliver results for our clients.\n\nOur teams are inclusive and composed of individuals from different geographies, cultures, religions, ethnicities, races, genders, sexual orientations, abilities and generations.\n\nWe invest in great leaders who bring out the best in you and the company, enabling us to multiply our impact and results. This is why, year after year, we are recognized worldwide as a great place to work.\n\nWhat do we offer?\n\nGartner offers world-class benefits, highly competitive compensation and disproportionate rewards for top performers.\n\nIn our hybrid work environment, we provide the flexibility and support for you to thrive — working virtually when it's productive to do so and getting together with colleagues in a vibrant community that is purposeful, engaging and inspiring.\n\nReady to grow your career with Gartner? Join us.\n\nThe policy of Gartner is to provide equal employment opportunities to all applicants and employees without regard to race, color, creed, religion, sex, sexual orientation, gender identity, marital status, citizenship status, age, national origin, ancestry, disability, veteran status, or any other legally protected status and to seek to advance the principles of equal employment opportunity.\n\nGartner is committed to being an Equal Opportunity Employer and offers opportunities to all job seekers, including job seekers with disabilities. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request reasonable accommodations by calling Human Resources at +1 (203) 964-0096 or by sending an email to ApplicantAccommodations@gartner.com.\n\nJob Requisition ID:95916\n\nBy submitting your information and application, you confirm that you have read and agree to the country or regional recruitment notice linked below applicable to your place of residence.\n\nGartner Applicant Privacy Link: https://jobs.gartner.com/applicant-privacy-policy\n\nFor efficient navigation through the application, please only use the back button within the application, not the back arrow within your browser.\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-consulting-at-gartner-4146351094?position=4&pageNum=22&refId=0jgrzIiQy2IEpj2UlbmQnQ%3D%3D&trackingId=G2RN9A%2BsYM4a4%2FcF7v30MA%3D%3D"
}