{
    "job_id": "4146041278",
    "title": "Senior Business Analyst",
    "company": "EPAM Systems",
    "location": "Chennai, Tamil Nadu, India",
    "description": "We are seeking a highly skilled and experienced Senior Business Analyst to join our team. The ideal candidate will have a strong background in various industries and be proficient in using market-leading technologies. This role involves analyzing business processes, identifying opportunities for improvement, and developing solutions that drive efficiency and productivity.\n\nResponsibilities\n\n\n\nAnalyze business needs and processes to identify improvement opportunities\nDevelop detailed business requirements and project plans\nCreate UI/UX designs and mockups tailored to business requirements\nCollaborate with cross-functional teams to implement solutions\nManage the Agile Scrum and Kanban processes, with a preference for expertise in SAFe\nWork with data, ETL, and APIs to optimize business operations\nUtilize AI models to enhance productivity in BA/PO activities\nTrack and report on project progress and outcomes\nEnsure compliance with industry regulations and standards\nMentor junior analysts and provide guidance\n\n\n\nRequirements\n\n\n\n8+ years of experience in business analysis or product ownership\nProficiency in BFSI, Healthcare, Insurance, and Lifesciences industries\nSkills in working with market-leading CRMs and ERPs\nBackground in UI/UX design and creating mockups\nExpertise in Agile methodologies including Scrum and Kanban\nFamiliarity with data analysis, ETL processes, and API integration\nKnowledge of AI models for productivity enhancement\n\n\n\nNice to have\n\n\n\nWorking experience with SAFe methodology\nAdvanced skills in CRMs and ERPs\nExperience in leading cross-functional teams\n\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-epam-systems-4146041278?position=6&pageNum=40&refId=EgsHbWy8%2FUnqSRbzGFEs%2Fw%3D%3D&trackingId=AIxD39Okl1gilN1rxU51oQ%3D%3D"
}