{
    "job_id": "4146658815",
    "title": "Senior Business Analyst",
    "company": "Weekday Jobs (YC W21)",
    "location": "Bengaluru, Karnataka, India",
    "description": "This role is for Weekday's client\n\nJob Description\n\nRole\n\nData Analysis And Solution Building\n\n\nConduct comprehensive data analysis to extract insights and recognize trends relevant to category management.\nUtilize dashboarding and reporting techniques to present data-driven insights effectively.\nEmploy building informed dashboards and reports to communicate analytical findings clearly.\nUtilize storytelling techniques to convey complex data insights in a compelling and understandable manner.\nFormulate solutions and recommendations grounded in data-driven insights to tackle business challenges and exploit opportunities.\n\n\nStrategic Planning And Insight Delivery\n\n\nCollaborate closely with management to furnish insights crucial for strategic planning and decision-making.\nPresent findings and recommendations to stakeholders in a clear and concise manner, fostering comprehension and alignment.\n\n\nRoot Cause Analysis & A/B Testing\n\n\nScrutinize metrics, key performance indicators (KPIs), and other data sources to pinpoint the root causes of process defects and inefficiencies.\nDevise strategies to rectify identified issues and enhance overall process efficiency.\n\n\nBusiness Development Support\n\n\nAid business development endeavors by offering insights and analysis to formulate efficient designs and solution processes.\nContribute to identifying growth prospects and optimizing resource utilization to propel business expansion.\n\n\nUser Experience And KPI Management\n\n\nCollaborate with internal stakeholders across the organization to ensure adherence to user experience standards and surpassing relevant KPIs.\nProactively engage with stakeholders to tackle challenges and implement solutions, augmenting user satisfaction.\n\n\nCost Reduction Initiatives\n\n\nExplore and execute cost reduction opportunities through rigorous data analysis and process optimization.\nIdentify areas for efficiency enhancement and deploy strategies to curtail operational costs while preserving user satisfaction.\n\n\nProblem-Solving And Task Prioritization\n\n\nExhibit exemplary problem-solving abilities and adept task prioritization to meet project deadlines and fulfill business objectives.\nDeliver exceptional user experience by promptly and professionally addressing inquiries and concerns.\n\n\nAnalytical Project Design And Implementation\n\n\nDevelop and execute analytical projects aimed at generating insights that drive business goals and decisions.\nExamples include, “enhancing order value”, “elevating conversion rates”, “retain customer”, \"increase utilisation” through data-driven strategies and initiatives.\n\n\nSkills\n\n\nProficiency in Excel and Google Sheets\nAdvanced Level MySQL (REQUIRED): Ability to write clean SQL queries, including knowledge of windows & statistical functions\nExperience with R/Python (Required)\nBasic understanding of statistics and modelling, as well as experience with A/B testing and experiments, is required\nFamiliarity with PrePost Analysis and Root Cause Analysis is preferred (Advantage)\nExperience with BI platforms such as Microstrategy, Metabase, Looker is preferred\nFamiliarity with Product Analytics tools like Google Analytics, Mixpanel, CleverTap, or any Product Analytics tool is desirable\n\n\nPersona\n\n\n3+ years of experience in Data Analyst, Business Analyst or related roles\nStrong analytical bent of mind.\nStrong bias for Action & have the ability to “get things done”.\nStrong interpersonal skills and ability to coordinate with multiple internal stakeholders\nExcellent organizational, project management, and time management skills.\nProficient in Verbal and Written Communication skills, with strong presentation abilities.\nShould be result & detail oriented and must have the ability to multi-task with minimum supervision.\nShould be a quick learner with ability to learn new tools/technology quickly.\nAbility to thrive in a fast-paced, deadline-driven environment with changing priorities\n\n\nSkills: r,python,statistics,google sheets,modeling,metabase,google analytics,excel,root cause analysis,business analyst,microstrategy,mysql,mixpanel,data analysis,a/b testing,clevertap,looker\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-weekday-jobs-yc-w21-4146658815?position=4&pageNum=37&refId=7Scw1Dd0tMof41tt6zSiVA%3D%3D&trackingId=ALZ3EESjVxeUlzYDV%2Fw7oQ%3D%3D"
}