{
    "job_id": "4146322234",
    "title": "Business Analyst",
    "company": "Curefit",
    "location": "Bengaluru, Karnataka, India",
    "description": "About Role :\n\nIn this role, you'll be responsible for leveraging data to drive business decisions, optimize revenue through data-driven pricing strategies, and ensure smooth inventory management. You'll work closely with cross-functional teams, providing key insights and reporting on performance to support strategic objectives and growth.\n\n\n\n\nRoles & Responsibilities :\n\nDashboarding and Streamlining Key KPI data visualization process across teams.\nDeveloping key insights from the data and sharing with relevant stakeholders for action.\nRevenue optimization through data-driven Pricing Strategies, elevating click-through and conversion rates, impressions.\nManage Inventory health, ensure seamless product availability and minimizing stock outs for bestsellers.\nImplement ROI-focused strategies by aligning pricing models with financial objectives.\nAnalyze and publish weekly/monthly margin reports and sales analysis; present findings and results to key stakeholders.\nConducting in-depth sales analysis, customer churn analysis, and retention strategies across all business units.\nTracking out monthly, quarterly and yearly KPIs and providing deeper insights in the business.\nCollaborate with cross functional stakeholders and own the Business analysis charter end to end.\n\n\n\n\nEligibility :\n\nBachelor's degree in finance, accounting, business, economics, engineering , analytics, mathematics, statistics or a related technical or quantitative field.\nExperience in working with databases, ETL and SQL in a business environment.\nRelevant Business Analytics experience of 4-6 years.\nShould have relevant experience in data analytics working with large data sets and to extract and transform data using various tools and technologies.\nShould be able to use data to support ideas, drive actionable outcomes, and provide unique ways to present data and information in an easy to consume format.\nShould be passionate about finding root causes, trends, and patterns and how they impact business.\nShould be very comfortable juggling competing priorities and handling ambiguity.\nShould be able to thrive in an agile and fast-paced environment on highly visible projects and initiatives.\nAny experience in the Apparel category is a big plus.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-curefit-4146322234?position=2&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=DUh41D4KqfwwrZoNtVudfw%3D%3D"
}