{
    "job_id": "4146298199",
    "title": "Data Scientist Intern",
    "company": "ABEX Group",
    "location": "Chennai, Tamil Nadu, India",
    "description": "About The Internship\n\nAre you passionate about Data Science and Machine Learning? Do you have a strong understanding of SQL and Deep Learning? ABEX Excellence Private Limited is looking for a dynamic Data Science intern to join our team! As an intern, you will have the opportunity to work on cutting-edge projects and gain hands-on experience in the field of Data Science.\n\n1. Collaborate with the Data Science team to develop machine learning models for predictive analytics.\n\n2. Analyze and interpret complex data sets to uncover key insights and trends.\n\n3. Use SQL to extract and manipulate data from various sources.\n\n4. Implement deep learning algorithms to enhance data analysis processes.\n\n5. Assist in the development and optimization of data pipelines and workflows.\n\n6. Present findings and recommendations to key stakeholders.\n\n7. Stay up-to-date on the latest trends and technologies in Data Science and Machine Learning.\n\nIf you are eager to learn and grow in a fast-paced environment, we want to hear from you! Apply now and take the first step towards an exciting career in Data Science with ABEX Excellence Private Limited.\n\nSkill(s) required\n\nData Science, Deep Learning, Machine Learning, SQL\n\nWho Can Apply\n\nOnly those candidates can apply who:\n\n1. are available for full time (in-office) internship\n\n2. can start the internship between 6th Feb'25 and 13th Mar'25\n\n3. are available for duration of 3 months\n\n4. Candidates who are from Chennai and neighboring cities\n\n5. have relevant skills and interests\n\n\nWomen wanting to start/restart their career can also apply.\n\n\n\nPerks\n\nCertificate, Letter of recommendation, Flexible work hours, Informal dress code, 5 days a week, Free snacks & beverages\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-intern-at-abex-group-4146298199?position=9&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=mbsrYBdy93puXoQ1GvVAZQ%3D%3D"
}