{
    "job_id": "4146562926",
    "title": "Business Analyst",
    "company": "LSEG (London Stock Exchange Group)",
    "location": "Bengaluru East, Karnataka, India",
    "description": "The Team\n\nYou will be working with internal product owners and a dynamic team of technologists using world-class software development practices with the backing of a large multinational organization. We have multiple scrum teams consisting of scrum masters, business analysts, user experience professionals, server and user interface developers, and quality assurance engineers. We strongly follow agile principles of continuous improvement:\n\n\nIndividuals and interactions over processes and tools\nWorking software over comprehensive documentation\nCustomer collaboration over contract negotiation\nResponding to change over following a plan\n\n\nThe Technology\n\nWe are working on a wide variety of groundbreaking applications using Python, AWS.\n\nTo support our development, we already use multiple standard industry tools like GitHub, Maven, Jenkins, Cucumber, Vagrant, and are always interested in other tools that we feel will help us engineer better products.\n\nPosition Overview\n\nAre you an outstanding Business Analyst with strong communication skills and plenty of experience of working with Agile development teams? We are looking for a BA to join us in the Financial Crime and Reputational Risk business unit. We’re currently working on an existing SaaS product and need someone like you to join us to take scope from Product Owners and translate into clearly articulated user stories for our development teams.\n\nThis is a fantastic opportunity to join an organization that sees the value that Business Analysts can bring to the Agile development process, and where there are fantastic opportunities to shape the role and develop your career. What’s more, you’ll get to work for the market leader in building the next generation of software for the industry.\n\nResponsibilities\n\n\nBe the main point of contact with Product Owners in order to elicit, analyze, and validate complex business requirements for the software we’re building.\nControl change from Product Owners that could affect the business case.\nDocument and translate the business requirements into detailed user stories for our UX and development teams with supporting diagrams, Acceptance Criteria and Rationales.\nAct as a proxy for the Product Owners as the key point of contact with the development teams to answer their questions about the requirements.\nBe accountable for maintaining a quality backlog of user stories, through activities such as backlog grooming.\nProvide input to the prioritization of the backlog to make sure the development teams are working on the right things in the right order.\nPlay the role of Scrum Master.\n\n\nBUSINESS ACUMEN\n\n\nBe accountable for the quality of your work, ensuring it’s delivered within agreed procedures and timeframes.\nBecome a subject matter expert in AML and KYC (assuming you’re not already!).\nLook at how we’re working and suggest how we can do it even better!\n\n\nSkills & Experiences\n\n\nExperience in Scrum / Agile methodology, including writing user stories and acceptance criteria utilizing Behavioral Driven Development (BDD)\nBusiness analysis experience within a global organization.\nAbility to capture business requirements and represent them effectively.\nExcellent communication skills including ability to influence and negotiate.\nExcellent presentation and facilitation skills.\nExcellent problem solving, analysis, research and process mapping skills.\nExcellent writing skills - both technical and non-technical.\nCustomer focused and dedicated to meeting the expectations and requirements of the customer.\n\n\nBenefits\n\nWe are looking for intellectually curious people, passionate about the bigger picture of how technology industry is evolving, ready to ask difficult questions and deal with complicated scenarios! If you are creative and a problem solver, this is the place to be as will be supporting you to fast-forward your career!\n\nWe enhance each employee’s potential through personal development through a wide range of learning tools both formal and informal.\n\nLSEG is a leading global financial markets infrastructure and data provider. Our purpose is driving financial stability, empowering economies and enabling customers to create sustainable growth.\n\nOur purpose is the foundation on which our culture is built. Our values of Integrity, Partnership, Excellence and Change underpin our purpose and set the standard for everything we do, every day. They go to the heart of who we are and guide our decision making and everyday actions.\n\nWorking with us means that you will be part of a dynamic organization of 25,000 people across 65 countries. However, we will value your individuality and enable you to bring your true self to work so you can help enrich our diverse workforce. You will be part of a collaborative and creative culture where we encourage new ideas and are committed to sustainability across our global business. You will experience the critical role we have in helping to re-engineer the financial ecosystem to support and drive sustainable economic growth. Together, we are aiming to achieve this growth by accelerating the just transition to net zero, enabling growth of the green economy and creating inclusive economic opportunity.\n\nLSEG offers a range of tailored benefits and support, including healthcare, retirement planning, paid volunteering days and wellbeing initiatives.\n\nWe are proud to be an equal opportunities employer. This means that we do not discriminate on the basis of anyone’s race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital status, veteran status, pregnancy or disability, or any other basis protected under applicable law. Conforming with applicable law, we can reasonably accommodate applicants' and employees' religious practices and beliefs, as well as mental health or physical disability needs.\n\n\nDetail oriented and highly organized, with the ability handle multiple complex tasks.\nUnderstands the principles of usability and helps ensure the software is fit for purpose.\nUnderstands requirements management best practice and ensures these practices are used.\nUnderstands the effects of technology used within development, and the impact on the business client.\nAble to produce quality deliverables and meet deadlines.\nAn understanding of the KYC / AML environment would be highly beneficial QUALIFICATIONS\nBachelor’s Degree required\nKnowledge of Business Analysis Book of Knowledge or CBAP an advantage\nComputer literate – MS Word, Excel, PowerPoint, Project, Visio, Internet proficient\n\n\nLSEG is a leading global financial markets infrastructure and data provider. Our purpose is driving financial stability, empowering economies and enabling customers to create sustainable growth.\n\nOur purpose is the foundation on which our culture is built. Our values of Integrity, Partnership, Excellence and Change underpin our purpose and set the standard for everything we do, every day. They go to the heart of who we are and guide our decision making and everyday actions.\n\nWorking with us means that you will be part of a dynamic organisation of 25,000 people across 65 countries. However, we will value your individuality and enable you to bring your true self to work so you can help enrich our diverse workforce. You will be part of a collaborative and creative culture where we encourage new ideas and are committed to sustainability across our global business. You will experience the critical role we have in helping to re-engineer the financial ecosystem to support and drive sustainable economic growth. Together, we are aiming to achieve this growth by accelerating the just transition to net zero, enabling growth of the green economy and creating inclusive economic opportunity.\n\nLSEG offers a range of tailored benefits and support, including healthcare, retirement planning, paid volunteering days and wellbeing initiatives.\n\nWe are proud to be an equal opportunities employer. This means that we do not discriminate on the basis of anyone’s race, religion, colour, national origin, gender, sexual orientation, gender identity, gender expression, age, marital status, veteran status, pregnancy or disability, or any other basis protected under applicable law. Conforming with applicable law, we can reasonably accommodate applicants' and employees' religious practices and beliefs, as well as mental health or physical disability needs.\n\nPlease take a moment to read this privacy notice carefully, as it describes what personal information London Stock Exchange Group (LSEG) (we) may hold about you, what it’s used for, and how it’s obtained, your rights and how to contact us as a data subject.\n\nLSEG is a leading global financial markets infrastructure and data provider. Our purpose is driving financial stability, empowering economies and enabling customers to create sustainable growth.\n\nOur purpose is the foundation on which our culture is built. Our values of Integrity, Partnership, Excellence and Change underpin our purpose and set the standard for everything we do, every day. They go to the heart of who we are and guide our decision making and everyday actions.\n\nWorking with us means that you will be part of a dynamic organisation of 25,000 people across 65 countries. However, we will value your individuality and enable you to bring your true self to work so you can help enrich our diverse workforce. You will be part of a collaborative and creative culture where we encourage new ideas and are committed to sustainability across our global business. You will experience the critical role we have in helping to re-engineer the financial ecosystem to support and drive sustainable economic growth. Together, we are aiming to achieve this growth by accelerating the just transition to net zero, enabling growth of the green economy and creating inclusive economic opportunity.\n\nLSEG offers a range of tailored benefits and support, including healthcare, retirement planning, paid volunteering days and wellbeing initiatives.\n\nWe are proud to be an equal opportunities employer. This means that we do not discriminate on the basis of anyone’s race, religion, colour, national origin, gender, sexual orientation, gender identity, gender expression, age, marital status, veteran status, pregnancy or disability, or any other basis protected under applicable law. Conforming with applicable law, we can reasonably accommodate applicants' and employees' religious practices and beliefs, as well as mental health or physical disability needs.\n\nPlease take a moment to read this privacy notice carefully, as it describes what personal information London Stock Exchange Group (LSEG) (we) may hold about you, what it’s used for, and how it’s obtained, your rights and how to contact us as a data subject.\n\nIf you are submitting as a Recruitment Agency Partner, it is essential and your responsibility to ensure that candidates applying to LSEG are aware of this privacy notice.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-lseg-london-stock-exchange-group-4146562926?position=2&pageNum=27&refId=qUEK%2BRRfTlwms%2BZrzTuWbg%3D%3D&trackingId=6vhnyj4fJFPzuHQgogp7Pg%3D%3D"
}