{
    "job_id": "4146663035",
    "title": "Senior Lead Analyst - BA",
    "company": "FIS",
    "location": "Pune, Maharashtra, India",
    "description": "Senior Lead Analyst - Business Analysis\n\n\n\n\nAre you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun.\n\nAbout the team\n\nInvestment Accounting Manager is an investment management accounting and reporting solution for Mutual funds and Hedge Funds, and Fund Administrators. A Realtime, multi-currency accounting and position management connecting middle and back-office operations with flexible accounting rules that allow it to support the most complex mutual fund business.\n\nWhat you will be doing\n\nThe BA is responsible for the project planning and execution throughout the project lifecycle, including: gathering and prioritizing product and customer requirements, and working closely with engineering, client reps, Product Owner and Product management, and support to ensure revenue and customer satisfaction goals are met. The Business Analyst’s job also includes ensuring that the product supports the company's overall strategy and goals\n\nThis multifaceted role will cross accounting rules for many asset classes such as (but not limited to): Equities, Fixed Income, Currencies, Credit Default Swaps to Bank Loans. This individual will be responsible for managing and creating easy-to-use system workflows and exception management for full trade life cycle events: security master, trade capture, corporate actions, mark-to-market etc.\n\nRelevant data is to be identified and made available to other product team members for systems integration, full general ledger accounting and financial reporting.\n\nWhat you will be doing:\n\nAs a business analyst work with Product owner and product manager to finalize business requirements for new features\nWork with clients from time to time to understand requirements\nWork with scrum team members to breakdown the requirements to small testable user stories in planning and grooming sessions\nAttend various scrum ceremonies as part of scrum team\nWork with client facing teams to discuss defects reported by clients\nWork on business requirement documents\nTrain the team on upcoming features and new industry developments\nReview BA related compliance checks\nAct as POC between Product Manager and Dev/QA\n\n\n\n\n\n\n\nWhat you will need:\n\nGENERAL KNOWLEDGE, SKILLS & ABILITIES\n\nA minimum of 8+ years of proven experience working in a similar role of BA developing and releasing complex software solutions, ideally working in a small, highly focused team for a software in capital markets(hedge funds/mutual funds)\nKnowledge of InvestOne/Geneva or any other back office - hedge funds/mutual funds accounting software Understanding of Agile Scrum Development Methodologies Knowledge of equities, fixed income securities, swaps, MBS, Bank debt securities Bachelor's degree (MBA preferred)\nExcellent teamwork skills Proven ability to influence cross-functional teams without formal authority Examples and at least one sample of an effective document delivered in the past Experience in implementing and operationalizing a strategic vision and providing direction and guidance to the design and implementation teams that carry out the mission Proven ability to effectively lead cross-functional teams.\nAble to collaborate effectively with internal and external stakeholders and translate requirements into quality business specifications. Exceptional relationship skills, negotiating skills, and the ability to build rapport with internal and external partners Excellent oral and written communication skills, with demonstrated capability to deliver persuasive, high impact, high quality presentations.\nAbility to analyze and document complex business processes, think analytically and adept at problem solving, and to gather and interpret relevant data and information.\nDemonstrated ability to function as a team player who is willing to “roll up their sleeves” and make sure the job gets done High energy, highly analytical and results-oriented Strong project management and organizational skills required Advanced skills in MS Word, PowerPoint, Excel and Visio.\n\n\n\n\nWhat we offer you\n\nA multifaceted job with a high degree of responsibility and a broad spectrum of opportunities\nA broad range of professional education and personal development possibilities – FIS is your final career step!\nA competitive salary and benefits\nA variety of career development tools, resources and opportunities\nAdaptable home - office work model\nOpportunity to work with global teams and clients\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-lead-analyst-ba-at-fis-4146663035?position=4&pageNum=27&refId=qUEK%2BRRfTlwms%2BZrzTuWbg%3D%3D&trackingId=N0Tfh6iQaWA9I%2BWVuc9RvA%3D%3D"
}