{
    "job_id": "4146362815",
    "title": "Business Analyst",
    "company": "ADP",
    "location": "Pune, Maharashtra, India",
    "description": "POSITION DESCRIPTION\n\nJOB TITLE –Business Analyst\n\nLOCATION – Pune\n\n\n\n\n\n\n\nROLE – Business Analyst and BI Development\n\n\n\n\nJOB PROFILE:\n\n\n\n\nYou will work as an integral part of the business service analysis team under NAS Service Technology group. Successful candidate, a business analyst will work with ADP teams and clients to document their business requirements for dashboards and manage & roll out deliverables. Lead project meetings, and work closely with business partners, product owners, subject matter experts, project teams, training teams, and others to produce high-quality deliverables that conform to given project outcomes.\n\n\n\n\nTo thrive in this role, you must be comfortable working in a fast-paced environment with ever-changing requirements and priorities. You must be able to deep dive into the business requirement and create documentation and dashboard. You will play an advocative role and help business to maintain project roadmaps.\n\n\n\n\nSkill Set:\n\n\n\n\n3-5 years of working experience\nGood written and verbal communication skills, can represent our team with our customers, create documentation, deliver presentations,\nExperience in analyzing data to draw business-relevant conclusions and in data visualization techniques and tools\nExposure of writing business Cases, Business, functional requirements, technical requirements, Wireframes, process and workflows, cost benefits analysis, ROI calculations.\nKnowledge on Agile methodology, six sigma and BPMN methods.\nProcess Analysis, Data Analysis & Process Re-engineering\nProject Management & Stakeholder Management\nStrong analytical, reasoning and communication skills.\nBI Visualization experience (Tableau, PowerBI, Domo, etc)\nAnalyzes/evaluates existing business processes and identifies process efficiency and effectiveness improvement opportunities and supports process improvement activities.\nSQL experience is a plus\n\n\n\n\nEssential Responsibilities:\n\n\n\n\nPreparing the business cases.\nRequirements Elicitation, Planning, analysis, monitoring, organization, simplifying, translating, communication, validation.\nDefine configuration specifications and business analysis requirements\nOwn and develop relationship with partners, working with them to optimize and enhance our integration\nHelp design, document and maintain business dashboards.\nDeveloping the dashboard using BI visualization tool\nCommunicate key insights and findings to product/development team\nConstantly be on the lookout for ways to improve monitoring, discover issues and deliver better value to the customer\nManaging the solution scope.\nConverting the ideas and opportunities into deliverables.\nWorks with multiple stakeholders, often with competing/conflicting objectives, to ensure cohesive and reachable measures of success.\nReviews data post- implementation to measure success; participates in defining standards of improvement success.\nDemonstrates strong communication and presentation skills in meetings, facilitated sessions, and senior leadership presentations.\nPartners with management, project champions, and process owners to align process improvement initiatives with business objectives.\n\n\n\n\nAttributes:\n\n\n\n\nExcellent communication skills\nWillingness to work in the flexible shifts.\nShould be approachable to all the team members.\nShould carry a positive attitude / outlook towards the business.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-adp-4146362815?position=39&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=IVn%2BjA9WK1hwi6lJ0dfmww%3D%3D"
}