{
    "job_id": "4146077948",
    "title": "ServiceNow Business Analyst",
    "company": "Tacnique",
    "location": "India",
    "description": "Role\n\n\n\n\nWe are looking for a ServiceNow Business Analyst to bridge the gap between business needs and the ServiceNow platform. You will work closely with stakeholders to gather requirements, optimize ServiceNow workflows, and ensure successful implementations aligned with business objectives.\n\n\n\n\nResponsibilities\n\n\n\n\nRequirement Gathering & Documentation: Work with business stakeholders to understand, document, and translate business needs into functional and technical requirements for ServiceNow.\nServiceNow Configuration & Optimization: Assist in configuring and optimizing ServiceNow modules, such as ITSM, ITOM, HRSD, or CSM, based on business needs.\nProcess Improvement: Identify inefficiencies in existing ServiceNow workflows and suggest improvements to enhance automation and efficiency.\nStakeholder Collaboration: Act as a liaison between business users, developers, and ServiceNow administrators to ensure smooth project execution.\nTesting & Validation: Assist in User Acceptance Testing (UAT), validate system functionality, and ensure alignment with business objectives.\nReporting & Analytics: Generate reports and dashboards using ServiceNow Performance Analytics to support data-driven decision-making.\nTraining & Documentation: Provide end-user training, create process documentation, and ensure smooth adoption of new ServiceNow functionalities.\n\n\n\n\nQualifications\n\n\n\n\nEducation: Bachelor’s degree in Computer Science, IT, Business Administration, or a related field.\nExperience: 2+ years of experience as a Business Analyst with hands-on experience in ServiceNow.\nServiceNow Expertise: Familiarity with ITSM, ITOM, HRSD, CSM, or other ServiceNow modules.\nTechnical Skills: Understanding of ServiceNow workflows, forms, business rules, UI policies, and integrations.\nAnalytical Thinking: Strong problem-solving skills with a data-driven approach to business process optimization.\nCommunication: Excellent verbal and written communication skills to work effectively with cross-functional teams.\nAgility & Adaptability: Ability to thrive in a fast-paced, dynamic environment with evolving business needs.\nNice-to-Have Skills:\nExperience with ServiceNow Scripting (JavaScript, Glide API)\nITIL Foundation certification or knowledge of ITIL processes\nFamiliarity with Agile/Scrum methodologies and tools like Jira, Confluence\nServiceNow Certified System Administrator (CSA) or Business Analyst certification\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/servicenow-business-analyst-at-tacnique-4146077948?position=7&pageNum=77&refId=x7m7XCf9mecSRbX%2FzrmwDg%3D%3D&trackingId=c9PTNifBGbY9DZcnqMvyUw%3D%3D"
}