{
    "job_id": "4146308667",
    "title": "Business Analyst",
    "company": "iThink Logistics",
    "location": "Mumbai Metropolitan Region",
    "description": "WHO ARE WE?\n\niThink Logistics is one of India's best third-party logistic service providers. Awarded as Logistics Startup of the year by ET NOW leaders of tomorrow. We assist eCommerce Sellers in growing their businesses by effortlessly shipping products to customers' doorsteps in 26,000+ pin codes in India at the best possible price using courier service providers.\n\n\n\n\n\n\n\nABOUT JOB ROLE:\n\nWe are looking for a dedicated Business Analyst to join our organization. The ideal applicant will have a strong analytical mindset, excellent communication skills, experience in wireframing and the ability to transform business needs into actionable strategies.\n\n\n\n\n\n\n\nLocation: Malad East\n\n\n\n\n\n\n\nREQUIREMENT:\n\nCandidates having 1-2 years of experience.\nExperience in Wireframing is must.\nFamiliarity with Figma.\nStrong analytical and problem-solving skills.\nExcellent verbal and written communication skills.\nProficiency in creating technical documentation such as BRD, FRD, and workflow diagrams.\nAbility to collaborate effectively with cross-functional teams.\nExperience with process optimization and project monitoring.\nAbility to work under pressure and manage multiple projects simultaneously.\n\n\n\n\n\n\n\n\n\n\n\n\n\nRESPONSIBILITIES:\n\n\n\n\nUse of Design Tools: Proficiency in wireframing with various tools and a basic understanding of Figma to support design collaboration.\n\n\n\n\nTechnical Documentation: Create and maintain clear and concise technical reports, activity diagrams, Business Requirement Documents (BRD), Functional Requirement Documents (FRD), and manuals to guide the team and stakeholders.\n\n\n\n\nDevelop Workflow Charts: Design and develop workflow charts to visualize system changes and improvements, ensuring clarity in understanding and implementing changes.\n\n\n\n\nProject Monitoring & Process Optimization: Monitor the progress of projects, identify areas for improvement, and optimize workflows to ensure timely and efficient completion of tasks.\n\n\n\n\nSPOC Coordination: Act as the Single Point of Contact (SPOC) between the Tech, Marketing, and other stakeholders, facilitating communication and ensuring alignment across teams.\n\n\n\n\nCollaboration with Project Leaders: Work closely with project leaders to define project scope and vision, ensuring business goals are clearly understood and translated into actionable tasks.\n\n\n\n\n\n\n\n\n\n\nPREFERRED SKILLS:\n\nAbility to handle stress well.\nAbility to multitask and prioritize tasks effectively in a fast-paced environment.\nPrior logistics experience will be an added advantage.\n\n\n\n\n\n\n\n\n\n\nLIFE AT ITHINK LOGISTICS:\n\nWorking at ITL goes far beyond just having a job to make ends meet. As an ITL team member, you may do what you love, be yourself, and make a difference in people's lives. We embody #squadgoals; our team takes pleasure in having a \"curious attitude\" that encourages cooperation and progress without regard for seniority. You will make new friends and be inspired to bring yours too.\n\n\n\n\n\n\n\n\n\n\nWHAT IS IN IT FOR YOU:\n\nStructured career development - our team of industry experts is here to support and work with you to explore your learning potential and career goals.\nPaid leaves /Restricted Holidays / maternity / paternity leaves\nHealth insurance\nFlexible working hours\nTraining and Development programs for personal and professional growth\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-ithink-logistics-4146308667?position=38&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=pCTV0eX6ad1Jl%2Fta39e0Gg%3D%3D"
}