{
    "job_id": "4146615845",
    "title": "Lead Business Analyst",
    "company": "Groww",
    "location": "Greater Bengaluru Area",
    "description": "About Groww:\n\nWe are a passionate group of people focused on making financial services accessible to every Indian through a multi-product platform. Each day, we help millions of customers take charge of their financial journey. Customer obsession is in our DNA. Every product, every design, every algorithm down to the tiniest detail is executed keeping the customers’ needs and convenience in mind. Our people are our greatest strength. Everyone at Groww is driven by ownership, customer-centricity, integrity and the passion to constantly challenge the status quo.\n\n\n\n\nAre you as passionate about defying conventions and creating something extraordinary as we are? Let’s chat.\n\n\n\n\nOur Vision\n\nEvery individual deserves the knowledge, tools, and confidence to make informed financial decisions. At Groww, we are making sure every Indian feels empowered to do so through a cutting-edge multi-product platform offering a variety of financial services. Our long-term vision is to become the trusted financial partner for millions of Indians.\n\n\n\n\nOur Values\n\nOur culture enables us to be what we are — India’s fastest-growing financial services company. It fosters an environment where collaboration, transparency, and open communication take center-stage and hierarchies fade away. There is space for every individual to be themselves and feel motivated to bring their best to the table, as well as craft a promising career for themselves.\n\nThe values that form our foundation are:\n\nRadical customer centricity\nOwnership-driven culture\nKeeping everything simple\nLong-term thinking\nComplete transparency\n\n\n\n\nKey Role & Responsibilities\n\nInteracting with senior stakeholders including department heads/ CXO and expected to drive projects independently with senior management stakeholders & also collaborate with teams to drive impact and results\nPartner with business/product management teams, identify and track appropriate performance measures, key performance indicators, and associated drivers\nWork with engineering and research teams on designing, building, and deploying data analysis systems for large data sets and extracting meaningful insights for Business, Marketing, and Product\nCreate algorithms to extract information from large data sets\nEstablish scalable, efficient, automated processes for model development, model validation, model implementation, and large-scale data analysis\nDevelop metrics and prototypes that can be used to drive business decisions\nProvide support for Sr Management reviews and Investor meetings at regular intervals\nDesign scorecards for business units and automate reports for internal and external stakeholders.\n\n\n\n\nKey Skills & Experience: -\n\n5-8 Years of relevant Analytics experience.\nHighly Proficient with SQL Familiar with Data Visualization tools like Tableau, Power BI, Looker Studio, etc.\nStrong problem-solving ability.\nThe candidate needs to exhibit structured thinking, strong Analytical Skills, Process Orientation, pro-activeness, and the ability to take ownership of projects.\nStrong Leadership and Project Management skills\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/lead-business-analyst-at-groww-4146615845?position=4&pageNum=2&refId=dmyDsuYITNpOArSK52WyDg%3D%3D&trackingId=kyhbu8MAgvggVbCbD3xcIQ%3D%3D"
}