{
    "job_id": "4146357137",
    "title": "Senior Data Scientist",
    "company": "Zupee",
    "location": "Gurugram, Haryana, India",
    "description": "About Zupee\n\n\n\n\nZupee is India’s fastest growing Technology backed Behavioral Science company. We are innovating Skill-Based Gaming with a mission to become the most trusted and responsible entertainment company in the world. We have been constantly focusing on innovation of indigenous games to entertain the mass.\n\n\n\n\nOur strategy is to invest in our people & user experience to drive profitable growth and become the market leader in our space. We have been experiencing phenomenal growth since inception and running profitable at EBT level since Q3, 2020. We have closed Series B funding at $102 million, at a valuation $600 million.\n\n\n\n\nThe company also announced a partnership with Reliance Jio Platforms, post which Zupee games will distribute its content across all customers using Jio phones. The partnership now gives Zupee the biggest reach of all gaming companies in India, transforming it from a fast-growing startup to a firm contender for the biggest gaming studio in India.\n\n\n\n\nAbout The Job\n\n\n\n\nRole: Senior Data Scientist\n\nReports to: Data Science Manager\n\nLocation: Gurgaon\n\n\n\n\nResponsibilities:\n\n- Responsible for designing, developing, testing and deploying ML models that can leverage\n\nmultiple signal sources, to build a personalized user experience.\n\n- Work closely with the business stakeholders to identify the potential Data science applications.\n\n- Contribute by doing opportunity analysis, building project proposals, designing and\n\nimplementation of ML projects, in the areas of Ranking, Embeddings, Recommendation engines etc\n\n- Collaborate with software engineering teams to design experiments, model implementations and\n\nnew feature creation.\n\n- Clearly communicate technical details, strategies, and outcomes to a business audience\n\n\n\n\nRequirements:\n\n- 5+ years of hands-on experience in data science using techniques including but not limited to\n\nregression, classification, NLP etc.\n\n- Previous experience in model deployment, model monitoring, optimization and model\n\ninterpretability.\n\n- Expertise with Random forests, Gradient boosting, KNN, Regression and unsupervised learning\n\nalgorithms\n\n- Experience in using Neural Networks like ANN, RNN, Reinforcement Learning or Deep Learning\n\netc.\n\n- Solid understanding of Python and common machine learning frameworks such as XG Boost,\n\nscikit-learn, PyTorch / Tensorflow\n\n- Outstanding problem-solving skills, with demonstrated ability to think creatively and strategically.\n\n- Technology-driven mindset, up to date with digital and technology literature, trends\n\n- S/he must have knowledge of Experimentation and Basic Statistics\n\n- S/he must have experience in Predictive Analytics.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-data-scientist-at-zupee-4146357137?position=7&pageNum=5&refId=FRPXiP9y%2BhIxsqwsMRn%2BVQ%3D%3D&trackingId=s88D9L96FjCzSX26rEyJHg%3D%3D"
}