{
    "job_id": "4147112449",
    "title": "Data Scientist",
    "company": "HDFC Bank",
    "location": "Gurugram, Haryana, India",
    "description": "Job Name: Data Scientist\n\nLocation: Gurgaon, Sector 39\n\nEmail Id : pradnya.bhalekar@hdfcbank.com, pooja.patil7@hdfcbank.com\n\n\n\n\nJob Purpose:\n\nA data scientist turns raw data into valuable insights that an organization needs in order to grow and compete. He/she interprets and analyzes data from multiple sources to come up with imaginative solutions to problems. He/she builds AI models and applications which solvereal complex banking business problems.\n\n\n\n\nJob Responsibilities:\n\nMachine Learning Engineer with strong knowledge of Python and cloud based deployments\nBuild, train and deploy models for inferencing and build surrounding APIs to access them on cloud and on-prem.\nYou will be part of hands-on team developing ML based applications for the bank using various ML techniques\nYou will be required to build and deply ML applications in cloud using NLP, LLMs and other supervised learning techniques.\nYou will be required to efficiently understand the data domain of the bank to perform EDA and MI report. And eventually designing and developing ML application on the data for multiple programs.\nCertified in at least one cloud, preferably AWS or GCP.\n\nKey Skills:\n\nMachine Learning Engineer with strong knowledge of Python and cloud based deployments\nStrong knowledge of EDA, NLP, Topic Modeling, NER, Embedding models and Semantic Search based techniques\nHave working knowledge of LLMs via APIs like Open AI and deploying open source LLMs like LLAMA2 and FLAN T5 etc.\nStrong knowledge of Lang Chain framework and Fast API of python is a must have.\nKnowledge of runtimes like ONNX, Quantization, QLORA techniques\nWorking experience of Cloud preferably Azure. Understanding of MLOps frameworks is a big plus.\n\nExperience:\n\n8- 15 years proven experience as a Data Scientist or Machine Learning Engineer\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-hdfc-bank-4147112449?position=21&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=CIHgCN5nlD%2FIkZcDmLn3pw%3D%3D"
}