{
    "job_id": "4147934461",
    "title": "Staff Data Scientist",
    "company": "ModMed India",
    "location": "Hyderabad, Telangana, India",
    "description": "We are united in our mission to make a positive impact on healthcare. Join Us!\n\n\nSouth Florida Business Journal, Best Places to Work 2024\nInc. 5000 Fastest-Growing Private Companies in America 2024\n2024 Black Book Awards, ranked #1 EHR in 11 Specialties\n2024 Spring Digital Health Awards, “Web-based Digital Health” category for EMA Health Records (Gold)\n2024 Stevie American Business Award (Silver), New Product and Service: Health Technology Solution (Klara)\n\n\nWho We Are\n\nWe Are Modernizing Medicine (WAMM)! We’re a team of bright, passionate, and positive problem-solvers on a mission to place doctors and patients at the center of care through an intelligent, specialty-specific cloud platform. Our vision is a world where the software we build increases medical practice success and improves patient outcomes. Founded in 2010 by Daniel Cane and Dr. Michael Sherling, we have grown to over 3400 combined direct and contingent team members serving eleven specialties, and we are just getting started! ModMed is based in Boca Raton, FL, with office locations in Santiago, Chile, Berlin, Germany, Hyderabad, India, and a robust remote workforce with team members across the US.\n\nJob Overview\n\nModMed is seeking an experienced and highly skilled Data Scientist with a strong background in machine learning, predictive analytics, and healthcare data. This individual will play a critical role in developing and implementing advanced analytics solutions to optimize healthcare delivery and patient outcomes. As part of our innovative team, you will work with large, complex datasets to build predictive models, uncover trends, and improve healthcare operations through data-driven insights. If you have a passion for leveraging data to solve complex healthcare challenges and are well-versed in the latest data science methodologies, we would love to hear from you.\n\nKey Responsibilities\n\nData Modeling and Analytics: Develop and implement machine learning models, algorithms, and statistical tools to process large volumes of healthcare data for predictive insights and optimization.\n\nData Mining and Exploration: Analyze structured and unstructured data to discover trends, correlations, and patterns that can drive new product features or enhance existing offerings.\n\nPredictive Analytics: Build predictive models to anticipate patient needs, streamline operational workflows, and improve healthcare delivery.\n\nResearch and Development: Keep abreast of the latest developments in machine learning, data science, and healthcare analytics to drive innovation and improvement in ModMed’s AI offerings.\n\nSkillset & Qualification\n\nTechnical Expertise:\n\n\nProficient in Python, R, SQL, and data manipulation libraries (e.g., Pandas, NumPy, SciPy).\nStrong experience with machine learning libraries and frameworks (e.g., TensorFlow, Scikit-learn, PyTorch).\nFamiliarity with big data platforms like Hadoop, Spark, or AWS/GCP.\nExperience working with healthcare data formats (HL7, FHIR) and privacy standards (HIPAA) is a plus.\n\n\nMachine Learning & Statistics: Expertise in building and deploying machine learning models, including classification, regression, and clustering techniques.\n\nEducation: Bachelor’s or Master’s degree in Data Science, Generative AI, Computer Science, Mathematics, Statistics, or a related technical field.\n\nExperience: 10+ years of experience in data science, Generative AI, machine learning, or predictive modeling, preferably in healthcare or a similar data-rich domain.\n\nProblem Solving: Strong analytical skills with the ability to translate complex business problems into data-driven solutions.\n\nCommunication: Excellent verbal and written communication skills to explain technical concepts to non-technical stakeholders.\n\nPreferred: Experience with healthcare-related analytics, including patient outcomes, clinical workflows, and operational efficiencies.\n\nModMed Benefits Highlight\n\nAt ModMed, we believe it’s important to offer a competitive benefits package designed to meet the diverse needs of our growing workforce. Eligible Modernizers can enroll in a wide range of benefits, including:\n\n\nComprehensive medical, dental, and vision benefits, including a company Health Savings Account contribution,\n401(k): ModMed provides a matching contribution each payday of 50% of your contribution deferred on up to 6% of your compensation. After one year of employment with ModMed, 100% of any matching contribution you receive is yours to keep.\nGenerous Paid Time Off and Paid Parental Leave programs,\nCompany paid Life and Disability benefits, Flexible Spending Account, and Employee Assistance Programs,\nCompany-sponsored Business Resource & Special Interest Groups that provide engaged and supportive communities within ModMed,\nProfessional development opportunities, including tuition reimbursement programs and unlimited access to LinkedIn Learning,\nGlobal presence and in-person collaboration opportunities; dog-friendly HQ (US), Hybrid office-based roles and remote availability for some roles,\nWeekly catered breakfast and lunch, treadmill workstations, Zen, and wellness rooms within our BRIC headquarters.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/staff-data-scientist-at-modmed-india-4147934461?position=6&pageNum=12&refId=C8%2Bsob%2BWGMHdmBeyzLMkdA%3D%3D&trackingId=rW8ER6T%2FcMv8rPB3amj94Q%3D%3D"
}