{
    "job_id": "4147111632",
    "title": "Machine Learning Engineer - Fintech",
    "company": "Pi",
    "location": "Mumbai, Maharashtra, India",
    "description": "Pi is an AI-native Fintech startup building ML platforms for financial advisory and wealth management. We are a pre-seed funded AI Fintech startup, founded by Rakesh Bhunatar and Raj Kollimarla.\n\n\n\n\nPi is building its core team currently and this is an opportunity to be among the first 20 employees of the company and experience exponential growth potential on all fronts – work profile, learnings, and compensation.\n\n\n\n\nWe are seeking a talented and passionate Machine Learning Engineer to join our team and help build world-class ML platforms for India’s leading fintech app. If you have a deep understanding of machine learning systems, a proven track record of developing and deploying ML products, and thrive in a fast-paced, startup environment, we’d love to hear from you!\n\n\n\n\nResponsibilities:\n\nDesign, train, evaluate, and deploy state-of-the-art ML models to solve critical business problems.\nDeep understanding of the entire stack when it comes to designing, training, evaluating, and deploying ML models. Proven track record of playing a critical role in shipping a new ML product that required custom components.\nProficient in writing distributed ML infrastructure, debugging and fixing hard-to-find bugs in ML models, and owning production-grade projects from start to finish.\nHands-on experience with containerization technologies such as Docker, Kubernetes, Kubeflow etc, ability to configure infrastructure to enable on-demand scaling.\nStrong expertise in MLOps and DevOps in general particularly on AWS, ability to maintain code quality and system reliability while raising the bar for best practices across the organization.\nDeep familiarity with cutting-edge large language models and agentic frameworks and associated infrastructure such as vector databases etc, ability to deploy them in production to solve critical business problems.\nDemonstrated proficiency across various modalities, showcasing a dynamic skill set for innovative solutions.\nInterest in and exposure to working in a startup environment with significant level of autonomy and responsibility, good communications skills to thrive in this environment.\nCollaborate with cross-functional teams to integrate ML solutions seamlessly into production environments.\nShowcase versatility by working across various modalities to deliver innovative ML solutions.\n\n\n\n\nRequirements:\n\n2-6 Years of relevant work experience\nSelf-motivated with a strong sense of ownership, capable of driving tasks independently from start to finish\nReady to work in a hectic, fast-paced environment with high levels of responsibility and autonomy\nGood communication skills with the ability to work in a collaborative, startup environment\nPassion for innovation and a proactive approach to problem-solving\n\n\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/machine-learning-engineer-fintech-at-pi-4147111632?position=10&pageNum=17&refId=rr4SH1GbEVcdwcmKQOXfGg%3D%3D&trackingId=uhCsOhcNF2Ka8HA2tyqCYQ%3D%3D"
}