{
    "job_id": "4147647697",
    "title": "ServiceNow Business Analyst",
    "company": "DigiHelic Solutions Pvt. Ltd.",
    "location": "India",
    "description": "Job Summary:\n\nWe are seeking a ServiceNow Business Analyst with 4+ years of experience to bridge the gap between business needs and technical solutions. The ideal candidate will have strong expertise in ServiceNow modules, workflows, and configurations, along with the ability to analyze business requirements, optimize processes, and ensure seamless implementation of ServiceNow solutions.\n\n\n\n\nKey Responsibilities:\n\nBusiness Analysis & Requirements Gathering\n\nWork closely with business stakeholders to gather, analyze, and document requirements for ServiceNow solutions.\nTranslate business needs into functional specifications for ServiceNow configurations, enhancements, and integrations.\nConduct gap analysis to identify areas for process improvement within ServiceNow.\nCollaborate with developers, architects, and QA teams to ensure accurate implementation of requirements.\n\nServiceNow Implementation & Configuration Support\n\nAssist in the configuration of ServiceNow modules, including ITSM, ITOM, CSM, HRSD, and CMDB as required.\nDefine and optimize ServiceNow workflows, catalog items, and forms to align with business needs.\nProvide input on ServiceNow UI/UX enhancements to improve user experience.\nWork with ServiceNow development teams to validate that solutions meet business and technical requirements.\n\nStakeholder Collaboration & Communication\n\nAct as the primary liaison between business users and technical teams for ServiceNow-related initiatives.\nFacilitate workshops, requirement sessions, and demonstrations to ensure alignment between stakeholders.\nPrepare and deliver ServiceNow-related training materials, documentation, and knowledge articles.\nProvide post-implementation support and act as a point of contact for ongoing enhancements and improvements.\n\nProcess Improvement & Reporting\n\nIdentify opportunities for workflow automation and process optimization within ServiceNow.\nAssist in developing metrics, reports, and dashboards using ServiceNow Performance Analytics.\nConduct periodic reviews to assess ServiceNow system health and data integrity.\nSupport compliance and governance by ensuring adherence to best practices and security policies.\n\n\n\n\nRequired Qualifications:\n\nServiceNow Knowledge & Experience\n\n4+ years of experience as a Business Analyst working with ServiceNow platform.\nStrong understanding of ServiceNow ITSM processes (Incident, Problem, Change, Request, Knowledge Management).\nExperience working with CSM, ITOM, HRSD, CMDB, or other ServiceNow modules is a plus.\nFamiliarity with ServiceNow configurations, UI policies, business rules, workflows, and integrations.\nKnowledge of ServiceNow reporting, dashboards, and Performance Analytics.\nUnderstanding of Agile and ITIL frameworks.\n\nTechnical & Analytical Skills\n\nAbility to write functional specifications and collaborate with developers on ServiceNow solutions.\nExperience in testing ServiceNow applications, including user acceptance testing (UAT).\nFamiliarity with ServiceNow API integrations (REST, SOAP) is a plus.\nProficiency in JIRA, Confluence, or similar tools for project documentation and tracking.\n\nSoft Skills & Work Environment\n\nExcellent communication skills to work effectively with business and technical teams.\nStrong analytical and problem-solving abilities with attention to detail.\nAbility to prioritize tasks and work in a fast-paced, Agile environment.\nSelf-motivated with a continuous improvement mindset.\n\n\n\n\nPreferred Certifications:\n\nServiceNow Certified System Administrator (CSA) (Preferred)\nServiceNow Certified Implementation Specialist – ITSM, CSM, or HRSD (Plus)\nITIL v4 Foundation Certification (Preferred)\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/servicenow-business-analyst-at-digihelic-solutions-pvt-ltd-4147647697?position=8&pageNum=45&refId=UbUFWb7IHPllL5XcmhINQg%3D%3D&trackingId=gv2L1QX%2BdOBPuX4iSI7dGQ%3D%3D"
}