{
    "job_id": "4148281105",
    "title": "Data Scientist",
    "company": "Rebel Foods",
    "location": "Mumbai Metropolitan Region",
    "description": "Data Science @ REBEL FOODS\n\nAbout Rebel Foods: World's leading consumer companies are all technology / new age companies - Amazon (retail), Airbnb (Hospitality), Uber (mobility), Netflix / Spotify (Entertainment). The only sector where traditional companies are still the largest ones is restaurants - McDonald's (with a market cap of 130 BN USD). With Food Delivery growing exponentially worldwide, there is an opportunity to build the world's most valuable restaurant company on the internet, superfast. We have the formula to be that company. Today, we can safely say we are the world's largest delivery only / internet restaurant company, and by a wide margin with 4000+ individual internet restaurants, in 40+ cities and 7 countries (India, Indonesia, UAE, UK, Malaysia, Singapore, Bangladesh. It's still Day 1, but we know we are onto something very, very big. We have a once-in-a-lifetime opportunity to change the 500- year-old industry that hasn’t been disrupted at its core by technology.\n\n\n\n\nFor more details on how we are changing the restaurant industry from the core, please refer below. It's important reading if you want to know our company better and really explore working with us\n\nhttps://medium.com/@jaydeep_barman/why-is-rebel-foods-hiring-super-talented-engineers b88586223ebe\n\nhttps://medium.com/@jaydeep_barman/how-to-build-1000-restaurants-in-24-months-the-rebel-method cb5b0cea4dc8\n\nhttps://medium.com/faasos-story/winning-the-last-frontier-for-consumer-internet-5f2a659c43db https://medium.com/faasos-story/a-unique-take-on-food-tech-dcef8c51ba41\n\n\n\n\nData Engineering @ Rebel\n\nData Engineering @ Rebel comprises Data Platform, Data Science (ML/Statistics), Analytics (Business & System - MIS/Reports/BI Tools), AI/IOT (vision computing, quality check etc). We work on many interesting data engineering use cases at scale which require constant innovation and disruption. Few of those are -\n\nPersonalization - Recommendation Engine, Dynamic pricing etc\nCustomer engagement/retention, Campaign Management\nNLP to improve customer experiences\nPredictive modelling for inventory, resources, kitchen operations etc\nOperating metrics for kitchen machines, resources etc\nVision Computing to do food quality check, product identification, safety checks across the kitchens - Big data platform to ingest events, transaction data, behavioral data from millions of consumers\n\n\n\n\nFuture of Data Engineering @ Rebel\n\nThe Rebel Engineering function is working on Software + Robotics + Automation to solve the toughest problems for our customers and make their food missions unique, memorable and delightful & sure. We believe in continuous adoption of emerging technologies to solve customer problems in fast and innovative fashion. Data platform and Data science will remain the backbone in driving the decisions for the best customer experiences and the best operating models.\n\n\n\n\nThe Role\n\nWe are in the lookout for someone who can come on board to solve known/unknown business & customer use cases through data platform and data science.\n\nIn this role, you must have a passion for research and data to solve problems at scale for both customers and the businesses. You should also be passionate about solving real business problems by closing the loop from Data Science inputs, implementing interventions in business, tracking results and improving the inputs through feedback loop. You should be highly proficient with the following skillsets -\n\nData Science- Machine learning (regression, classification, random forest, k nearest etc), Deep learning (Neural Networks, Tensorflow/Keras etc), AI, Statistics, SQL/NoSQL DBs, NLP, Semantic & Sentiment analysis, Predictive Modeling\nData Analytics - Data visualization (Reporting/MIS/BI) Tools, SQLs, ETLs\n\nWe expect you to be excellent in writing efficient programs (Python/R/Java etc) and problem-solving skills. You will work closely with the Business, Product and Engineering teams and will be directly part of the business team..\n\n\n\n\nSpecific Qualifications\n\nMinimum of 6 months - 2 years Data Science experience in the industry with Bachelors, or Master's or Ph.D. in Data Science, Computer Science, Statistics, Mathematics.\n\nStrong working knowledge of a variety of machine learning techniques (Regression, Classification, Clustering, Neural Networks, Bayesian models etc.)\nProficient in Python, SQL, and machine learning libraries (e.g., TensorFlow,scikit-learn).\nExperience in working with varied data types (structured and unstructured) and databases\nExperience with Machine Learning and related technologies such as Python, Tensorflow, Amazon SageMaker\nSolid understanding of data wrangling, feature engineering, and working with structured and unstructured data.\nExperience with MLOps Frameworks like Kubeflow/MLFlow,/Airflow etc., experience with Docker and Kubernetes\nAbility to design and implement cloud solutions and ability to build MLOps pipelines on cloud solutions\nExcellent problem-solving skills with a demonstrated ability to think analytically and strategically\nExcellent communication and presentation skills, with the ability to explain complex data science concepts to non-technical stakeholders.\n\nGood-to-have\n\nExperience solving NLP-based problems or working with LLMs / prompt engineering\nWorking with non-tech stakeholders and explaining ML performance in simple language\nA love of food (Yes, we have regular tasting sessions at office!)\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-rebel-foods-4148281105?position=3&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=UFPcvZueJm0xzbxGvdgvSg%3D%3D"
}