{
    "job_id": "4148248897",
    "title": "Machine Learning Engineer",
    "company": "eAspire Technolabs Pvt. Ltd.",
    "location": "India",
    "description": "Immediate joiner only.\n\nWho can join next week\n\n\n\n\n\n\n\nML Ops Engineer (100% Remote | US Shift)\n\n\n\n\n\n\n\nKey Responsibilities:\n\nBuild and maintain scalable ML training and deployment pipelines for internal applications.\nFine-tune and optimize ML models for better performance and efficiency.\nAutomate model training, deployment, and monitoring workflows to ensure seamless operations.\nWork with data scientists and ML engineers to optimize data pipelines and inference performance.\nDevelop monitoring tools to track model performance, detect drift, and trigger retraining.\nEnsure AI solutions comply with security and regulatory standards (SOC 2, HIPAA, GDPR).\nManage ML infrastructure on AWS, Azure, or Google Cloud for cost and performance optimization.\nImplement retrieval-augmented generation (RAG) techniques and vector search databases for improved ML inference.\nHandle model versioning, performance evaluation, and explainability tracking using MLflow or Weights & Biases.\nWork with software engineers to integrate ML-powered APIs and microservices into business applications.\nSupport continuous model improvement, A/B testing, and automated performance tuning.\nDocument AI workflows, architectures, and key learnings to share best practices.\nStay updated on the latest ML and AI advancements to improve internal solutions.\n\n\n\n\nRequired Skills & Qualifications:\n\n3+ years of experience in AI/ML engineering, with at least 1 year in MLOps and model deployment.\nHands-on experience in training, fine-tuning, and deploying ML models, including NLP and LLMs.\nProficiency with AI/ML frameworks such as PyTorch, TensorFlow, and Hugging Face Transformers.\nExperience with cloud-based AI solutions like AWS SageMaker, Bedrock, Azure AI, or Google Cloud Vertex AI.\nBasic knowledge of CI/CD pipelines for AI models and GitOps workflows.\nStrong Python skills and experience with model-serving frameworks like FastAPI or TorchServe.\nFamiliarity with monitoring tools (Prometheus, Grafana, ELK) for AI systems.\nExperience with Kubernetes, Docker, and Terraform for scalable AI deployments.\nExcellent problem-solving and communication skills to collaborate across teams.\n\n\n\n\nPreferred (Nice to Have) Skills:\n\nExperience with reinforcement learning from human feedback (RLHF).\nUnderstanding of vector databases and embedding techniques.\nKnowledge of distributed training and high-performance computing for ML.\nExposure to domain-specific ML applications for business use.\n\nFamiliarity with cost-optimization strategies for AI workloads in the cloud\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/machine-learning-engineer-at-easpire-technolabs-pvt-ltd-4148248897?position=4&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=9VDhlsC0iiTXlPDcafpPnQ%3D%3D"
}