{
    "job_id": "4148868158",
    "title": "Data Scientist",
    "company": "Godrej Industries Group",
    "location": "Mumbai, Maharashtra, India",
    "description": "Sr. Executive / Assistant Manager Data Scientist\n\nGodrej Agrovet\n\nMumbai, Maharashtra, India\n\nJob Title: Sr. Executive / Assistant Manager Data Scientist\n\nJob Type: Permanent, Full-time\n\nFunction: Digital\n\nBusiness: Godrej Agrovet\n\nLocation: Mumbai, Maharashtra, India\n\nAbout Godrej Agrovet\n\nGodrej Agrovet Limited (GAVL) is a diversified, Research & Development focused agri-business Company dedicated to improving the productivity of Indian farmers by innovating products and services that sustainably increase crop and livestock yields. GAVL holds leading market positions in the different businesses it operates - Animal Feed, Crop Protection, Oil Palm, Dairy, Poultry and Processed Foods. GAVL has a pan India presence with sales of over a million tons annually of high-quality animal feed and cutting- edge nutrition products for cattle, poultry, aqua feed and specialty feed. Our teams have worked closely with Indian farmers to develop large Oil Palm Plantations which is helping in bridging the demand and supply gap of edible oil in India. In the crop protection segment, the company meets the niche requirement of farmers through innovative agrochemical offerings. GAVL through its subsidiary Astec Life Sciences Limited, is also a business-to-business (B2B) focused bulk manufacturer of fungicides & herbicides. In Dairy and Poultry and Processed Foods, the company operates through its subsidiaries Creamline Dairy Products Limited and Godrej Tyson Foods Limited. Apart from this, GAVL also has a joint venture with the ACI group of Bangladesh for animal feed business in Bangladesh.\n\nFor more information on the Company, please log on to www.godrejagrovet.com\n\nRoles & Responsibilities\n\nJob Responsibilities:\n\n\nData Cleaning, Preprocessing & exploration: Prepare data for analysis, ensuring quality, consistency, and completeness by handling missing values, outliers, and transforming data. Explore and analyze large and complex datasets to identify patterns, trends, and anomalies\nMachine Learning Model Development: Build, train, and deploy machine learning models on the Databricks platform, leveraging tools such as ML flow for experiment with techniques like regression, classification, clustering, and time series analysis\nModel Evaluation & Deployment: Develop and select features to improve model performance, leveraging Databricks' distributed computing capabilities for efficient processing. Familiarity with CI/CD tools (e.g., Jenkins, GitLab) for automating deployment and testing of data pipelines\nCollaboration: Collaborate with data engineers, analysts, and business stakeholders to understand business requirements and translate them into data-driven solutions.\nData Visualization and Reporting: Create visualizations and dashboards within Databricks, Power BI and other tools to communicate insights to technical and non-technical stakeholders.\nContinuous Learning: Stay up to date with the latest developments in data science, machine learning, and industry best practices to continually enhance skills and processes.\n\n\nKey Skills\n\n\nKnowledge of statistical analysis techniques, hypothesis testing, and machine learning\nFamiliarity with NLP, time series analysis, and computer vision or A/B testing\nDatabricks and Apache Spark: Proficiency with Databricks, Spark DataFrames and MLlib\nProgramming: Proficiency in (Python, TensorFlow, Pandas, scikit-learn, PySpark, NumPy) with experience in writing scalable code for large datasets\nSQL: Strong SQL skills for data extraction, manipulation, and analysis\nFamiliarity with ML flow for tracking, model versioning, and reproducibility.\nFamiliarity with cloud data storage and processing tools (e.g., Azure Data Lake, AWS S3).\n\n\nEducational Qualification\n\n\nEducation: Bachelor’s degree in Statistics, Mathematics, Computer Science, or a related field\n\n\nExperience: 3+ years of experience in data science or analytical role\n\nExperience\n\nAs a skilled Data Scientist, you will leverage your analytical skills to uncover insights from complex datasets, build predictive models, and inform data-driven decisions across the organization. You’ll work closely with cross-functional teams, including business, engineering, and product, to apply advanced statistical methods, machine learning, and domain knowledge to solve real-world problems.\n\nWhat’s in it for you?\n\nBe an equal parent\n\nMaternity support, including paid leave ahead of statutory guidelines, and flexible work options on return\n\nPaternity support, including paid leave\n\nNew mothers can bring a caregiver and children under a year old, on work travel\n\nAdoption support; gender neutral and based on the primary caregiver, with paid leave options\n\nNo place for discrimination at Godrej\n\nGender-neutral anti-harassment policy\n\nSame sex partner benefits at par with married spouses\n\nGender transition support\n\nWe Are Selfish About Your Wellness\n\nComprehensive health insurance plans, as well as accident coverage for you and your family, with top-up options\n\nUncapped sick leave\n\nMental wellness and self-care programmes, resources and counselling\n\nCelebrating wins, the Godrej Way\n\nStructured recognition platforms for individual, team and business-level achievements\n\nPerformance-based earning opportunities\n\nhttps://www.godrejcareers.com/benefits/\n\nAn inclusive Godrej\n\nBefore you go, there is something important we want to highlight. There is no place for discrimination at Godrej. Diversity is the philosophy of who we are as a company. And has been for over a century. It’s not just in our DNA and nice to do. Being more diverse - especially having our team members reflect the diversity of our businesses and communities - helps us innovate better and grow faster. We hope this resonates with you.\n\nWe take pride in being an equal opportunities employer. We recognise merit and encourage diversity. We do not tolerate any form of discrimination on the basis of nationality, race, colour, religion, caste, gender identity or expression, sexual orientation, disability, age, or marital status and ensure equal opportunities for all our team members.\n\nIf this sounds like a role for you, apply now!\n\nWe look forward to meeting you.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-godrej-industries-group-4148868158?position=18&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=sAw4WML62AJ9SX9ywH9gMA%3D%3D"
}