{
    "job_id": "4148254407",
    "title": "Business Analyst I, Order Performance",
    "company": "Amazon",
    "location": "Hyderabad, Telangana, India",
    "description": "Description\n\nDESCRIPTION\n\nAbout The Team\n\nThe Order Performance (OP) team manages the performance of our 2.3 million sellers and their billions of product offering with respect to the quality of fulfillment and customer service. This means setting and enforcing minimum performance standards, and ensuring all sellers have the education, coaching, and tools to succeed when selling in our stores. Our goal is to ensure that customers can shop with confidence across our entire catalog, knowing that regardless of the seller or fulfillment channel their order will be delivered in the condition expected, on-time, and in the rare instance where something goes wrong, it will be simple to get a return or exchange.\n\nWe do this by developing signals that allow us to understand the holistic performance and risk associated with every seller and every item offered for sale in Amazon's stores. We leverage those signals to make performance management decisions, boosting the discoverability of high-performing offers and filtering out the \"worst of the worst\" in order to protect the customer experience, while providing targeted insights and coaching to sellers so that they have the necessary information to improve performance, win sales, and scale their businesses.\n\nAbout The Role\n\nA Business Analyst in this role will support the development of new tools to evaluate and take action on what we know about seller performance. This role will work most closely with the program manager who owns our enforcement program, as well as our policy team. In addition, you will interface regularly with stakeholders from Amazon stores around the world, and you will work with our performance team to help identify new signals that will help us make holistic performance evaluations internally and deliver performance insights externally to buyers and sellers.\n\nThis is a global role that will drive critical buyer- and seller-facing work, with high visibility to senior leadership. You will have the opportunity to innovate and think big on behalf of millions of buyers and sellers on a global scale. The successful candidate will have a track record working across multiple partner and stakeholder teams to prioritize, manage expectations, and drive improvements in a timely and efficient manner.\n\nKey job responsibilities\n\n\nWork with our enforcement program manager to develop signals and insights that allow Amazon to compare seller performance across stores and fulfillment channels\nAnalysis that will inform performance expectations and trigger actions to enforce our policies\nExperimentation with new seller- and offer-level thresholds, analysis and recommendations for success metrics, launch, and scale of new enforcement model\nProvide analysis and insights for sellers to improve their performance\nBuild monitoring mechanisms and internal-customer facing dashboards\n\n\nAbout The Team\n\nThe Order Performance team was started in 2021 and continues to grow and increase its scope. We are highly visible to Leadership and work in a problem space that is complex, dynamic, global, and high-impact. The team itself is brilliant, hard-working, resilient, fun, diverse, and prioritizes personal health and wellness above all else.\n\nBasic Qualifications\n\n\n1+ years of tax, finance or a related analytical field experience\n2+ years of complex Excel VBA macros writing experience\nExperience defining requirements and using data and metrics to draw business insights\nExperience with SQL or ETL\n\n\nPreferred Qualifications\n\n\nExperience working with Tableau\nExperience using very large datasets\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI HYD 16 SEZ\n\nJob ID: A2896272\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-i-order-performance-at-amazon-4148254407?position=8&pageNum=22&refId=0jgrzIiQy2IEpj2UlbmQnQ%3D%3D&trackingId=4z8pzsxba97G8HMi7vpG1w%3D%3D"
}