{
    "job_id": "4148606147",
    "title": "FullStack Developer | AI/ML/Data Scientist - Entry-Level Multiple Roles",
    "company": "YMinds.AI",
    "location": "Bengaluru, Karnataka, India",
    "description": "We're Hiring! Entry-Level FullStack Developer | AI/ML/Data Scientist - Multiple Roles Available\n\n\n\n\nAre you excited about building innovative applications and exploring the world of Artificial Intelligence, Machine Learning, and Data Science? Do you have strong programming skills and a passion for creating impactful solutions? If you're ready to dive into an exciting career in AI/ML and FullStack Development, we want to connect with you!\n\n\n\n\nWho Should Apply:\n\n- Freshers with no prior experience but a strong enthusiasm for AI/ML and FullStack Development.\n\n- Candidates who have recently completed their degree in Computer Science, Engineering, or related fields.\n\n- Individuals who are eager to learn, adapt, and contribute to real-world projects.\n\n- Those who can join immediately and are looking for an entry-level opportunity to kickstart their career.\n\n\n\n\nKey Responsibilities:\n\n- Collaborate with cross-functional teams to build full-stack applications and contribute to AI/ML model development.\n\n- Assist in collecting, cleaning, and analyzing data to develop powerful datasets for AI/ML projects.\n\n- Develop and deploy machine learning algorithms, predictive models, and scalable applications.\n\n- Utilize data visualization techniques to present insights and results effectively.\n\n- Stay current with the latest AI/ML and FullStack development trends and technologies.\n\n- Participate in code reviews, knowledge sharing, and continuous improvement within the team.\n\n\n\n\nQualifications:\n\n- Strong programming skills in Python (including libraries like NumPy, Pandas, Scikit-learn, and frameworks such as TensorFlow or PyTorch).\n\n- Solid experience in FullStack development (both front-end and back-end technologies, databases, etc.).\n\n- Familiarity with web frameworks like Django or Flask for back-end development, and front-end technologies like React, Vue, or Angular.\n\n- Knowledge of SQL and experience working with databases.\n\n- Experience with data visualization tools such as Tableau, Power BI, or Matplotlib.\n\n- Exposure to cloud platforms like AWS, Azure, or Google Cloud.\n\n- Passionate about AI, ML, and building impactful software solutions.\n\n- Strong problem-solving skills and ability to think critically and creatively.\n\n- Excellent collaboration and communication skills.\n\n\n\n\nPreferred Qualifications:\n\n- Experience in Natural Language Processing (NLP), Computer Vision, or other AI/ML specializations.\n\n- Familiarity with Git for version control and CI/CD processes.\n\n- Experience with containerization tools like Docker or Kubernetes.\n\n\n\n\nWhat We Offer:\n\n- An opportunity to work on innovative, real-world projects that drive meaningful impact.\n\n- Mentorship and guidance from experienced professionals in the AI/ML and software development fields.\n\n- A collaborative, inclusive work environment where ideas are valued.\n\n- Competitive salary, benefits, and opportunities for growth and advancement.\n\n- Access to ongoing professional development and learning resources.\n\n\n\n\nIf you’re a self-motivated developer with a strong programming background and a passion for AI/ML, this is your chance to get in on the ground floor of cutting-edge technology!\n\n\n\n\nApply now and help us shape the future of technology!\n\n\n\n\n#AI #MachineLearning #DataScience #FullStackDeveloper #TechJobs #EntryLevel #Python #WebDevelopment #Cloud #NLP #ComputerVision #SoftwareDevelopment #JobOpening #Hiring\n\n\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/fullstack-developer-ai-ml-data-scientist-entry-level-multiple-roles-at-yminds-ai-4148606147?position=6&pageNum=22&refId=Q8Kf9AiV%2Bqa0LUasfvZQ2A%3D%3D&trackingId=BaXGQ7pSV8vEr%2BYRqNO7zQ%3D%3D"
}