{
    "job_id": "4148275960",
    "title": "Business Analyst",
    "company": "Enfusion",
    "location": "Bengaluru, Karnataka, India",
    "description": "Enfusion is a pioneer in developing innovative, native cloud investment management software, analytics, and managed services for asset managers and hedge funds around the globe. We underpin the investment operations of fund managers from our global offices spanning four continents. Our unique, seamless, SaaS-based platform is reshaping the global investment operations landscape by removing traditional information boundaries and uniting the front-, middle- and back-office into one system, with one unified data set.\n\nPassionate about client service, we complement our software solutions with expert middle- and back-office managed services. In fact, we've been recognized as Best Managed Services Provider at the HFM EU Services Awards. We help fund managers around the world streamline their operations, mitigate risk, and improve transparency and reporting so they can confidently focus on what they do best – invest.\n\nAs a company, we’re absolutely committed to the growth, development, and well-being of our people. Enfusion is where you can pursue your passion, showcase and further develop your skills, and launch a meaningful and rewarding career. If you're looking for a culture that is inclusive, collaborative, entrepreneurial, values diversity, fosters and rewards creative exploration, and strives to continually exceed client expectations then we're looking forward to hearing from you.\n\nLearn more about Enfusion by visiting www.enfusion.com and apply today!\n\nProduct Business Analyst (BA) – Trade Position Reconciliation (TPR)\n\nThe Team\n\nEnfusion’s TPR Team is one of multiple product groups within Enfusion’s Product Development and Technology Teams. The TPR Team focuses on building straight-through processing (STP) solutions to and from various third-party vendors used by the fund management industry. Common partners include data providers, trade reconciliation/affirmation platforms, fund admins, PBs, and custodians.\n\nThe Role\n\nReporting to the TPR lead for elective product management, Enfusion is seeking a Product Business Analyst to help develop the team’s expertise and use of best practices. This role will expose you to a wide range of stakeholders in the financial services industry, including hedge funds, institutional asset managers and analytics service providers. Success in this role will directly influence Enfusion’s ambitious growth and retention goals.\n\nWhat You’ll Do\n\n\nPartner with internal client-facing teams (e.g., Sales, Account & Client Success), third parties (e.g., hedge funds, institutional asset managers, service providers)), and internal technology developers to enable straight-through processing of our portfolio management solution, supporting incoming and outgoing data within the system and how that is processed within the Enfusion system.\nUse your in-depth understanding of the multi-asset class investment management process and the supporting technologies to specify clear requirements, design solutions, and create holistic test plans\nEnsure requests from clients and internal stakeholders (Sales, Account Managers, Client Success teams) are handled promptly and appropriately, answered with key insight that stakeholders can practically use\nStrengthen our client and broker relationships through strong delivery, clear business communication, and setting appropriate expectations\nCommunicate regularly with the development team to provide guidance on the enhancements required and its prioritization\nWork with developers, testers, and external third parties to comprehensively test new interfaces and ensure sign-off from all stakeholders\nBecome a trusted point of contact within the firm for TPR related requests\nDocument new developments, as well ascross-train the team and other relevant internal stakeholders about exciting product releases.\nOversee strategic roadmap initiatives with minimal supervision and independently deliver results through collaboration across all relevant stakeholders\nParticipate in complex elective projects which require a strong technical acumen,expertise, and critical thinking - specifically in data management, connectivity and process architecture.\nBuild new and/or improve existing broker relationships through mutual value propositions that benefit both counterparties., and may help drive company-wide initiatives.\nIdentify and help deliver improvements to day-to-day BAU processes with data driven decisions.\nActs as a product champion who conducts demonstrations and training for support groups.\n\n\nWhat You’ll Need\n\n\nBachelor’s Degree in Finance, Economics, Accounting, Engineering, Computer Science, or a related field\nMinimum 5 years of relevant experience as a Business Analyst in the capital markets domain.\nActual experience working directly in a product capacity to design and implement products for Interfaces / Connectivity teams, Reference Data Teams, Trade File Testing Teams, Trade Affirmation, or Reconciliation teams in an Agile product development methodology\nAbility to critically assess risk and determine impact on existing workflows, evaluating alternatives to deliver tactical and/or strategic interventions.\nDesire to create and improve processes, as well as define best practices.\nExtensive understanding of portfolio management, fund accounting, and cash management across a range of financial instruments including knowledge of the Pre and Post Trade Life cycle (Equities, Options, Futures, FX, Fixed Income, CDS, Total Return Swaps, etc.)\nKnowledge of the competitive landscape of SaaS systems (OEMS/PMS/Accounting) that provide services to Hedge Funds and Institutional Asset Managers (the 'Buy Side') is a desired prerequisite\nSkilled at working effectively AND independently with cross-functional teams in a matrix organization\nStrong written and oral communication skills and proven ability to effectively communicate with senior and C level management teams.\nHighly organized, self-driven, extremely quick learner, and able to work in a fast-paced environment where they showcase critical thinking and confidence in the application of their knowledge\nExperience in reading code (such as Java) is a strong plus.\nKnowledge of standard protocols like FTP, FIX, API, SOAP and Swift, and any experience with XML or FpML is a strong plus.\nRelatable experience and knowledge of investment management and analytics solutions such as Charles River (CRD) IMS, MSCI Riskmetrics, Bloomberg PORT / MARS, Factset, is preferable.\n\n\nLocation:- Bangalore\n\nEnfusion offers a competitive compensation and benefits package, which includes health insurance, retirement plans, and generous time off. Other perks include commuter benefits and an employee assistance program. All benefits and programs are subject to applicable eligibility requirements.\n\nEnfusion is fully committed to providing equal employment opportunity to job applicants and employees in recruitment, hiring, employment, compensation, benefits, promotions, transfers, training, and all other terms and conditions of employment. Enfusion will not discriminate on the basis of age, race, color, gender, marital status, sexual orientation, gender identity, pregnancy, national origin, religion, veteran status, physical or mental disability, genetic information, creed, citizenship or any other status protected by laws or regulations in the locations where we do business. We endeavor to maintain a drug-free workplace.\n\nPosition will remain open until filled.\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-enfusion-4148275960?position=8&pageNum=70&refId=HPHgp9Y9QvXuYD8UMhcuvA%3D%3D&trackingId=cq%2B7iMgvJQ7kNGwIsoc6hg%3D%3D"
}