{
    "job_id": "4148461835",
    "title": "Business Analyst Trainee",
    "company": "ValueMomentum",
    "location": "Hyderabad, Telangana, India",
    "description": "Primary Skill: Business Analysis\n\nLocation: Hyderabad\n\nIndustry: Insurance\n\nEmployment Type: Full-Time\n\nExperience: 0-1 years\n\n\n\n\n\n\n\nJob Description:\n\nDo you enjoy developing technology solutions to business problems? Does complex customer business\n\nsituations excite you. If your answer is yes, then we have a job that gives you the right platform to put\n\nyour creative sense at work.\n\nWe are looking for a Business Analyst who is very strong in spoken and written English skills. As a\n\nbusiness analyst, you will work within an organization, helping to manage, change and plan for the future\n\nin line with their goals. You'll need to understand the current organizational situation, identify future needs\n\nand create solutions to help meet those needs. You would function as an interface (through effective\n\ncommunication) among stakeholders, customer, and partners.\n\n\n\n\n\n\n\nWhy ValueMomentum?\n\n\n\n\nHeadquartered in New Jersey, US, ValueMomentum is one of the fastest growing software & solutions\n\nfirm focused on the Insurance, Healthcare and Financial Services domain. Our industry focus, expertise in\n\ntechnology backed by R&D and our customer-first approach uniquely position us to deliver the value we\n\npromise and drive momentum to our customers’ initiatives. ValueMomentum is amongst the top 10\n\ninsurance-focused IT services firms in North America in terms of the number of customers. Leading\n\ninsurers, banks and healthcare firms trust ValueMomentum with their core transformation and digital\n\ntransformation initiatives. We are looking for talented, passionate and creative people to join our rapidly\n\nexpanding team and discover unlimited opportunities for growth!\n\n\n\n\nYour Key Responsibilities:\n\nAssisting with the business case\nEliciting requirements, requirements organization, translating and simplifying requirements, requirements management and communication, requirements analysis document requirements, define scope and objectives, create flowcharts and present to client for a sign-off.\nParticipate in project planning, execution, and tracking.\nConstantly be on the lookout for ways to improve monitoring, discover issues and deliver better value to the customer.\nUnderstand and communicate the financial and operational impact of any changes\nMonitor project progress by tracking activity; resolving problems; publishing progress\nreports; recommending actions.\n Strong analytical and quantitative skills with an ability to work with business owners to\ndefine key business questions and to build data sets that answer those questions\n Excellent communication skills (written & verbal), very good negotiation and convincing skills. Ability to explain approach, process and insights to technical and non-technical teammates\nThe ability to influence stakeholders and work closely with them to determine acceptable\nsolutions\nExcellent documentation skills\nExperience creating detailed reports and giving presentations\nWritten and verbal communication, including technical writing skills\nUnderstanding of systems engineering concepts\nBusiness case development Modeling techniques and methods\nLeadership\nExcellent planning, organizational, and time management skills\nCareer Advancement: Individual Career Development, coaching and mentoring\nprograms for professional and leadership skill development.\nComprehensive training and certification programs.\nPerformance Management: Goal Setting, continuous feedback and year-end appraisal. Reward & recognition for the extraordinary performers.\n\n\n\n\n\n\n\nDesired Qualifications:\n\nA bachelor’s degree in business or related field or an MBA\n\n\n\n\nCompany Benefits:\n\nCompensation - Competitive compensation package comparable to the best in the industry.\nCareer Growth - Career development, comprehensive training & certification programs, and fast track growth for high potential associates.\nBenefits: Comprehensive health benefits and life insurance.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-trainee-at-valuemomentum-4148461835?position=9&pageNum=12&refId=0qwF5I591Ogz%2FBtLFZTetg%3D%3D&trackingId=Td7NUvRwbX3KX1DsOjfBHQ%3D%3D"
}