{
    "job_id": "4148835665",
    "title": "Marketing Manager - Data Scientist",
    "company": "Infosys",
    "location": "Bengaluru, Karnataka, India",
    "description": "Title: Data Scientist\n\nLevel: JL 6\n\n\n\n\nThe digital marketing team at Infosys is dedicated to deliver AI-first experiences by leveraging its AI-infused Martech stack by providing actionable, customer-centric insights, and empowering GTM and other stakeholders make data-driven decisions in a smarter, faster, and collaborative manner.\n\n\n\n\nWe are seeking an experienced data scientist (+7 YOE) with expertise in NLP, deep learning to lead building ML-powered applications. In this role, you will lead the development and evaluation of ML models to solve business problems and the integration into digital marketing. Cross-functional collaboration with key internal and external stakeholders will be essential in this position.\n\n\n\n\nThe ideal candidate will leverage data modelling techniques to build advanced targeting and personalization strategies, driving enhanced customer engagement and business outcomes. This role demands a data-first approach, utilizing AI to create highly relevant and personalized experiences for our users.\n\n\n\n\nThe Data Scientist role will aid in predictive analytics, and models to bring business values to drive strategies across the marketing lifecycle, building deep dive insights & analytics. These insights will be integrated into customer engagement strategies across segments. The role involves understanding digital data, experience maps and customer behavior and building algorithms.\n\n\n\n\nThe role also involves communicating insights through model outcomes, data visualization and storytelling, supporting data-driven decision-making across the organization.\n\n\n\n\nKey Responsibilities:\n\n\n\n\nData-First Approach: Champion a data-first approach by creating systematic definitions, relationships, and improvements in process design to refine data models. Ensure responsible and transparent use of data, balancing personalization with privacy concerns.\nAI-Driven Digital Targeting: Develop and implement AI models to optimize ad targeting across various digital channels. Analyze user data to identify relevant audience segments for advertising campaigns, ensuring precise and efficient targeting.\nAI-Driven Personalization: Transform personalization from a concept to reality by analyzing vast amounts of user data to predict individual preferences and behaviors. Dynamically adjust website content and product recommendations to match each user’s specific interests, increasing engagement and satisfaction\nData Modeling for Personalization: Design and implement data models that leverage AI to personalize digital advertising. Create sophisticated personalization models that consider user intent, context, and emotions to tailor ad content to individual needs and interests.\nSegmentation Strategies: Utilize clustering models to segment customers based on purchase history, browsing behavior, and demographic information. Tailor content and marketing strategies to specific customer groups, enhancing engagement and conversion rates.\nPredictive Analytics: Employ machine learning to predict user behaviors and needs, enabling the delivery of personalized content at the optimal time. Use predictive analytics to anticipate consumer needs accurately, serving highly-personalized ads when users are most likely to engage.\nContextual Targeting: Implement AI-driven algorithms to analyze webpage content in real-time, pairing ads with the most relevant context. Ensure ads remain effective while respecting user privacy and avoiding cross-site trackingOversee the MQL to SQL flow, optimizing lead conversion processes.\nCollaborate with cross-functional teams to understand business requirements and translate them into data solutions.\nPresent findings and insights to stakeholders, effectively communicating the value and impact of data-driven strategies.\n\n\n\n\nQualifications & Experience:\n\n\n\n\nAdvanced degree (MTech or MS) in Computer Science, Electrical Engineering, Statistics, Operations Research, or Mathematics is preferred\nOver 7 years of experience in data science, with a focus on data modeling, AI-first websites, and machine learning models for conversational chatbots.\nProven expertise in predictive analytics and data flow management from CRM systems.\nExperience with machine learning and deep learning techniques, including natural language processing (NLP) and computer vision.\n\n\n\n\nFamiliarity with AI models and their practical applications in digital marketing.\n\nUnderstanding of ethical considerations in data science, including privacy, bias, and fairness.\nExperience with building AI-first websites and developing machine learning models for conversational chatbots.\nKnowledge of data visualization tools and techniques.\n\n\n\n\nSkills:\n\n\n\n\nAI & Machine Learning: Strong understanding of AI capabilities such as data collection, natural language processing, machine learning, and analytics\nData Modeling: Expertise in data modeling techniques to create systematic definitions and relationships for improved data models\nPersonalization Technologies: Proficiency in dynamic creative optimization (DCO) and other AI-driven technologies for creating hyper-relevant experiences Privacy-First Data Practices: Knowledge of privacy regulations and the ability to implement targeting strategies that prioritize user privacy Communication & Collaboration: Strong communication and teamwork skills for effective collaboration with cross-functional teams.Strong problem-solving abilities and creative thinking.\nCollaborative mindset with the ability to work effectively with cross-functional teams.\nProficiency in data structures, algorithms, and efficient processing of large datasets.\nExcellent communication and presentation skills, with the ability to engage and influence stakeholders.\nStrong analytical skills and proficiency in statistical software and programming languages such as Python, R, or SQL.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/marketing-manager-data-scientist-at-infosys-4148835665?position=5&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=dvLagvzXT8Rzm%2FAi7y8DLQ%3D%3D"
}