{
    "job_id": "4148865953",
    "title": "Data Scientist",
    "company": "Razorpay",
    "location": "Bengaluru, Karnataka, India",
    "description": "The Role:\n\n\n\n\nWe are looking for an enthusiastic Data Scientist to join our growing team. The hire will\n\nbe responsible for working in collaboration with other data scientists and engineers\n\nacross the organization to develop production-quality models for a variety of problems\n\nacross Razorpay. Some possible problems include : making recommendations to\n\nmerchants from Razorpay’s suite of products, cost optimization of transactions for\n\nmerchants, automatic address disambiguation / correction to enable tracking customer\n\npurchases using advanced natural language processing techniques.\n\nAs part of the DS team @ Razorpay, you’ll work with some of the smartest\n\nengineers/architects/data scientists in the industry and have the opportunity to solve\n\ncomplex and critical problems for Razorpay.\n\nYou come and work with the right attitude, fun and growth guaranteed!\n\n\n\n\nRoles & Responsibilities:\n\n\n\n\nSolve business problems by applying data science and machine learning.\nCollaborate with cross-functional teams to build and deploy data science solutions.\nAnalyze large volumes of data to generate actionable insights.\nPresent findings and recommendations to stakeholders.\nIdentify key metrics, conduct exploratory data analysis, and create executive dashboards.\nSupport multiple projects in a fast-paced environment.\nTrain and maintain machine learning models.\nContinuously improve solutions and evaluate their effectiveness.\nDeploy data-driven solutions and communicate results effectively.\n\n\n\n\n\n\n\nMandatory Qualifications\n\n\n\n\n1-2 years of experience doing ML and building ML models\nBachelors (required) or Masters in a quantitative field such as Computer science, operations research, statistics, mathematics, physics\nSound knowledge of basic machine learning techniques : regression, classification, clustering, model metrics and performance (AUC, ROC, precision, recall and their various flavours)\nExperienced in coding in python and good knowledge of at least one language from C, C++, Java\nFamiliarity with one or more scripting languages : perl, command-line Unix\nInterest in learning and using deep learning frameworks such as Tensorflow, Keras, pytorch and big data tools like Spark and databricks / AWS / GCP / Microsoft Azure to write production quality ML code\nAn interest in ML experimentation end-to-end : how to experiment with models, how to report success, A/B testing.\nGood communication skills and ability to keep stakeholders informed of progress / blockers\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-razorpay-4148865953?position=2&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=srjb7fO0jAWkNGpa7nFkwg%3D%3D"
}