{
    "job_id": "4149391887",
    "title": "Senior Business Analyst",
    "company": "Chubb",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Description:\n\nThe Purpose of the role\n\nThe Business Analyst's role involves analyzing the Chubb processes and systems, assessing the business needs and solving problems using AI solutions. They evaluate the current state while identifying customer requirements to define the desired future state or business solution. By researching, gathering, and synthesizing information, they ensure that business needs are accurately translated into actionable strategies. Collaborating with the AI team, the Business Analyst helps align technological capabilities with organizational goals, driving process improvements and enhancing overall efficiency to support sustainable growth and innovation.\n\n\n\n\nLocation: Bangalore, India\n\n\n\n\nResponsibilities\n\nCollaborate with business stakeholders to gather and clarify detailed requirements, ensuring alignment with organizational goals.\nWork closely with the data team to analyze data sets, identifying trends, patterns, and insights that inform strategic business decisions.\nDevelop and document business process models that illustrate current workflows and propose future state optimizations in partnership with both business and AI teams.\nDesign and recommend technical and process solutions that leverage AI technologies to address business needs effectively.\nCoordinate with IT, data, and AI teams during the implementation of solutions, ensuring seamless integration and alignment with business objectives.\nCommunicate findings, project updates, and recommendations effectively across business, data, and AI teams to foster collaboration and transparency.\nCreate and maintain comprehensive documentation of business requirements, processes, and implemented solutions, ensuring accessibility to all teams.\nParticipate in testing and validation of new systems and processes alongside business, data, and AI teams to ensure they meet established requirements.\nIdentify and evaluate opportunities for process improvements, collaborating with all teams to contribute to ongoing optimization and innovation initiatives.\n\n\n\n\nRequired knowledge, Skills and qualifications:\n\nExcellent analytical and problem-solving skills. Critical thinking and a proactive approach to addressing business challenges will drive effective outcomes.\nUnderstanding of AI technologies and their applications in business is important.\nMaster in Microsoft office tech-stake and able to adopt to new tools.\nFamiliarity with basic analytics tools like SQL, Python is a plus.\nStrong verbal and written communication skills are vital for articulating findings, presenting recommendations, and facilitating collaboration among diverse teams, including business, data, and IT.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-chubb-4149391887?position=2&pageNum=2&refId=dmyDsuYITNpOArSK52WyDg%3D%3D&trackingId=w5JX9bBSw1Rl4JrA2sC%2BIw%3D%3D"
}