{
    "job_id": "4149906919",
    "title": "Business Analyst Support, Fresh",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nThe Fresh last mile team at Amazon, India is hiring for Business Analyst position. We are looking for a candidate with strong performance record and experience.\n\nThe candidate is expected to\n\n\nbe very analytical and be able to justify decisions and approaches with data.\nbe able to deal with a high degree of ambiguity\nbe able to take a complex problem and break it down to smaller digestible chunks\nbe able to define a logical and step by step approach to achieving a lofty goal\nbe comfortable with processes and process design/analysis\nhave the ability to influence without authority and do so by using data and facts\nbe able to deal with varied stakeholders and earn their trust.\nhave a good understanding of Macro and SQL with hands on experience\n\n\nThe candidate is expected to have exceptional analytical, planning and written/verbal communication skills along with preferred experience as business analyst. You know and love working with business intelligence tools, is comfortable accessing and working with big data from multiple sources, and enthusiastic about partnering with the business to deliver results. You would be a self-starter, comfortable with ambiguity, able to think big and enjoy working in a fast paced environment.\n\nCandidate should be able to demonstrate a high bar on Bias for Action, Deep Dive, Learn and Be Curious, Insist on highest standards and Ownership\n\nRoles And Responsibilities\n\n\nSet up robust processes to drive improvement projects with an objective to maximize the consumer experience\nIdentify, plan and execute automation projects within the team.\nCreate and work on big data using SQL, Amazon S3, Quick sight to provide actionable insights\nSupport the business growth in constrained environments with frugal and innovative solutions\nMake the existing processes scalable by identifying and implementing available tools/automation\nRollout best practices from other geographies and standardization of tools and processes to minimize end to end supply chain losses\nUtilize exceptional problem-solving and communication skills to influence business, operations and technical audiences\n\n\nWe are open to hiring candidates to work out of one of the following locations:\n\nBengaluru, KA, IND\n\nBasic Qualifications\n\n\n1+ years of data analytics or automation experience\nBachelor's degree\nKnowledge of data pipelining and extraction using SQL\nKnowledge of SQL and Excel at a moderate or advanced level\n\n\nPreferred Qualifications\n\n\nKnowledge of SQL/Python/R, scripting, MS Excel, table joins, and aggregate analytical functions\nExperience in data analytics or automation\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ASSPL - Karnataka\n\nJob ID: A2897874\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-support-fresh-at-amazon-4149906919?position=5&pageNum=2&refId=dmyDsuYITNpOArSK52WyDg%3D%3D&trackingId=FWCE218ZliEaW2LldL1QaA%3D%3D"
}