{
    "job_id": "4149179832",
    "title": "Analyst BA",
    "company": "Lowe's India",
    "location": "Bengaluru, Karnataka, India",
    "description": "About Lowe's\n\nLowe’s Companies, Inc. (NYSE: LOW) is a FORTUNE® 50 home improvement company serving approximately 16 million customer transactions a week in the United States. With total fiscal year 2023 sales of more than $86 billion, Lowe’s operates over 1,700 home improvement stores and employs approximately 300,000 associates. Based in Bengaluru, Lowe’s India develops innovative technology products and solutions and delivers business capabilities to provide the best omnichannel experience for Lowe’s customers. Lowe’s India employs over 4,200 associates across technology, analytics, merchandising, supply chain, marketing, finance and accounting, product management and shared services.\n\n\n\n\nCore Responsibilities:\n\nThe BA team comprises business intelligence and digital consulting professionals with expertise in the domain of e-commerce/online retail focused on customer analytics and insights. The team uses the power of data analytics and industry research to ensure supreme customer experience on Lowes.com, which is one of the most crucial levers in driving online revenue growth. As an analyst your day to day activity would involve:\n\n\n\n\nResponsible for hands-on working at various nodes of data-driven consulting process: right from pulling and aggregating data from various sources, category short term and long term strategy with stakeholders.\nRun reporting for projects, site scrub for search, browse and left navigation experience\nCollect, verify, analyze and summarize data using a variety of digital analytics tools and platforms to derive compelling insights and highlight performance trends that can be used to improve user experience.\nUnderstand online and e-commerce business, analyze customer data such as their onsite behavior, their product preferences, qualitative feedback, etc.; Build on the fly dashboards & apply advanced analytics methods to draw insights, and then translate them into business recommendations\n\n\n\n\nII. Required Skill Set\n\n\n\n\nTechnical skills · Excel · SQL · Python/R · Any Visualization tool · Adobe Analytics/Google Analytics\n\n\n\n\nFunctional Skills · Data Analysis and Insight Generation · Research on potential opportunity · Retail knowledge · Ecommerce/Digital Analytics\n\n\n\n\nIII. Years of Experience\n\n2 - 4 years relevant experience\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/analyst-ba-at-lowe-s-india-4149179832?position=6&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=Tysgwpy%2FIA1Rv5x%2BNuACtQ%3D%3D"
}