{
    "job_id": "4149683386",
    "title": "Senior Business Analyst",
    "company": "Thomson Reuters",
    "location": "Bengaluru, Karnataka, India",
    "description": "The role requires knowledge of multiple business models and the ability to build strong relationships with senior management and project boards.\n\nAbout the Role:\n\n\nBe forward thinking about modern process design and customer and user experience\nProactively identify and drive opportunities for process changes to increase efficiency, automation, and customer satisfaction\nUnderstand industry best practices, and apply them to the C2C initiatives to achieve expected business outcomes\nUnderstands business drivers and current state; develops future state design\nDefines the roadmap, creating actionable user stories/business requirements for development teams\nTakes strategic direction from the CPO and delivers functionality with the team\nRepresents the business side in agile projects to ensure stakeholder requirements are met\nProvides detailed requirements to meet strategic, user, and customer needs\nManages and prioritizes a backlog of requirements, advises developers, and participates in testing and acceptance\nCollaborates with the business analyst to define processes and measure impact\nAnswers, advises, and clarifies product requirements for the development team, seeking stakeholder input as needed\nAccepts stories as “completed” (may include sign off/review with CPO)\nParticipates in team demos, retrospectives, and system demo preparation for stakeholders\nAttends and often facilitates daily working sessions, driving team forward\nActs as a business systems and process expert across multiple BUs\nChallenges the status quo, drives simplification, and designs for optimal customer experience\nCoaches and mentors less senior team members\n\n\n\nAbout You:\n\n\nBachelor's degree plus 8+ years of experience in Process Design, Operations, Business Analysis, or operational management, or Master's degree required.\nStrong verbal and written communication skills are required. Proficiency in English is necessary.\nExtensive experience in business analysis, data modeling, requirements mapping, and large-scale design is preferred.\nExperience with lead to cash processes and multiple legacy systems across various BUs is advantageous.\nAbility to build effective relationships and collaborate with others to develop joint solutions. Handles difficult customer situations (both internal and external) professionally and resourcefully.\nDemonstrates an understanding of business principles.\nSkilled at leveraging and coaching others on various approaches to gather valuable information, even in challenging situations.\nExtensive knowledge of various Thomson Reuters businesses and products/services.\nExperience working with international partners.\nExperienced professional with comprehensive knowledge of technical discipline or specialism. Provides subject matter expertise across sub-units.\nStrong understanding of other roles within the function or Business Unit and their interconnections.\nKnowledge of relationships between all relevant groups within the company.\nAdapts traditional approaches to provide solutions and applies them in different circumstances.\nDemonstrates mastery of a specific discipline across related issues.\n\n\n\nWhat's in it For You?\n\nYou will join our inclusive culture of world-class talent, where we are committed to your personal and professional growth through:\n\n\nHybrid Work Model: We’ve adopted a flexible hybrid working environment (2-3 days a week in the office depending on the role) for our office-based roles while delivering a seamless experience that is digitally and physically connected\nWellbeing: Comprehensive benefit plans; flexible and supportive benefits for work-life balance: flexible vacation, two company-wide Mental Health Days Off; work from another location for up to a total of 8 weeks in a year, 4 of those weeks can be out of the country and the remaining in the country, Headspace app subscription; retirement, savings, tuition reimbursement, and employee incentive programs; resources for mental, physical, and financial wellbeing.\nCulture: Globally recognized and award-winning reputation for equality, diversity and inclusion, flexibility, work-life balance, and more.\nLearning & Development: LinkedIn Learning access; internal Talent Marketplace with opportunities to work on projects cross-company; Ten Thousand Coffees Thomson Reuters café networking.\nSocial Impact: Ten employee-driven Business Resource Groups; two paid volunteer days annually; Environmental, Social and Governance (ESG) initiatives for local and global impact.\nPurpose Driven Work: We have a superpower that we’ve never talked about with as much pride as we should – we are one of the only companies on the planet that helps its customers pursue justice, truth and transparency. Together, with the professionals and institutions we serve, we help uphold the rule of law, turn the wheels of commerce, catch bad actors, report the facts, and provide trusted, unbiased information to people all over the world.\n\n\n\nDo you want to be part of a team helping re-invent the way knowledge professionals work? How about a team that works every day to create a more transparent, just and inclusive future? At Thomson Reuters, we’ve been doing just that for almost 160 years. Our industry-leading products and services include highly specialized information-enabled software and tools for legal, tax, accounting and compliance professionals combined with the world’s most global news services – Reuters. We help these professionals do their jobs better, creating more time for them to focus on the things that matter most: advising, advocating, negotiating, governing and informing.\n\nWe are powered by the talents of 26,000 employees across more than 70 countries, where everyone has a chance to contribute and grow professionally in flexible work environments that celebrate diversity and inclusion. At a time when objectivity, accuracy, fairness and transparency are under attack, we consider it our duty to pursue them. Sound exciting? Join us and help shape the industries that move society forward.\n\nAccessibility\n\nAs a global business, we rely on diversity of culture and thought to deliver on our goals. To ensure we can do that, we seek talented, qualified employees in all our operations around the world regardless of race, color, sex/gender, including pregnancy, gender identity and expression, national origin, religion, sexual orientation, disability, age, marital status, citizen status, veteran status, or any other protected classification under applicable law. Thomson Reuters is proud to be an Equal Employment Opportunity/Affirmative Action Employer providing a drug-free workplace.\n\nWe also make reasonable accommodations for qualified individuals with disabilities and for sincerely held religious beliefs in accordance with applicable law.\n\nProtect yourself from fraudulent job postings click here to know more.\n\nMore information about Thomson Reuters can be found on https://thomsonreuters.com.\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-thomson-reuters-4149683386?position=6&pageNum=55&refId=rCPSt2W60wSZDZdAR5hPHw%3D%3D&trackingId=nTPb%2BzMMX9VwoUcv7CFF6Q%3D%3D"
}