{
    "job_id": "4149471308",
    "title": "Associate Data Scientist",
    "company": "Circle K",
    "location": "Gurugram, Haryana, India",
    "description": "Job Description\n\nAlimentation Couche-Tard Inc., (ACT) is a global Fortune 200 company. A leader in the convenience store and fuel space, it has footprint across 31 countries and territories. The India Data & Analytics Global Capability Centre is an integral part of ACT’s Global Data & Analytics Team and the Associate Data Scientist will be a key player on this team that will help grow analytics globally at ACT.\n\nAbout The Role\n\nThe hired candidate will partner with multiple departments, including Global Marketing, Merchandising, Global Technology, and Business Units. The incumbent will be responsible for delivering advanced analytics projects that drive business results including interpreting business, selecting the appropriate methodology, data cleaning, exploratory data analysis, model building, and creation of polished deliverables.\n\nResponsibilities\n\n\nAnalyze large-scale structured and unstructured data; develop deep-dive analyses and machine learning models in retail, marketing, merchandising, and other areas of the business\nUtilize data mining, statistical and machine learning techniques to derive business value from store, product, operations, financial, and customer transactional data\nApply multiple algorithms or architectures and recommend the best model with in-depth description to evangelize data-driven business decisions\nUtilize cloud setup to extract processed data for statistical modelling and big data analysis, and visualization tools to represent large sets of time series/cross-sectional data\nStructure hypothesis, build thoughtful analyses, develop underlying data models, and bring clarity to previously undefined problems\nPartner with Data Engineering to build, design and maintain core data infrastructure, pipelines, and data workflows to automate dashboards and analyses\nArticulate complex data science models to business teams and present the insights in easily understandable and innovative formats\n\n\nQualifications And Experience\n\n\nBachelor’s degree required, preferably with a quantitative focus (Statistics, Business Analytics, Data Science, Math, Economics, etc.)\nMaster’s degree preferred (MBA/MS Computer Science/M.Tech Computer Science, etc.)\n1–2 years of relevant working experience in a data science/advanced analytics role\nKnowledge of Functional Analytics (Supply chain analytics, Marketing Analytics, Customer Analytics)\nKnowledge and ability to conduct statistical modelling using Analytical tools (R, Python, KNIME, etc.) and use big data technologies\nKnowledge of business intelligence & reporting (Power BI, Tableau, Alteryx, etc.)\nKnowledge of Enterprise reporting systems, relational (MySQL, Microsoft SQL Server etc.), non-relational database management systems and Data Engineering tools\nKnowledge and ability to use Big data technologies (Hadoop, Spark, Kafka, Presto etc) and Cloud computing services in Azure/AWS/GCP for data engineering, ML Ops\nAbility to delivery, strong disposition towards business and strong interpersonal communication\nIndividual must be organized, dependable, able to multi-task and manage priorities, display initiative, and must have the ability to work independently in a demanding, fast-paced environment.\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/associate-data-scientist-at-circle-k-4149471308?position=1&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=nuqBsJvmOv2SzgSsV2bV%2BQ%3D%3D"
}