{
    "job_id": "4149469724",
    "title": "Associate Business Analyst",
    "company": "Veradigm®",
    "location": "India",
    "description": "Welcome to Veradigm! Our Mission is to be the most trusted provider of innovative solutions that empower all stakeholders across the healthcare continuum to deliver world-class outcomes. Our Vision is a Connected Community of Health that spans continents and borders. With the largest community of clients in healthcare, Veradigm is able to deliver an integrated platform of clinical, financial, connectivity and information solutions to facilitate enhanced collaboration and exchange of critical patient information.\n\nVeradigm\n\nWe are an Equal Opportunity Employer. No job applicant or employee shall receive less favorable treatment or be disadvantaged because of their gender, marital or family status, color, race, ethnic origin, religion, disability or age; nor be subject to less favorable treatment or be disadvantaged on any other basis prohibited by applicable law.\n\nFor more information, please explore Veradigm.com.\n\nWhat Will Your Job Look Like\n\nThe position is responsible for creating the business and/or functional requirements necessary for technology solutions that meet customer needs, expected delivery dates, and exceptional quality standards.\n\n\nWork under the direction of the Manager to provide application solutions for assigned business areas\nGathers and documents requirements, and bridges communication between business stakeholders and the development team\nSupport solution design, assist in testing and validation, and help manage change.\nEnsure compliance and maintain documentation.\nPossess functional knowledge of assigned application technology\nInteract with business users to understand new business requirements and enhancement requests\nTranslate business requirements into product-specific designs and configuration, detailed requirement specifications and use cases.\nCommunicates effectively with all parties related to assigned process area\nProvides accurate and timely information and appropriate notification as required Experience with process mapping, requirements documentation, and status reporting\nStrong analytical skills and the ability to interpret data\nPossess functional knowledge of assigned application technology\nPerform functional application configuration and configure /run reports at user request\n\nAcademic Qualifications\n\n\nBachelor’s degree in computer science, or related discipline\n\n\nAn Ideal Candidate Will Have\n\n\nExcellent written and oral communication skills\nHands on experience with Agile.\nMinimum 2 years of experience as Business Analyst.\nExperience with specific RPA (UiPath/ Automation Anywhere), Business Process Management, and process mining tools.\nExperience in US Healthcare.\n\n\nBenefits\n\nVeradigm believes in empowering our associates with the tools and flexibility to bring the best version of themselves to work. Through our generous benefits package with an emphasis on work/life balance, we give our employees the opportunity to allow their careers to flourish.\n\n\nQuarterly Company-Wide Recharge Days\nFlexible Work Environment (Remote/Hybrid Options)\nPeer-based incentive “Cheer” awards\n“All in to Win” bonus Program\nTuition Reimbursement Program\n\n\nTo know more about the benefits and culture at Veradigm, please visit the links mentioned below: -\n\nhttps://veradigm.com/about-veradigm/careers/benefits/\n\nhttps://veradigm.com/about-veradigm/careers/culture/\n\nVeradigm is proud to be an equal opportunity workplace dedicated to pursuing and hiring a diverse and inclusive workforce.\n\nThank you for reviewing this opportunity! Does this look like a great match for your skill set? If so, please scroll down and tell us more about yourself!\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/associate-business-analyst-at-veradigm%C2%AE-4149469724?position=2&pageNum=30&refId=8iL61BV3%2BLG7BSz3Qgjsxw%3D%3D&trackingId=vIDXoFS1OjMI4pwbvOMqmw%3D%3D"
}