{
    "job_id": "4149112681",
    "title": "Data Scientist",
    "company": "Celebal Technologies",
    "location": "Jaipur, Rajasthan, India",
    "description": "Job Title: Data Scientist\n\nJob Location: Jaipur\n\nExperience: 2 to 5 years\n\nJob Description:\n\nWe are seeking a highly skilled and innovative Data Scientist to join our dynamic and forward-thinking team. This role is ideal for someone who is passionate about advancing the fields of Classical Machine Learning, Conversational AI, and Deep Learning Systems and thrives on translating complex mathematical challenges into actionable machine learning models. The successful candidate will focus on developing, designing, and maintaining cutting-edge AI-based systems, ensuring seamless and engaging user experiences. Additionally, the role involves active participation in a wide variety of Natural Language Processing (NLP) tasks, including refining and optimizing prompts to enhance the performance of Large Language Models (LLMs).\n\nKey Responsibilities:\n\n• Generative AI Solutions: Develop innovative Generative AI solutions using machine learning and AI technologies, including building and fine-tuning models such as GANs, VAEs, and Transformers.\n\n• Classical ML Models: Design and develop machine learning models (regression, decision trees, SVMs, random forests, gradient boosting, clustering, dimensionality reduction) to address complex business challenges.\n\n• Deep Learning Systems: Train, fine-tune, and deploy deep learning models such as CNNs, RNNs, LSTMs, GANs, and Transformers to solve AI problems and optimize performance.\n\n• NLP and LLM Optimization: Participate in Natural Language Processing activities, refining and optimizing prompts to improve outcomes for Large Language Models (LLMs), such as GPT, BERT, and T5.\n\n• Data Management & Feature Engineering: Work with large datasets, perform data preprocessing, augmentation, and feature engineering to prepare data for machine learning and deep learning models.\n\n• Model Evaluation & Monitoring: Fine-tune models through hyperparameter optimization (grid search, random search, Bayesian optimization) to improve performance metrics (accuracy, precision, recall, F1-score). Monitor model performance to address drift, overfitting, and bias.\n\n• Code Review & Design Optimization: Participate in code and design reviews, ensuring quality and scalability in system architecture and development. Work closely with other engineers to review algorithms, validate models, and improve overall system efficiency.\n\n• Collaboration & Research: Collaborate with cross-functional teams including data scientists, engineers, and product managers to integrate machine learning solutions into production. Stay up to date with the latest AI/ML trends and research,applying cutting-edge techniques to projects.\n\nQualifications:\n\n• Educational Background: Bachelor’s or Master’s degree in Computer Science, Mathematics, Statistics, Data Science, or any related field.\n\n• Experience in Machine Learning: Extensive experience in both classical machine learning techniques (e.g., regression, SVM, decision trees) and deep learning systems (e.g., neural networks, transformers). Experience with frameworks such as TensorFlow, PyTorch, or Keras.\n\n• Natural Language Processing Expertise: Proven experience in NLP, especially with Large Language Models (LLMs) like GPT, BERT, or T5. Experience in prompt engineering, fine-tuning, and optimizing model outcomes is a strong plus.\n\n• Programming Skills: Proficiency in Python and relevant libraries such as NumPy, Pandas, Scikit-learn, and natural language processing libraries (e.g., Hugging Face Transformers, NLTK, SpaCy).\n\n• Mathematical & Statistical Knowledge: Strong understanding of statistical modeling, probability theory, and mathematical optimization techniques used in machine learning.\n\n• Model Deployment & Automation: Experience with deploying machine learning models into production environments using platforms such as AWS SageMaker or Azure ML, GCP AI, or similar. Familiarity with MLOps practices is an advantage.\n\n• Code Review & System Design: Experience in code review, design optimization, and ensuring quality in large-scale AI/ML systems. Understanding of distributed computing and parallel processing is a plus.\n\nSoft Skills & Behavioural Qualifications:\n\n• Must be a good team player and self-motivated to achieve positive results\n\n• Must have excellent communication skills in English.\n\n• Exhibits strong presentation skills with attention to detail.\n\n• It’s essential to have a strong aptitude for learning new techniques.\n\n• Takes ownership for responsibilities\n\n• Demonstrates a high degree of reliability, integrity, and trustworthiness\n\n• Ability to manage time, displays appropriate sense of urgency and meet/exceed all deadlines\n\n• Ability to accurately process high volumes of work within established deadlines\n\n\n\n\nShare your cv at sulabh.tailang@celebaltech.com\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-celebal-technologies-4149112681?position=11&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=QWv%2FfrZwLECZP1JTV39bGg%3D%3D"
}