{
    "job_id": "4149186491",
    "title": "HR Business Analyst",
    "company": "Astreya",
    "location": "India",
    "description": "What this Job Entails:\n\n\n\n\nThe HR Business Analyst II will provide solutions that help attain business outcomes. The HR Business Analyst will be responsible for helping the team's operational support strategy by working directly with HR leadership, service owners, and employees across our organization to catalogue and assess people services, document support designs, prioritize, and implement processes to support the people applications they manage.\n\n\n\n\nScope:\n\nApplies company policies and procedures to resolve a variety of issues\nWorks on problems of moderate scope\nReceives general instructions on routine work and detailed instructions on new projects\n\n\n\n\nYour Roles and Responsibilities:\n\nParticipate in identifying business process gaps and help scale current client systems to close them.\nHelp conduct quantitative/ qualitative data analysis using various tools and functions to help establish short and long-range objectives; offer strategies and actions to achieve them.\nAssist with analysis of complex business problems that can be solved through change management or system automation.\nAnalyze information and evaluate results to choose the best solution to solve problems.\nUtilize relevant information and individual judgment to determine, interpret, and explain human resources policies, procedures, laws, standards, or regulations, while maintaining compliance.\nProvide guidance and expert advice to management or other groups on technical, systems, or HR process related issues, while explaining what information means and how to be used.\nPrepare and maintain employment records related to events, such as hiring, termination, leaves, transfers, leaves, transfers, or promotions, using HR management software.\nTrack, analyze and address employee relations issues, such as harassment allegations, work complaints, or other employee concerns.\nSupport team with management of information and applicable supporting documents and dashboards.\nGenerate charts and reports as required to demonstrate metric and KPI trends on a monthly or quarterly basis.\nWork with stakeholders, including 3rd party representatives, to assist with troubleshooting and resolve HR business problems.\nWork with client stakeholders to improve, automate and align business data with current client processes.\nCurate and maintain related support documentation (Self help articles, training material, support flows, other documentation).\nOther duties as required. This list is not meant to be a comprehensive inventory of all responsibilities assigned to this position.\n\n\n\n\nRequired Qualifications/Skills:\n\nBachelor’s degree (B.S/B.A) from four-college or university and 2 to 5 years’ related experience and/or training; or equivalent combination of education and experience.\nBuild productive internal and external working relationships.\nExercise critical thinking and sound judgment by applying logic and reasoning to identify strengths and weaknesses of alternative solutions, conclusions, or approaches.\nExcellent documentation, writing, organization, and verbal communication skills.\nFamiliarity with cloud-based data access and sharing software, i.e., Google Drive, Enterprise Resource Planning software, i.e., Workday, Office Suite software, i.e., Google docs, sheets, Microsoft suite, etc.\nAble to combine pieces of information to form general rules or conclusions, including finding a relationship among seemingly unrelated events.\nAble to apply general rules to specific problems to produce outcomes that make sense.\nAble to research, read, interpret, and create technical reports and documentation.\nExcellent organization skills and ability to adapt to a rapidly changing work environment.\n\n\n\n\nPreferred Qualifications:\n\nWorking knowledge of various Department of Labor, federal, state, and Astreya policies, procedures, and regulations.\nAbility to create metrics in various systems.\nEducation in statistics and methods of program and process evaluation.\nUnderstanding of project management.\n\n\n\n\nPhysical Demand & Work Environment\n\nMust have the ability to perform office-related tasks which may include prolonged sitting or standing.\nMust have the ability to move from place to place within an office environment.\nMust be able to use a computer and computer software.\nMust have the ability to communicate effectively.\nSome positions may require occasional repetitive motion or movements of the wrists, hands, and/or fingers.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/hr-business-analyst-at-astreya-4149186491?position=10&pageNum=15&refId=rYf7Kk8Eb63jO7gIoGSEug%3D%3D&trackingId=uzkzEto6uZ61mmhtbl82aw%3D%3D"
}