{
    "job_id": "4149110760",
    "title": "Business Analyst – Strategy & Growth",
    "company": "Radical Minds Technologies Pvt. Ltd.",
    "location": "Gurugram, Haryana, India",
    "description": "Job Opportunity: Business Analyst – Reporting to Founder & Managing Director\n\nRadical Minds Technologies Pvt. Ltd. (www.radicalminds.in)\n\nRMT Engineering Pvt. Ltd. (www.rmtengg.com)\n\n\n\n\nAbout the Organizations:\n\n\n\n\n• Radical Minds Technologies Pvt. Ltd. is a leading BPO and customer experience service provider, delivering tailored solutions across diverse industries which includes but not limited to Travel & Hospitality, Logistics, Food Aggregators, BFSI, Retail, Crypto, Healthcare, Govt. & PSU etc..\n\n• RMT Engineering Pvt. Ltd. is an IT company specializing in AI/ML based product development, IT projects, and IT services for Domestic & International clients, with a focus on driving innovation and delivering high-impact solutions.\n\n\n\n\nWe are seeking a Business Analyst who will work closely with and report directly to Founder and Managing Director, to contribute to the strategic growth and operational excellence of both organizations.\n\n\n\n\nJob Title: Business Analyst – Strategy & Growth\n\n\n\n\nKey Responsibilities:\n\n\n\n\n1. Strategic Support:\n\n• Work directly with the Founder & Managing Director to analyze and implement key business strategies.\n\n• Provide insights and recommendations to support high-level decision-making and business growth initiatives.\n\n2. Data-Driven Analysis:\n\n• Conduct detailed market research to identify opportunities, trends, and challenges across various sectors.\n\n• Analyze business performance data to identify gaps and propose actionable improvements.\n\n3. Client Acquisition & Growth Planning:\n\n• Assist in identifying potential clients and markets for business expansion.\n\n• Develop strategic plans to improve brand visibility, client satisfaction, and operational efficiency.\n\n4. Operational Excellence:\n\n• Benchmark the organization’s processes and performance against industry standards.\n\n• Propose strategies to improve governance, team efficiency, and customer experience.\n\n5. Project Collaboration:\n\n• Collaborate with cross-functional teams to support the execution of strategic projects.\n\n• Prepare detailed reports and presentations for leadership, ensuring actionable outcomes.\n\n\n\n\n\n\n\nDesired Skills and Qualifications:\n\n\n\n\n• Proven Expertise: Experience in market research & analysis, business strategy, and operational improvements.\n\n• Analytical Skills: Strong ability to collect, analyze, and interpret complex data into actionable insights.\n\n• Communication: Excellent written and verbal communication skills, including presentation capabilities.\n\n• Relationship Building: Ability to interact with CXOs, senior stakeholders, clients, and teams effectively.\n\n• Educational Background: Bachelor’s degree in Business Administration, Marketing, or a related field (MBA preferred).\n\n• Mandatory Technical Proficiency: Advanced knowledge of Excel, PowerPoint, and business intelligence tools.\n\n\n\n\nWhy This Role?\n\n\n\n\n• Direct Mentorship: Work directly with the Founder and Managing Director, gaining hands-on exposure to business strategy at the highest level.\n\n• High-Impact Work: Be involved in critical projects that shape the future of the organizations.\n\n• Dynamic Environment: Join a collaborative team that encourages innovation and professional growth.\n\n\n\n\n📩 To Apply: Send your resume and a brief introduction to info@radicalminds.in \n\n\n\n\nJoin us and play a pivotal role in driving the growth of two dynamic organizations!\n\n\n\n\n#Hiring #BusinessAnalyst #LeadershipRole #RadicalMinds #RMTEngineering\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-%E2%80%93-strategy-growth-at-radical-minds-technologies-pvt-ltd-4149110760?position=2&pageNum=25&refId=kluirdiBIoCee5yDSaO06g%3D%3D&trackingId=2SyIE5btuM98PzmsxOZucg%3D%3D"
}