{
    "job_id": "4150132269",
    "title": "Data Scientist",
    "company": "Jio Finance Ltd.",
    "location": "Navi Mumbai, Maharashtra, India",
    "description": "We are planning to hire a Data Scientist / Business Analyst for our growing Data Science\n\n& Analytics practice to join our Retail Analytics Team. This is a high octane team delivering\n\nanalytic solutions, high quality services and insights for business resulting in direct\n\nBusiness Growth and strategy formulations.\n\n\n\n\nRoles & Responsibilities:\n\n● The individual will be responsible for running Portfolio Insights, Reject Inferencing,\n\nBureau Data Analysis, Cross-Sell Analysis, Personalization projects etc using AI/ML\n\ntechniques.\n\n● Provide technical prowess, including guiding the other team members on best\n\npractices in data analysis, modeling techniques, model monitoring and tool selection\n\netc.\n\n● Manage project initiatives for the Product Analytics team, ensuring alignment with\n\nbusiness goals and timely delivery of high-impact results\n\n● Investigate user behavior patterns to identify opportunities for improving product adoption,\n\nengagement, and retention of our observability tools\n\n● Develop and implement strategies to build product stickiness and reduce churn, including\n\nthe creation and tracking of relevant metrics for observability products\n\n● Track KPIs across the product organization and perform root cause analysis on significa\n\nchanges or anomalies\n\n● Collaborate closely with Data Engineering/Business/Credit & Risk teams to ensure data\n\nquality, accessibility, and efficient pipeli\n\n● Develop and maintain comprehensive documentation of analytics processes,\n\nmethodologies, and findin\n\n● Foster a positive team culture that promotes innovation, collaboration, and continuous\n\nlearning\n\n\n\n\nKnowledge & Experience:\n\n\n\n\n● Minimum of 2 years of experience in advanced Analytics and data science in BFSI\n\ndomain\n\n● Python programming skills for data manipulation, analysis, and DS modeling\n\n● Solid understanding of statistical concepts and their application in business contexts\n\n● Hands-on experience with modeling and predictive analytics techniques such as\n\nSupervised learning, Unsupervised learning, Time series analysis etc.\n\n● Model evaluation metrics and validation techniques (cross-validation, ROC curves,\n\nconfusion matrices) * Some background in model deployment in production and model\n\nmonitoring\n\n● Expertise in data visualization and dashboard creation, particularly with either of Power\n\nBI/Tableau/Looker Studio etc.\n\n● Proficiency in SQL for complex data querying and analys\n\n● Familiarity with data transformation and modeling and Bureau Data Analysis\n\n● Strong data visualization and storytelling abilities to communicate insights effectively\n\n● Experience with Analytics best practices and establishing data governance\n\n● Strong leadership skills, including the ability to motivate and inspire team members\n\n● Proven ability to manage multiple priorities and deliver results in a fast-paced environment\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-jio-finance-ltd-4150132269?position=7&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=9qtmher%2FliJ6Xu35laiMvA%3D%3D"
}