{
    "job_id": "4150430328",
    "title": "Business Analysis Lead Analyst [T500-16285]",
    "company": "Evernorth Health Services",
    "location": "Hyderabad, Telangana, India",
    "description": "About Evernorth:\n\nEvernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people.\n\n\n\n\nPosition Overview:\n\nThe GenAI IT Business Analyst will work closely with business stakeholders, IT teams, and subject matter experts in the Global Healthcare Innovation Hub team to gather, analyze, and document business requirements for GenAI capabilities. They will translate these requirements into functional and non-functional specifications for use by IT teams in the development and integration of AI-related solutions. Additionally, they will be responsible for contributing towards testing, work towards developing test scripts and test cases. Previous experience as a business analyst/QA analyst or a similar role is required, with preferred experience in GenAI along with software testing in the healthcare industry.\n\n\n\n\nResponsibilities:\n\nLiaise with business stakeholders, IT teams, and subject matter experts to gather, analyse, and document GenAI-related business requirements, translating them into functional and non-functional specifications for use by IT teams in the development of AI technology solutions.\nCollaborate with project teams to design, develop, and implement IT solutions focusing on GenAI capabilities, aligning with the organization's objectives and industry best practices.\nAct as a bridge between business users and IT developers, ensuring that GenAI development efforts are consistent with the business requirements and strategic goals of the organization.\nSupport the functional testing and user acceptance testing process for AI-related solutions, helping to identify defects, track them to resolution, and ensure the final deliverables meet the agreed-upon requirements.\nParticipate in ongoing monitoring and measurement of GenAI technology solutions' effectiveness, providing insights and suggestions for continuous improvement.\nDevelop and maintain documentation, such as flowcharts, use-cases, data diagrams, and user manuals, to support business stakeholders in understanding the AI features and their usage.\nEmploy strong analytical and conceptual thinking skills to help stakeholders formulate GenAI-related requirements through interviews, workshops, and other methods.\nPerform testing of AI models developed as part of business requirement.\n\n\n\n\nQualifications\n\nRequired Skills:\n\nProficiency in GenAI-related business analysis methodologies, including requirements gathering, process modelling, and data analysis techniques.\nStrong knowledge of software development lifecycle (SDLC) methodologies for AI-related technologies, such as Agile, Scrum, or Waterfall.\nExperience working with IT project management tools and knowledge of AI frameworks.\nExperience in Jira, Confluence is a must.\nProficient in common office productivity tools, such as Microsoft Office Suite, Visio, and experience with cloud services like AWS Sagemaker and Azure ML.\nTechnical knowledge of programming languages like C/C++, Java, Python, and understanding of database systems, IT infrastructure is good to have but not mandatory.\nKnowledge and exposure of Software Testing Life Cycle (STLC) phases like test planning, design, execution and defect tracking etc.\nExcellent communication, interpersonal, and stakeholder management skills with a focus on GenAI capabilities.\nRelevant certifications, such as Certified Business Analysis Professional (CBAP), or AI-related credentials are a plus.\nAbility to design GenAI features and define user stories based on business requirements.\nGood understanding of the software delivery lifecycle for AI-related technologies and experience creating detailed reports and presentations.\n\n\n\n\nRequired Experience & Education:\n\n5-8 Years of Experience\nPrevious experience as a Business Analyst / Quality Analyst or a similar role in the IT sector, with a focus on GenAI and deep learning technologies.\nExperience working within the healthcare industry is desirable.\nExperience in automation testing is desirable.\nFamiliarity with healthcare-specific IT systems and industry regulations, such as Electronic Health Record systems and HIPAA, is an added advantage.\n\n\n\n\nDesired Experience:\n\nExposure to Gen AI and Cloud systems like AWS\n\n\n\n\nLocation & Hours of Work:\n\nFull-time position, working 40 hours per week. Expected overlap with US hours as appropriate\nPrimarily based in the Innovation Hub in Hyderabad, India in a hybrid working model (3 days WFO and 2 days WAH)\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analysis-lead-analyst-t500-16285-at-evernorth-health-services-4150430328?position=9&pageNum=52&refId=45I0DUvCFXw1ux4xI%2B7zbg%3D%3D&trackingId=MBrugyFjlU%2BYjnpP37ov%2BQ%3D%3D"
}