{
    "job_id": "4150251637",
    "title": "Business Analyst",
    "company": "91HR",
    "location": "Goa, India",
    "description": "Experience Required\n\n3 to 5 years of experience\n\n\n\n\nMust haves:\n\nGood Communication skills\nHands on experience in writing BRDs\nExperience in gathering requirement from client and communicating it with the internal teams\nExperience in Agile (writing user stories, customer acceptance criteria)\nExperience in Software Product development lifecycle process\nCandidate must belong to a Product based company\n\n\n\n\n\n\n\nDuties and Responsibilities:\n\n• Collecting, understanding, and transmitting the business requirements for the project,and translating these into functional specifications and detailed test plans.\n\n• Analyze and document business processes.\n\n• Document workflows and results of business analysis and obtain sign-off from client on the specifications.\n\n• To provide the link between the customer, development team and any third-party regarding software functionality, throughout the development life cycle.\n\n• Day to day management of change requests in relation to the project plans to ensure agreed deadlines are met.\n\n• Weekly reports to be produced for the project manager showing progress against outstanding milestones, status, resource requirements, issues, risks and dependencies.\n\n\n\n\nSkills Required\n\n• Should be well versed with the Travel Industry and Domain.\n\n• Demonstrable evidence of analyzing and documenting complex business processes.\n\n• Demonstrable experience writing requirements specifications for Information Systems.\n\n• A proven track record in Software Development.\n\n• End to end experience of the project life cycle.\n\n• Has experience of working as a BA in Agile SDLC process.\n\n• Proven experience interacting directly with end users – customer facing role.\n\n• Excellent written and verbal communication and interpersonal skills.\n\n• Desire and willingness to travel to client site to conduct training workshops.\n\n\n\n\nEducational Qualifications\n\n• Graduate in relevant field\n\n• Preferable in Software Engineering\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-91hr-4150251637?position=1&pageNum=20&refId=7fN7Ckox%2BLonxiKufmjeog%3D%3D&trackingId=snagH6GY6gYMVNqKee76CQ%3D%3D"
}