{
    "job_id": "4150135885",
    "title": "Business Analyst",
    "company": "Wipro",
    "location": "Hyderabad, Telangana, India",
    "description": "Job description:\n\n \n\nRole Purpose\n\nThe purpose of the role is to liaison and bridging the gap between customer and Wipro delivery team to comprehend and analyze customer requirements and articulating aptly to delivery teams thereby, ensuring right solutioning to the customer.\n\nDo\n\n  \n\nCustomer requirements gathering and engagement\nInterface and coordinate with client engagement partners to understand the RFP/ RFI requirements\nDetail out scope documents, functional & non-functional requirements, features etc ensuring all stated and unstated customer needs are captured\nConstruct workflow charts and diagrams, studying system capabilities, writing specification after thorough research and analysis of customer requirements\nEngage and interact with internal team - project managers, pre- sales team, tech leads, architects to design and formulate accurate and timely response to RFP/RFIs\nUnderstand and communicate the financial and operational impact of any changes\nPeriodic cadence with customers to seek clarifications and feedback wrt solution proposed for a particular RFP/ RFI and accordingly instructing delivery team to make changes in the design\nEmpower the customers through demonstration and presentation of the proposed solution/ prototype\nMaintain relationships with customers to optimize business integration and lead generation\nEnsure ongoing reviews and feedback from customers to improve and deliver better value (services/ products) to the customers\n\n \n\nEngage with delivery team to ensure right solution is proposed to the customer\nPeriodic cadence with delivery team to:\nProvide them with customer feedback/ inputs on the proposed solution\nReview the test cases to check 100% coverage of customer requirements\nConduct root cause analysis to understand the proposed solution/ demo/ prototype before sharing it with the customer\nDeploy and facilitate new change requests to cater to customer needs and requirements\nSupport QA team with periodic testing to ensure solutions meet the needs of businesses by giving timely inputs/feedback\nConduct Integration Testing and User Acceptance demo’s testing to validate implemented solutions and ensure 100% success rate\nUse data modelling practices to analyze the findings and design, develop improvements and changes\nEnsure 100% utilization by studying systems capabilities and understanding business specifications\nStitch the entire response/ solution proposed to the RFP/ RFI before its presented to the customer\n\n \n\nSupport Project Manager/ Delivery Team in delivering the solution to the customer\nDefine and plan project milestones, phases and different elements involved in the project along with the principal consultant\nDrive and challenge the presumptions of delivery teams on how will they successfully execute their plans\nEnsure Customer Satisfaction through quality deliverable on time\n\n \n\nBuild domain expertise and contribute to knowledge repository\nEngage and interact with other BA’s to share expertise and increase domain knowledge across the vertical\nWrite whitepapers/ research papers, point of views and share with the consulting community at large\nIdentify and create used cases for a different project/ account that can be brought at Wipro level for business enhancements\nConduct market research for content and development to provide latest inputs into the projects thereby ensuring customer delight\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nStakeholder Interaction\n\n \n\nStakeholder Type\n\nStakeholder Identification\n\nPurpose of Interaction\n\nInternal\n\n \n\n \n\nPre-sales team\n\nFor solutioning for an RFP/ client requirement\n\nPrincipal Consultants\n\nGovernance and to discuss and drive business requirements and growth\n\nTesting team/ QA\n\nFor quality checks and continuous analysis to ensure seamless delivery\n\nDelivery team\n\nFor product solutioning and developing systems and processes\n\nClient partners/ sales team\n\nFor any lead generation\n\nExternal\n\nConsulting Partners\n\nCoordinating for consulting solutions and continuous support\n\nCustomers\n\nTo provide them with right solution and ensure customer satisfaction & engagement\n\n \n\n \n\nDisplay\n\n \n\nLists the competencies required to perform this role effectively:\n\nFunctional Competencies/ Skill\nDomain/Industry Knowledge - Awareness and knowledge of broad economic, demographic, technological and global trends in the IT industry - Expert\nLeveraging Technology - Knowledge of current and upcoming technology (automation, tools and systems) to build efficiencies and facilitate the process of providing solutions for problems and opportunities - Competent\nProcess Excellence - Execute projects with end-outcome and process focus, along with understanding of end to end delivery processes and its governance - Competent\nDocumentation and research orientation - Ability to articulate the requirements apply & document them and perform market/ secondary research on the new upcoming areas of expertise - Expert\n\n \n\n \n\n \n\nCompetency Levels\n\nFoundation\n\nKnowledgeable about the competency requirements. Demonstrates (in parts) frequently with minimal support and guidance.\n\nCompetent\n\nConsistently demonstrates the full range of the competency without guidance. Extends the competency to difficult and unknown situations as well.\n\nExpert\n\nApplies the competency in all situations and is serves as a guide to others as well.\n\nMaster\n\nCoaches others and builds organizational capability in the competency area. Serves as a key resource for that competency and is recognised within the entire organization.\n\n \n\nBehavioral Competencies\nProblem solving and decision making\nExecution excellence and passion for results\nPassion for results\nRelationship Building\nTeamwork\nManaging complexity\nEffective communication\n\n \n\nDeliver\n\n \n\nNo.\n\nPerformance Parameter\n\nMeasure\n\n1.\n\nCustomer Engagement and Delivery Management\n\nPCSAT, utilization % achievement, no. of leads generated from the business interaction, no. of errors/ gaps in documenting customer requirements, feedback from project manager, process flow diagrams (quality and timeliness), % of deal solutioning completed within timeline, velocity generated,\n\n2.\n\nKnowledge Management\n\nNo. of whitepapers/ research papers written, no. of user stories created, % of proposal documentation completed and uploaded into knowledge repository, No of reusable components  developed for proposal during quarter\n\n \n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-wipro-4150135885?position=1&pageNum=5&refId=lj%2BaylP9Zxb0xcLPbmF98Q%3D%3D&trackingId=nUnZWQjDDG3MWSsvRhc5eQ%3D%3D"
}