{
    "job_id": "4150744146",
    "title": "Business Analyst",
    "company": "Geojit Technologies",
    "location": "Kochi, Kerala, India",
    "description": "Product Owner / Business Analyst\n\nResponsible for understanding the business needs. Work as liaison between client and technical team. Work with stakeholders to gather requirements, analyse data, and develop solutions that meet the organization’s goals.\n\nExperience\n\n4-8 years\n\nResponsibilities\n\nGather requirements in collaboration with Business users, Architects and SMEs and create SRS / BRD / FSD / Mock-ups for the final product.\nCommunication with stakeholders and ensure all the requirements are captured for features, functionalities and communicate the deadlines, and other details.\nAble to identify Technical and Application dependencies and communicate to the business in timely manner.\nVerify the product meets customer needs by reviewing feedback from customers / Business Users or conducting usability testing.\nCreate wireframes, clickable prototypes and other proof of concepts and get it reviewed for feasibility.\nPrioritize product backlog based on their business value, estimate the efforts required, and the communicate to the team.\nAssisting the development team in clarifying requirements and helping them to understand the business use case.\nTo ensure that developers understand each project's requirements, coordinate with them.\nCommunication of project status and roadblocks with other members of the team.\nSprint planning and resolving any technical queries.\nAssisting the QA team and validating test results.\nGood understanding and experience in Agile and scrum activities.\nExcellent communication and stakeholder management skills.\n\n\n\n\nQualifications\n\nBachelor’s or Master‘s degree in computer science, engineering, management or related field\nMinimum 4+ years of relevant experience\nWell versed with concepts around mutual funds, stock markets, securities, equity, fixed income and derivatives\nExperience in designing solutions across Web / Mobile apps\nProficient in using wireframing tools like Axure, Balsamiq, Figma, Sketch, MS Visio etc\nExperience with using tools like MS Azure DevOps Boards, Jira, Trello, etc.\nExcellent communication, presentation and negotiation skills\nPreference will be given to candidates with experience in the BFSI / Capital Markets domain.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-geojit-technologies-4150744146?position=7&pageNum=72&refId=Mz5LEAf7jSU4t3WBJ4sgJQ%3D%3D&trackingId=XT%2FsRCndML5EsjBRs%2BK6mQ%3D%3D"
}