{
    "job_id": "4150907541",
    "title": "Interesting Job Opportunity: Senior Business Analyst - Jira/Agile",
    "company": "Hidden Brains InfoTech",
    "location": "Ahmedabad, Gujarat, India",
    "description": "Role : Senior Business Analyst\n\nKey Responsibilities\n\n\nEvaluate current business processes, identify gaps, and recommend improvements.\nGather & document business requirements, ensuring clarity, completeness, and feasibility.\nSkilled in designing wireframes and establishing their navigation flow.\nAbility to lead a project development team independently.\nProficient in creating BRD and FRD documents, including use-case, activity, class, and data flow diagrams, and the ability to think of edge case scenarios.\nBrainstorm and perform analysis to identify business trends, issues, and opportunities.\nAdaptable to working in both agile and waterfall methodologies.\nAbility to create user stories, manage task cards and use tools like Jira, Trello, Asana, slack, Teams, etc.\nHave experience in working with multiple domain/industries\nCollaborate with cross-functional teams to develop and implement solutions.\nAbility to generate various options and provide recommendations to customers in terms of technology solutions.\nCommunicate findings and recommendations to both internal and external stakeholders.\nAbility to understand As-Is process as well as define to-be processes. Identify opportunities for process improvements and cost savings.\nProvide guidance and mentorship to junior business analysts\nAbility to meet the ongoing needs of the client and the organization.\n\n\nRequirements\n\n\nExcellent communication (oral and written) & interpersonal skills\nAny Bachelor's degree or a related field\n7+ years of experience in business analysis\nProven experience in leading project team independently\nStrong analytical and problem-solving skills\nProficient in Excel, PowerPoint, Word, etc.\nReadiness to travel onsite (Outside India) if required\nExperience with data visualization tools and business intelligence software is a plus\nHands on technical experience in past is a plus\nCreating WBS (Work Break Down Structure) & Business Proposal is a plus\nOpenness to learn and flexible as a team member\n\n\n(ref:hirist.tech)\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/interesting-job-opportunity-senior-business-analyst-jira-agile-at-hidden-brains-infotech-4150907541?position=5&pageNum=75&refId=oawIpd1n3a%2BRa%2FbhSX9Nsw%3D%3D&trackingId=8GDWF3kfPQYN2EZyf11LsQ%3D%3D"
}