{
    "job_id": "4150192758",
    "title": "Business Analyst II",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nAdvertising at Amazon is a fast-growing multi-billion dollar business that spans across desktop, mobile and connected devices; encompasses ads on Amazon and a vast network of hundreds of thousands of third party publishers; and extends across US, EU, and an increasing number of international geographies.\n\nThe Supply Quality org within Amazon Advertising leverages proprietary and third-party technology to provide these products across Amazon Advertising programs : invalid traffic (IVT) filtration, viewability prediction and measurement, and content adjacency policy enforcement capabilities. Together, these products ensure that Amazon’s retail, advertiser, and publisher customers have a high-quality advertising experience and build trust that helps drive repeat customers.\n\nOperating horizontally within Supply Quality, the Customer Success team owns a) proactive and reactive investigative mechanisms that improve experience pertaining to Supply Quality customer escalations b) investigations and analytics for critical Traffic Quality business metrics and KPIs. We are looking for a Business Analyst to join our team and work on data and business problems pertaining to customer issues and critical business metrics. You’ll own and execute aspects of the database, data management, data pre-processing and inference considerations towards continually improving ongoing analysis processes and deliver faster investigative turnarounds. As a part of the team, you will work with Business Analysts, Business Intelligence Engineers, Scientists, Software Engineers within the Supply Quality team, and coordinate with the other advertising technology engineering, business, and operations teams.\n\nKey job responsibilities\n\n\nConduct investigations into customer escalations and metric deviations and ensure they are analyzed within targeted SLAs.\nRun complex analyses, deep dive into large data sets using SQL, and other data manipulation languages to root cause issues.\nPerform large scale data mining to find trends and problems, then communicate and drive corrective action.\nWork with partners and stakeholders including Supply Quality teams, other advertising engineering, business and operations teams to get the right resolutions.\nDevelop analytical frameworks and SOPs, create and standardize analytical approaches towards speeding up analysis. Implement process improvement and automation projects.\nOwn generation of metrics, underlying data pipelines and reporting to support regular business reviews and ad-hoc analyses, including communicating them to external teams and stakeholders.\n\n\nBasic Qualifications\n\n\nBachelor's degree or equivalent\n3+ years of business analyst, data analyst or similar role experience\nExperience with data visualization using Tableau, Quicksight, or similar tools\nExperience with SQL\nExperience defining requirements and using data and metrics to draw business insights\nExperience making business recommendations and influencing stakeholders\n\n\nPreferred Qualifications\n\n\nAdvanced working knowledge of data mining and analysis using SQL, ETL, visualisation tools\nExperience in scripting languages like Python, Pig, Shell script\nExcellent written and spoken communication skills\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI - BLR - DTA\n\nJob ID: A2899176\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-ii-at-amazon-4150192758?position=8&pageNum=20&refId=7fN7Ckox%2BLonxiKufmjeog%3D%3D&trackingId=nreJD9SG6nGMMFPKGDMStQ%3D%3D"
}