{
    "job_id": "4150367034",
    "title": "Machine Learning Engineer",
    "company": "Deliveroo",
    "location": "Bengaluru, Karnataka, India",
    "description": "Why Deliveroo\n\n\n\n\nOur mission is to transform the way you shop and eat, bringing the neighbourhood to your door by connecting consumers, restaurants, shops and riders. We are transforming the way the world eats and shops by making access to food and products more convenient and enjoyable. We give people the opportunity to buy what they want, as they want it, when and where they want it.\n\n\n\n\nWe are a technology-driven company at the forefront of the most rapidly expanding industry in the world. We are still a small team, making a very large impact, looking to answer some of the most interesting questions out there. We move fast, value autonomy and ownership, and we are always looking for new ideas.\n\n\n\n\nThe Data & Science Org\n\n\n\n\nAt Deliveroo, we have a world-class data science organisation with a mission to enable the highest quality human and machine decision-making. \n\n\n\n\nWe work throughout the company - in product, business and platform teams to answer some of the most interesting questions out there. For example, how can we connect restaurants, riders and customers most efficiently in order to deliver food as quickly as possible? How do data and technology help restaurants to grow as consumer habits change? How can we predict what someone wants to order for dinner long before the idea has even crossed their mind? \n\n\n\n\nThese are just some of the tough problems we are solving at Deliveroo. There is no challenge that cannot be yours; the scope for growth and personal impact is enormous. Data Scientists and Machine Learning Engineers at Deliveroo belong to an expert, thoughtful, and active community with guest lecturers, a robust technical review process, a career progression framework, and plenty of opportunities to learn new things.\n\n\n\n\nAs a Machine Learning Engineer, you will play a crucial role in the development, implementation and maintenance of cutting-edge machine learning products. Your responsibilities will involve engineering sophisticated machine learning models, as well as refining and updating existing systems. In order to thrive in this position, you must have outstanding engineering and programming skills, as well as a solid understanding of data science and statistics.\n\n\n\n\nThe Team\n\n\n\n\nWe are looking for a Machine Learning Engineer to join our New Verticals team. This is a new, thriving area of the business focused on our Grocery and Retail offerings. You will be working alongside a Senior Machine Learning Engineer and you will build new models around personalisation, search & ranking, and recommender systems.\n\n\n\n\nThe Role\n\n\n\n\nYou will develop the algorithmic and machine-learning systems that power Deliveroo. You will work in a cross-functional team alongside engineers, data scientists and product managers to develop systems that make automated decisions at massive scale. The team has independence and works on some of the most interesting problems at the intersection of riders, consumers, and restaurants. We evaluate the performance of all our decision-making machines through our world-class experimentation platform.\n\n\n\n\nYou will report to a Data + Science Manager. This is a hybrid role based in Bangalore.\n\n\n\n\nRequirements:\n\n\n\n\n\n3+ years of experience applying algorithmic solutions to business problems\n\n\nExperience with end-to-end model productionisation.\n\n\nYou are someone who knows the fundamentals of machine learning and when they should be applied.\n\n\nYou can translate a fuzzy business problem or objective into a well-thought-out algorithmic solution. You get satisfaction from seeing your algorithms shipped and driving measurable impact to the business.\n\n\nA bias to simplicity, where you care most about achieving impact.\n\n\n\n\n\n \n\n\n\n\nWorkplace & Benefits\n\n\n\n\nAt Deliveroo we know that people are the heart of the business and we prioritise their welfare. Benefits differ by country, but we offer many benefits in areas including healthcare, well-being, parental leave, pensions, and generous annual leave allowances, including time off to support a charitable cause of your choice. Benefits are country-specific, please ask your recruiter for more information.\n\n\n\n\nDiversity\n\n\n\n\nAt Deliveroo, we believe a great workplace is one that represents the world we live in and how beautifully diverse it can be. That means we have no judgement when it comes to any one of the things that make you who you are - your gender, race, sexuality, religion or a secret aversion to coriander. All you need is a passion for (most) food and a desire to be part of one of the fastest-growing businesses in a rapidly growing industry.\n\n\n\n\nWe are committed to diversity, equity and inclusion in all aspects of our hiring process. We recognise that some candidates may require adjustments to apply for a position or fairly participate in the interview process. If you require any adjustments, please don't hesitate to let us know. We will make every effort to provide the necessary adjustments to ensure you have an equitable opportunity to succeed.\n\n\n\n\n\nPlease click here to view our candidate privacy policy.\n\n\n\n\nPlease click here to view our candidate privacy policy.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/machine-learning-engineer-at-deliveroo-4150367034?position=15&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=kb1p9nBR%2BjAyfLt5IbARxA%3D%3D"
}