{
    "job_id": "4151372344",
    "title": "DATA AND APPLIED SCIENTIST",
    "company": "Microsoft",
    "location": "Bengaluru, Karnataka, India",
    "description": "We are looking for Applied Scientist I with expertise in areas like Machine Learning, Large Language Models, Reinforcement Learning, Causal Inference to join our team at Microsoft Ads India. This role offers a unique opportunity to work on some of the most complex and high-impact challenges in online advertising, where your innovations will directly shape user experience, advertiser success, and the future of the digital advertising ecosystem.\n\nAt Microsoft Ads, you'll be solving web-scale optimization problems, from selecting relevant ads to modeling user interaction with ad content. The models and solutions you develop will impact millions of users daily and drive revenue growth for Microsoft ads and the Microsoft Ads platform. This is a great opportunity for someone passionate about artificial intelligence, optimization at scale, and transformative innovation.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n\n\nDrive AI innovation: Lead the development of cutting-edge models that select and rank ads, predict user interaction, and optimize advertiser outcomes. You will leverage and advance Deep Learning, Reinforcement Learning, Causal Inference, and other techniques to solve complex problems.\nOptimize at scale: Design, build, and deploy models that operate at web scale, ensuring they are robust, scalable, and high performing in real-world settings. You will directly improve user engagement, ad relevance, and advertiser return on.\nPerform large-scale online and offline experiments to continuously optimize and validate model performance, ensuring real-time impact on user and advertiser experiences.\nWork closely with worldwide research, engineers, data scientists, and product teams to integrate your solutions into Microsoft Ads systems, driving cross-team collaboration and delivering impactful end-to-end solutions.\n\n\nQualifications\n\nRequired Qualifications:\n\n\nBachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND relevant internship experience (e.g., statistics, predictive analytics, research)\nOR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field\nOR equivalent experience of 1 - 3 years\nExperience with large-scale models and frameworks such as PyTorch.\nExperience building, deploying, and optimizing large-scale AI/ML models in real-world applications, especially in NLP, Information Retrieval, or Computer Vision.\nPublications in top-tier conferences like NeurIPS, ICML, CVPR, SIGIR, KDD, ACL, EMNLP, ICLR, WWW, WSDM or similar, demonstrating expertise in advancing the field.\n\nOther Requirements\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\n\n\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\n\nPreferred Qualifications\n\n\nPhD in Machine Learning, AI, or related fields.\nExperience working with large language models / multi-billion parameter models, focusing on their efficient training and online inference.\nBackground in developing or modifying deep learning algorithms/architectures to improve computational and memory efficiency.\nExperience in online advertising, search engines, or recommendation systems.\n\n\n#MicrosoftAI\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-and-applied-scientist-at-microsoft-4151372344?position=43&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=oioXeGrEdf%2BfmZo8PJQkJg%3D%3D"
}