{
    "job_id": "4151086859",
    "title": "Business Analyst, Payment Risk Analytics",
    "company": "Amazon",
    "location": "Hyderabad, Telangana, India",
    "description": "Description\n\nJob Description\n\nHave you ever thought about what it takes to detect and prevent fraudulent activity among hundreds of millions of e-commerce transactions across the globe? What would you do to increase trust in an online marketplace where millions of buyers and sellers transact? How would you build systems that evolve over time to proactively identify and neutralize new and emerging fraud threats?\n\nOur mission in Payment Risk is to make Amazon the safest place to transact online. Payment Risk safeguards every financial transaction across all Amazon sites, while striving to ensure that these efforts are transparent to our legitimate customers. As such, Payment Risk designs and builds the software systems, risk models and operational processes that minimize risk and maximize trust in Amazon.com.\n\nAs a Business Analyst in Payment Risk Analytics, you will be responsible for analyzing terabytes of data to identify specific instances of risk, broader risk trends and points of customer friction, developing scalable solutions for prevention. You will work with team members to ensure that the volume being flagged for manual review aligns with available capacity and Service Level Agreements (SLA’s) are met. You will be responsible for building a robust set of operational and business metrics and will utilize metrics to determine improvement opportunities.\n\nResponsibilities\n\n\nUnderstand the various operations across Payment Risk\nDesign and develop highly available dashboards and metrics using SQL and Excel/Tableau\nUnderstand the requirements of stakeholders and map them with the data sources/data warehouse\nOwn the delivery and backup of periodic metrics, dashboards to the leadership team\nDraw inferences and conclusions, and create dashboards and visualizations of processed data, identify trends, anomalies\nExecute high priority (i.e. cross functional, high impact) projects to improve operations performance with the help of Operations Analytics managers\nPerform business analysis and data queries using appropriate tools\nWork closely with internal stakeholders such as business teams, engineering teams, and partner teams and align them with respect to your focus area\nExecute analytical projects and understanding of analytical methods (like ANOVA, Distribution theory, regression, forecasting, Machine Learning Techniques, etc.)\n\n\nKey job responsibilities\n\n\nUnderstand the various operations across Payment Risk\nDesign and develop highly available dashboards and metrics using SQL and Excel/Tableau\nUnderstand the requirements of stakeholders and map them with the data sources/data warehouse\nOwn the delivery and backup of periodic metrics, dashboards to the leadership team\nDraw inferences and conclusions, and create dashboards and visualizations of processed data, identify trends, anomalies\nExecute high priority (i.e. cross functional, high impact) projects to improve operations performance with the help of Operations Analytics managers\nPerform business analysis and data queries using appropriate tools\nWork closely with internal stakeholders such as business teams, engineering teams, and partner teams and align them with respect to your focus area\nExecute analytical projects and understanding of analytical methods (like ANOVA, Distribution theory, regression, forecasting, Machine Learning Techniques, etc.)\n\n\nBasic Qualifications\n\n\n1+ years of tax, finance or a related analytical field experience\n2+ years of complex Excel VBA macros writing experience\nBachelor's degree or equivalent\nExperience defining requirements and using data and metrics to draw business insights\nExperience with SQL or ETL\nExperience with reporting and Data Visualization tools such as Quick Sight / Tableau / Power BI or other BI packages\n\n\nPreferred Qualifications\n\n\nExperience using very large datasets\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI HYD 16 SEZ\n\nJob ID: A2900570\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-payment-risk-analytics-at-amazon-4151086859?position=3&pageNum=27&refId=qUEK%2BRRfTlwms%2BZrzTuWbg%3D%3D&trackingId=f8M%2BPxX18YnNpcOzo8NYqA%3D%3D"
}