{
    "job_id": "4151376870",
    "title": "Senior Business Analyst",
    "company": "Crisil",
    "location": "Mumbai, Maharashtra, India",
    "description": "As a Business Analyst, you will be responsible for:\n\n\nWorking with cross-functional teams to deliver features and significant products\nCreating a blueprint for the product's concept and features, owning the short-term roadmap for MVPs and monthly releases\nPrioritizing continuously in accordance with the understanding and validation of customer problems and needs\nDemonstrating expert level skill in problem decomposition and ability to navigate through ambiguity\nEngaging frequently (80%) with the development team; facilitate discussions, provide clarification, story acceptance and refinement, testing and validation; contributes to design activities and decisions.\nOwning and managing the backlog; continuously order and prioritize to ensure that 1-2 sprints/iterations of backlog are always ready\nMonitoring and measuring each development stage using advanced metrics, understand product performance and make necessary improvements in the product\nCollaborating with UX in design decisions, demonstrating deep understanding of technology stack and impact on final product\nConducting customer and stakeholder interviews and elaborate on personas.\nPartnering with the Service Owner to ensure healthy development process. Lead DevSecOps teams and deliverables as needed.\nBeing regarded as an expert in Agile Methodology; translate unstructured or ambiguous work requests into actionable user stories and work units through problem decomposition and planning.\nDemonstrating superior persuasion and influencing skills that ensure alignment between customer, product manager and engineering team.\nExcelling business acumen, knows latest industry trends and is looked at as an internal expert on the product as well as the associated competitive landscape.\nDefine the product roadmap and drive the product funding decisions.\nBalance user and customer needs, technical considerations, and business viability to develop successful products. Mentoring junior team members\n\n\nTo be successful in this role you will:\n\n\nBachelor’s degree or higher in finance, economics, information technology, business, or a related field.\nA minimum 8 years of professional experience with 5 years of experience as a Business Analyst\nStrong analytical and problem-solving skills, with the ability to think critically and strategically.\nExcellent communication and collaboration skills with various stakeholders.\nProven track record of identifying and improving business processes.\nExperience with Agile methodologies and tools such as Azure DevOps, MS Teams, Miro, and SharePoint.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-crisil-4151376870?position=5&pageNum=55&refId=rCPSt2W60wSZDZdAR5hPHw%3D%3D&trackingId=JlHwuv4EWZu8yl%2FsBglkqA%3D%3D"
}