{
    "job_id": "4151878817",
    "title": "Business Analyst",
    "company": "Persistent Systems",
    "location": "Pune, Maharashtra, India",
    "description": "About Position:\n\n\n\n\nIT Business Analyst with experience in Capital Markets/Investment Banking. The Business Analyst will work in direct relation with financial markets, writing functional specifications, data mapping, data modelling, interacting with teams on architecture choices, development of software, test scripts, testing and participating in go live. Familiar with financial products including derivatives, equities, ETDs, commodities, financing, collateral, options, FX and working in highly challenging environments on strong functional projects. The business analyst will work closely with middle office, settlement, accounting, reporting and reconciliation teams.\n\n\n\n\nRole: Business Analyst\nLocation: Pune, Hyderabad & Bangalore\nExperience: 8+ Years\nJob Type: Full Time Employment\n\n\n\n\nWhat You'll Do:\n\n\n\n\nProven track record of supporting Back Middle Office systems.\nProven experience of developing mutually beneficial relationships with business stake holders’ users' software solution providers and other IT teams.\nProven experience of full involvement in project life cycles within Investment Banking.\nProven experience performing system testing and guiding users with building their functional plans for user testing.\nAbility to handle multiple work streams and assignments simultaneously.\nProven experience of issue resolution through data mining and investigation.\nA broad understanding of Fixed Income Swaps Equity and Futures processing through investment banking experience.\nExperience in liaison with vendors in problem determination and resolution of technical issues.\n\n\n\n\nExpertise You'll Bring:\n\n\n\n\nA professional with a university degree or equivalent.\nPrior coding background experience.\nExcellent technical analysis and investigatory skills.\nAbility to work with both business and IT staff in a pressured environment.\nBusiness analysis within an Agile development project.\nStrong data analysis skills to ensure accurate system data extracts and reconciliations working with large datasets.\nProven track record of writing structured business requirements and functional specifications.\nWorking knowledge of financial instruments: government bonds SAS bonds credit bonds exchange traded bond futures interest rate swaps repos stock lending and equities.\nWell-structured and logical approach to working.\nGood knowledge of Compliance business processes.\nWorking knowledge of Microsoft Project PowerPoint Word Excel SharePoint Jira Service desk Confluence Atlassian Portfolio.\nFamiliarity with MS SQL Server for data analysis purposes.\nFamiliarity with Mongodb (NOSQL) for data analysis purposes.\nFamiliarity with SDLC processes and tooling.\n\n\n\n\nBenefits:\n\n\n\n\nCompetitive salary and benefits package\nCulture focused on talent development with quarterly promotion cycles and company-sponsored higher education and certifications\nOpportunity to work with cutting-edge technologies\nEmployee engagement initiatives such as project parties, flexible work hours, and Long Service awards\nAnnual health check-ups\nInsurance coverage: group term life, personal accident, and Mediclaim hospitalization for self, spouse, two children, and parents\n\n\n\n\nOur company fosters a values-driven and people-centric work environment that enables our employees to:\n\n\n\n\nAccelerate growth, both professionally and personally\nImpact the world in powerful, positive ways, using the latest technologies\nEnjoy collaborative innovation, with diversity and work-life wellbeing at the core\nUnlock global opportunities to work and learn with the industry’s best\n\n\n\n\n\n\n\nLet’s unleash your full potential at Persistent\n\n\n\n\n“Persistent is an Equal Opportunity Employer and prohibits discrimination and harassment of any kind.”\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-persistent-systems-4151878817?position=21&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=AEvvC9e0J%2BN7q9wPilP5xg%3D%3D"
}