{
    "job_id": "4151088179",
    "title": "Business Analyst, Andon Program",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "DESCRIPTION\n\nAmazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience - Amazon.com continues to grow and evolve as a world-class e-commerce platform. Amazon's evolution from Web site to e-commerce partner to development platform is driven by the spirit of innovation that is part of the company's DNA. The world's brightest technology minds come to Amazon.com to research and develop technology that improves the lives of shoppers and sellers around the world. About Retail Business Services (RBS) Amazon.com operates in a virtual, global ecommerce environment without boundaries, and operates a diverse set of businesses in seven countries, including Retail, third party marketplaces, ecommerce platforms, web services for developers. The RBS business group is an integral part of Amazon online product lifecycle and buying operations. The team is designed to ensure Amazon remains competitive in the online retail space with the best price, wide selection and good product information. The team’s primary role is to create and enhance retail selection on the worldwide Amazon online catalog. The tasks handled by this group have a direct impact on customer buying decisions and online user experience. Are you passionate about solving business challenges at a global scale? Amazon is looking for an experienced Business Analyst to join our team and help unlock insights which take our business to the next level. The candidate will be required to solve business problems structurally at scale using data deep dives and insights. The candidate will do this by partnering with key stakeholders (external/internal) to be curious and comfortable digging deep into the business challenges to understand and identify insights that will enable us to figure out standards to improve our ability to globally scale this program. They will be comfortable delivering/presenting these recommended solutions by retrieving and integrating artifacts in a format that is immediately useful to improve the business decision-making process. This role requires an individual with excellent analytical abilities as well as an outstanding business acumen. The candidate knows and values our customers (internal and external) and will work backwards from the customer. They are experts in partnering and earning trust with operations/business leaders to drive these key business decisions.\n\nRoles And Responsibilities:\n\n\nThe candidate will develop various flashes / updates to get insights on various Customer needs to drive opportunities in the business and also drive execution of the business.\nThis will involve working with different teams internally by designing a detailed process flow, identifying impacting variables that lead defects, convert them into business insights, identify DW tables that source all system level information, build a detailed plan from Inflow to resolution in a scalable way, identify root causes and define scalable solutions.\nWork closely with internal product and project teams to design scalable and automation solutions.\nStakeholder Management (Category and Tech teams) – Be a part of weekly performance meetings with stakeholders to develop and ensure data visibility to action plans that meet business plans\nParticipates and provides adequate support in business reviews with mid-level and senior stakeholders\nMetrics Management, Analyzing Trends.\n\n\nKey Performance Areas:\n\n\nBuild scalable solutions through insights / trends / business Views which will impact P0 metrics for the program.\nAnalyze data , highlight gaps, recommend solutions, drive/influence cross -functionality decisions along with the operations and program team.\nUse Tableau/QuickSight and SQL to create dashboards by task, analyze opportunities, identify patterns and implement proactive solutions.\nUse Python & Flask to build a web based application for end users to self-serve through solutions that we build\nIdentify root causes for defects, work with operations/program team to find solutions and Tech teams to work on implementing automation capabilities and identify new opportunities for Automation.\nExcellent Internal/External Stakeholder Management BASIC QUALIFICATIONS Bachelor’s degree or higher in Computer Science, Project Management, Engineering\nUnderstand basic and systematic approaches to manage projects/programs\nExcellent oral and written English skills\nOpen-minded, creative and proactive thinking\nPioneer to invent and make differences\nUnderstanding of customer experience, listening to customers' voice and work backwards to improve business process and operations\n\n\nBasic Qualifications\n\n\nOverall experience of 5-10 years, 3+ years' experience in project management, with proved case of success.\nProfessional Knowledge on SQL/ETL, Macro, VBA knowledge\nMedium to advanced knowledge of Automation using Python/Selenium and other automation scripts\nAdvanced knowledge of SQL, Tableau, QuickSight, Python, Flask Preferred Qualification: Automation Skills with experience (delivered minimum 4 end to end automation programs)\nExperience in Product development cycle.\n\n\nSuccessful candidates will be leaders who can prioritize well, communicate clearly, and have a consistent track record of delivery. This is a highly visible role that requires partnering with Retail and Tech teams. This role requires experience and capability to create and present data for senior executives and align with team’s strategic objectives. Excellent written and verbal communication skills are essential. Candidate should be experienced in working with data to analyze root causes, implementing long term solutions, and leading teams with advanced analytical, mathematical, and quantitative capabilities.\n\nKey job responsibilities\n\n\nBuild scalable solutions through insights / trends / business Views which will impact P0 metrics for the program.\nAnalyze data , highlight gaps, recommend solutions, drive/influence cross -functionality decisions along with the operations and program team.\nUse Tableau/QuickSight and SQL to create dashboards by task, analyze opportunities, identify patterns and implement proactive solutions.\nUse Python & Flask to build a web based application for end users to self-serve through solutions that we build\nIdentify root causes for defects, work with operations/program team to find solutions and Tech teams to work on implementing automation capabilities and identify new opportunities for Automation.\nExcellent Internal/External Stakeholder Management BASIC QUALIFICATIONS Bachelor’s degree or higher in Computer Science, Project Management, Engineering\nUnderstand basic and systematic approaches to manage projects/programs\nExcellent oral and written English skills\nOpen-minded, creative and proactive thinking\nPioneer to invent and make differences\nUnderstanding of customer experience, listening to customers' voice and work backwards to improve business process and operations\n\n\nBASIC QUALIFICATIONS\n\n\n1+ years of tax, finance or a related analytical field experience\n2+ years of complex Excel VBA macros writing experience\nExperience defining requirements and using data and metrics to draw business insights\nExperience with SQL or ETL\n\n\nPREFERRED QUALIFICATIONS\n\n\nExperience working with Tableau\nExperience using very large datasets\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI - BLR 14 SEZ - F07\n\nJob ID: A2900596\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-andon-program-at-amazon-4151088179?position=9&pageNum=87&refId=KM8cdGPQyPT7yvIRKZCULw%3D%3D&trackingId=HseUUMQXDAm6kDZh7ptYRA%3D%3D"
}