{
    "job_id": "4151078064",
    "title": "Business Analyst",
    "company": "Wissen Technology",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Title: Business Analyst\n\nLocation: Bangalore\n\nExperience Level: 5+ years\n\nEmployment Type: Full-time\n\n\n\n\nJob Summary\n\n\n\n\nWe are seeking an experienced and dynamic Business Analyst to join our team. The ideal candidate will have over 4 years of experience in analyzing business needs, gathering requirements, and collaborating with stakeholders to deliver innovative solutions. You will play a critical role in bridging the gap between business and technology, ensuring project success and value delivery.\n\n\n\n\nKey Responsibilities\n\n\n\n\nCollaborate with stakeholders to identify and document business requirements and objectives.\nAnalyze existing business processes, identify areas for improvement, and recommend solutions.\nCreate detailed functional specifications, use cases, and process flow diagrams.\nFacilitate workshops, meetings, and presentations with stakeholders to gather insights and refine requirements.\nWork closely with development teams to ensure technical solutions align with business needs.\nConduct gap analysis, feasibility studies, and cost-benefit analyses for proposed solutions.\nAssist in the design, testing, and deployment of new systems and enhancements.\nManage and prioritize requirements using tools such as JIRA, Confluence, or Trello.\nProvide support during user acceptance testing (UAT) and post-implementation review.\nEnsure compliance with regulatory requirements and company policies.\n\n\n\n\nQualifications and Skills\n\n\n\n\nBachelor’s degree in Business Administration, Computer Science, Information Systems, or a related field.\n5+ years of experience as a Business Analyst, preferably in Banking and Finance domain.\nStrong knowledge of business process modeling and analysis tools.\nProficiency in requirements management tools (e.g., JIRA, Confluence).\nFamiliarity with Agile, Scrum, and Waterfall methodologies.\nExceptional analytical, problem-solving, and decision-making skills.\nExcellent communication and interpersonal skills to interact effectively with stakeholders at all levels.\nExperience with data analysis tools (e.g., Excel, Tableau, Power BI) is a plus.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-wissen-technology-4151078064?position=2&pageNum=10&refId=I3x5Bv9xaOmHYCAjSz8m9w%3D%3D&trackingId=Z%2F1sE6FOT%2F%2BsAmMC6mjycQ%3D%3D"
}