{
    "job_id": "4151890601",
    "title": "Business Analyst",
    "company": "Karix",
    "location": "Greater Bengaluru Area",
    "description": "Job Role: Business Analyst\n\n\n\n\nLocation: Bangalore (WFO)\n\n\n\n\nWhat You'd Do?\n\nStrong expertise in requirements management processes, including standard tools and techniques such as facilitated meetings, use cases, mapping documents, models and other requirements management tools.\nUnderstanding the SOW and Preparing documentations (BRD, FSD, PRD) in conversational product platforms.\nDevelop customer use cases, personas and scenarios and present solutions to clients.\nShould have experience working on Mid to large scale implementations.\nCreate Use Cases Diagrams and Activity Diagrams for the stated work flows communicated by client’s\nWork with the engineering teams to build and deploy solutions with optimal resources.\nTrack the on-going implementation process and intimate the stakeholders for process deviation if any.\nResolve day to day queries from development team based on knowledge of customer business.\nScope and prioritize activities based on business and customer impact.\nProvide input to QA for creation of test plans and certification criteria. Assist and certify the UAT.\nReadiness to travel for short durations within India and outside.\n\n\n\n\nWhat You'd Have?\n\n3-4 years’ experience in defining and managing core products or business applications, either through product management or equivalent activities.\nBachelor’s in engineering or Masters in Computer Applications or tech savvy MBA from good institute.\nWorked in the cross functional environment for coordinating various project related aspects.\nGood knowledge and understanding of products in conversational platforms.\nFollow best practices which is under the guidelines set in CBAP (Good to have)\nUnderstanding of Various builders in NLP, AIML (Good to Have)\nUnderstanding of cloud-based systems along with knowledge of any domain such as Banking, Finance, Healthcare, Web/Social etc.\nExcellent written and verbal communication skills.\nSkilled in presentations and discussions with sales and engineering teams.\n\n\n\n\nWhy Join Us?\n\nAt Karix, we offer more than just a job — we offer an opportunity to make an impact. Here’s what you’ll love about working with us:\n\nChallenging Work: You’ll tackle real-world marketing challenges that ensure no two days are the same.\nCollaborative Culture: Join a team that values creativity, innovation, and collaboration.\nCareer Growth: Gain hands-on experience and expand your skillset in an environment that encourages learning and experimentation.\nDiversity & Inclusion: We celebrate diversity and provide equal opportunities for all, regardless of race, gender, age, or background.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-karix-4151890601?position=6&pageNum=27&refId=qUEK%2BRRfTlwms%2BZrzTuWbg%3D%3D&trackingId=8Zju7h5cszTlSuvaFQVTZA%3D%3D"
}