{
    "job_id": "4151856095",
    "title": "Business Analyst - ThunderHead",
    "company": "Idyllic Services",
    "location": "Pune, Maharashtra, India",
    "description": "Job Title: Business Analyst (Thunderhead)\n\nLocation: Pune/Bangalore\n\nExperience: 6+ years\n\nNotice Period: 30 days\n\n\n\n\nJob Description:\n\nWe are seeking a highly skilled Business Analyst with expertise in Thunderhead and experience in the trade confirmations domain. The ideal candidate will work closely with the technology team to map data from SPR onto trade confirmation templates, ensuring seamless data flow and accuracy.\n\n\n\n\nKey Responsibilities:\n\nAnalyze and document business requirements related to trade confirmations.\nCollaborate with technology teams to map data from SPR onto trade confirmation templates.\nEnsure accurate and efficient generation of trade confirmations using Thunderhead.\nWork with stakeholders to understand and refine business needs, translating them into functional specifications.\nPerform gap analysis and suggest improvements in trade confirmation processes.\nSupport testing efforts by validating trade confirmation templates and ensuring compliance with business rules.\nProvide expertise in Thunderhead configuration, implementation, and troubleshooting.\nEnsure compliance with industry regulations and internal policies in trade confirmation processes.\n\n\n\n\nRequired Skills & Qualifications:\n\n6+ years of experience as a Business Analyst in the financial services domain.\nStrong knowledge of Thunderhead and its application in trade confirmation processes.\nExperience in data mapping from SPR onto trade confirmation templates.\nHands-on experience in trade confirmations and financial instruments.\nAbility to work with technology teams to define and refine business requirements.\nStrong analytical and problem-solving skills.\nExcellent communication and stakeholder management skills.\nExperience working in an Agile environment is a plus.\n\n\n\n\nWhy Join Us?\n\nOpportunity to work with a leading financial services firm.\nCompetitive salary and benefits package.\nDynamic and collaborative work environment.\nCareer growth and learning opportunities in a cutting-edge technology landscape.\n\nIf you meet the above qualifications and are ready to take on an exciting challenge, we encourage you to apply!\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-thunderhead-at-idyllic-services-4151856095?position=2&pageNum=67&refId=6wIEzwS4x6APeTXACdRUdw%3D%3D&trackingId=D6zyKjO1HzcPfkIb%2F8dREg%3D%3D"
}