{
    "job_id": "4151222837",
    "title": "Business Analyst",
    "company": "Quantium",
    "location": "Hyderabad, Telangana, India",
    "description": "Job Type: Permanent - Full Time\n\nLocation: Hyderabad\n\nJob Category: Business Analyst\n\nJob Description\n\n\n\n\nWho is Quantium?\n\nQuantium is a world leader in data science and artificial intelligence. Established in Australia in 2002, Quantium is a global team of more than 1,100 people across 14 locations with a unique blend of capabilities across product and consulting services to help businesses unlock value from data and analytics. Quantium partners with the world’s largest corporations to forge a better, more insightful world.\n\nOur Hyderabad office plays a crucial role in our global operations, working alongside teams in Australia, UK, and US to deliver cutting-edge solutions for our clients.\n\n\n\n\nBusiness Analysis Team\n\nBusiness Analysis team is constantly pushing the boundaries with both the latest technology and market leading analytics as complex metrics are made available to users instantaneously. Q checkout allows users to instantaneously browse actionable insights and make data driven decisions in real time.\n\n\n\n\nWorking with the support of Product and Delivery Managers this role will provide business analysis and testing support to multiple cross-functional agile squads (6 people per squad). This role will shape the future direction of key features within Q checkout to meet substantial growth and revenue targets. This is a unique opportunity to work with a talented team utilising the latest technologies to shape the future of Quantium's flagship product.\n\n\n\n\nHow will you make an impact?\n\nFacilitating user focused workshops that solicit unambiguous user problem statements and valuable product insights.\nArticulate business problems by decomposing them into manageable and structured components.\nDesigning solutions and features that solve business problems and satisfy user needs.\nWork closely with engineers on assessing and recommending feasible solution options to help address key business requirements.\nDocumenting and communicating functional requirements to UX designers, SMEs, analysts and software engineers working in cross functional delivery teams.\nCreating and managing squad’s backlog. Ensuring the backlog is always in healthy state, refined and prioritised.\nLeverage product analytics data to drive decision-making and feature prioritisation.\n\n\n\n\nKey activities\n\nPreparing materials and activities for user focussed workshops and stakeholder interviews.\nRunning user focussed workshops and capturing insights and outcomes.\nWorking with product leads and industry SMEs to design valuable products that solve business needs and problems.\nDecomposing product features into functional requirements, non-functional requirements, business rules, data flows, and constraints.\nWriting fully groomed user stories and defining unambiguous acceptance criteria to define the scope of the functionality.\nWork with engineers on solution design and propose solution recommendation to deliver business objectives efficiently.\nSupporting a product lead with preparing, refining and influencing their product backlog.\nGathering users (internal and external) feedback and combined with usage metrics developing actionable insights.\nSharing product knowledge with the delivery, operation, support and sales teams.\nRegularly communicating\n\n\n\n\nThe Superpowers You’ll Be Bringing To The Team\n\n3+ years of hands-on experience in digital/software projects using Agile methodologies.\nExperience applying business analysis techniques in projects delivering data transformation, business intelligence and reporting.\nConfident with implementation of SDLC (software development lifecycle).\nGood knowledge of application and web development.\nWorks with technical roles (engineers and analysts) to develop or contribute to high level technical specification and solution design.\nExperience working on complex system integrations, understanding & outlining interdependencies and ensuring smooth integration.\nBachelor's degree in Computer Science, Engineering, or related field.\nExcellent written and verbal communication skills with a tenacious, resilient, resourceful and collaborative approach to delivery.\nHigh competency with issue / task management systems (e.g. JIRA) and team collaboration software (e.g. Confluence).\nAbility to engage with internal and external stakeholders at all levels (client side, users, product leads, UI/UX, developers and subject matter experts).\nExperience in data-driven products is a plus.\n\n\n\n\nWhat could your Quantium Experience look like?\n\nWorking at Quantium will allow you to challenge your imagination. You will get to solve complex problems using rigor, precision and by asking great questions – but it also means you can think big, outside the box and push your problem-solving skills to the max.\n\n\n\n\nBy Joining The Quantium Team, You’ll Get To\n\n\n\n\nForge your path: So many of our team have moved around different teams or offices. You’ll be in the driver’s seat, and we empower you to make your career your own.\n\nFind your kind: Embrace diversity and connect with your tribe (think foodies, dog lovers, readers, or runners).\n\nMake an impact: Leave your mark. Your contributions resonate, regardless of your role or rank.\n\n\n\n\nBenefits\n\nOn top of the Quantium Experience, you will enjoy a range of great benefits that go beyond the ordinary. Some of these include:\n\nFlexible work arrangements: Achieve work life balance at your own pace with hybrid and flexible work arrangements.\n\nContinuous learning: Our vision is empowering analytics talent to thrive. The Analytics Community fosters the development of individuals, thought leadership and technical excellence at Quantium through building strong connections, fostering collaboration, and co-creation of best practice.\n\nRemote working: Embrace the opportunity to work outside of your assigned home location for up to 2 months every year.\n\n\n\n\nQuantium’s recruitment process involves the collection and use of personal information. Please click on the link “Privacy” for Quantium’s Collection Notice. This provides information on how we collect, use & store your personal information, including potential disclosure to our majority shareholder, Woolworths Group Limited.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-quantium-4151222837?position=10&pageNum=17&refId=otcMTVij75x3rORf5Q9zLA%3D%3D&trackingId=JbLvNoFtXtx0XPN3cHhHyg%3D%3D"
}