{
    "job_id": "4151962106",
    "title": "Business Analyst",
    "company": "Wipro",
    "location": "Pune, Maharashtra, India",
    "description": "Location: Pune, Kolkata, Bengaluru\n\n-Senior Business Analyst with Prior knowledge and experience in OSS/BSS (including CRM and Billing) with minimum 14+ years of experience\n\n-Able to elicit requirements from business and write business stories with clarity.\n\n-Define Acceptance criteria and other DoD\n\n-Conduct and drive workshops, capture notes and agree/disagree with stakeholders\n\n-Anchor complex solution discussions liaising with architects, SMEs and Technical Product Owners\n\n-Initiate and anchor the cross-domain meetings scheduled with architects to streamline and identify dependencies\n\n-Contribute towards sprint and capacity planning\n\n-Hands on experience in eTOM process and levels; Hand on experience in Drafting telco process\n\n-Strong exposure to and experience in Jira and confluence.\n\n-Strong communications skills and have prior experience in customer facing and handling. Unambiguous, precise, and accurate documentation of Features, BUSs, Meeting notes, processes and any related artefacts.\n\n-Able to lead a team size of 8 to 10 associates\n\n-Oversee and ensure following activities from his Business Analysis team –\n\n-Demo the stories to business TPO/ Wipro Leads\n\n-Own the train the trainer content and meetings.\n\n-Coordinate with development and E2E testing in analysing defects , fixing demo review comments\n\n-Label stories in JIRA based on progress, continuously update stories in JIRA based on each step in development\n\n-Walk through requirements with the squad team consisting of developers, component designers and testers and address their queries.\n\n-Review test cases and ensure compliance with requirements\n\n-Identify and remove impediments proactively, able to resolve conflicts between different stakeholders such as Architects / BAs / Business Community\n\n-Able to visualize the strategic objectives of the Program and give direction to roadmap planning\n\n-Work with customer side stakeholders and enterprise architects to align to Program roadmap and objective\n\n-Highlight Risks or existing Issues upfront to the program management, with proposed mitigation plan and action\n\n-Align and distribute work amongst different BAs working on different streams and processes, and ensure regular alignment and dependency resolution between them\n\n-Can propose and experiment with fresh ideas, bringing in improvements in Velocity and Quality\n\n-Groom the junior BAs within the team to take up larger complex subjects and be at the forefront of requirement workshop\n\n-Experienced in below skills -\n\nManaging stakeholders, their priorities and inter dependent conflicts\nManaging and prioritizing the product backlog\nCollaborating with cross-functional streams\nAttending and participating in Scrum events\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-wipro-4151962106?position=12&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=R2svwZCKpK9G5AJYR0FZrg%3D%3D"
}