{
    "job_id": "4151415769",
    "title": "Payments Business Analyst",
    "company": "Cognizant",
    "location": "Chennai, Tamil Nadu, India",
    "description": "Role: Payments Business Analyst.\n\nExperience: 4 years to 8 years\n\nWork Location: Bangalore\n\n\nHands on experience with GPP Fusion / GPP SP product processor\nKnowledge of database structure of GPP Classic/Fusion/SP\nWorking knowledge around Payment schemes – SWIFT MT, ISO20022\nExperience with SQL and other data profiling tools and techniques.\nExcellent analytical and problem-solving skills.\nExperience with Office 365 and collaboration tools\nStrong written and verbal communication skills\nAbility to multi-task and be flexible.\nAbility to work independently or within a team for problem resolution.\nDetail-orientated.\nAbility to interface effectively with all levels of the organization.\nAbility to express complex technical concepts in business terms.\nGood to have – knowledge of Japanese Domestic Clearing system and working.\n\n\nPosition details\n\n\nGather and understand business requirements based on the requirement walk-through / BRD and workshops.\nHands-on experience in requirements life cycle management in banking and financial domain. Manage the requirements from inception to implementation.\nPerform impact assessment on existing processes/functions based on new requirements/changes.\nEnsure the business requirements, and proposed solutions, achieve the business’ goals.\nCollaborating with technical SMEs, come up with estimation for the new requirements.\nWork with the product owners to provide grooming sessions to the development team if needed on requirements.\nBuild strong relationship / rapport with cross-functional teams and key stakeholders.\nAbility to communicate complex technology concepts to a non-technology audience.\nBe part of the by closely working with Scrum masters and squad members to deliver quality end-to-end solution, including reviewing of other interface functional specifications and external parties’ specifications.\nEvery solution that is designed must be scalable and global in nature.\nMaximize re-usability of solution provided for every requirement.\nReview test scenarios to ensure there is comprehensive coverage by the testing team.\nPerform random functional testing to ensure deliverables are in line with the requirements.\nWork closely with business and country stakeholders for end-to-end system implementation and post-live support.\nBasic SQL knowledge to query database and familiarity with Oracle DB concepts and GPP Fusion database structure.\nEnd-to-end working knowledge in Transaction Banking / Payments / Channels areas.\nWorking knowledge around Payment schemes – SWIFT MT, ISO20022\nExpertise in Payments processing Product - Fundtech/Finastra Global Payplus (GPP) Fusion\n\n\nJob Summary\n\nWe are seeking a Sr. Consultant with 12 to 16 years of experience in Business Analysis and Planning Automation and Networks. This role involves working in a hybrid model with day shifts. The ideal candidate will leverage their expertise to drive impactful business solutions and contribute to the companys success.\n\nResponsibilities\n\n\nLead business analysis and planning activities to identify key business needs and develop strategic solutions.\nOversee the automation of business processes to improve efficiency and reduce manual effort.\nProvide expert insights into network domain to ensure robust and scalable network solutions.\nCollaborate with cross-functional teams to gather and analyze business requirements.\nDevelop detailed project plans and timelines to ensure successful project delivery.\nConduct regular reviews and assessments of business processes to identify areas for improvement.\nImplement best practices in business analysis and automation to drive continuous improvement.\nFacilitate workshops and meetings to gather requirements and present findings to stakeholders.\nEnsure all solutions align with the companys strategic goals and objectives.\nMonitor and report on project progress to senior management and stakeholders.\nProvide training and support to team members on business analysis and automation tools and techniques.\nStay updated with the latest trends and advancements in business analysis automation and network domains.\nContribute to the development of business strategies and plans to achieve long-term organizational goals.\n\n\nQualifications\n\n\nPossess a strong background in business analysis and planning with at least 12 years of experience.\nDemonstrate expertise in automation techniques and tools to streamline business processes.\nHave in-depth knowledge of network domain and its application in business solutions.\nExhibit excellent communication and collaboration skills to work effectively with cross-functional teams.\nShow proficiency in project management and the ability to develop detailed project plans.\nDisplay strong analytical skills to identify business needs and develop strategic solutions.\nHave experience in conducting workshops and presenting findings to stakeholders.\nBe committed to continuous learning and staying updated with industry trends.\nDemonstrate the ability to train and support team members in business analysis and automation.\nShow a proven track record of successful project delivery and process improvement.\nPossess strong problem-solving skills and the ability to think critically.\nExhibit a proactive approach to identifying and addressing business challenges.\nHave a strong understanding of the companys strategic goals and how to align solutions accordingly.\n\n\nCertifications Required\n\nCertified Business Analysis Professional (CBAP) Automation Anywhere Certified Advanced RPA Professional\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/payments-business-analyst-at-cognizant-4151415769?position=6&pageNum=72&refId=Mz5LEAf7jSU4t3WBJ4sgJQ%3D%3D&trackingId=DZ7YWzSWD4G5GYAq0NZxNg%3D%3D"
}