{
    "job_id": "4151875974",
    "title": "Data Scientist",
    "company": "Quantzig",
    "location": "Bangalore Urban, Karnataka, India",
    "description": "Job Title: Data Scientist\n\nExperience Level: 3-5 years\n\nJob Type: Full-time\n\nJob Description:\n\nWe are seeking a highly skilled and experienced Data Scientist to join our dynamic team. The ideal candidate will have 3-5 years of proven experience in data science, with a strong background in Python programming, Git, and SQL. The candidate must possess expertise in object-oriented programming (OOP) concepts and classes using Python and demonstrate proficiency in Azure Machine Learning. Additionally, PowerBI skills are considered a plus.\n\n\n\n\nResponsibilities:\n\nDevelop and implement machine learning models for predictive and prescriptive analytics.\nCollaborate with cross-functional teams to understand business requirements and translate them into data-driven solutions.\nUtilize Python, Git, and SQL to clean, preprocess, and analyze large datasets.\nApply statistical methods and machine learning algorithms to extract meaningful insights and patterns from data.\nImplement and maintain scalable data pipelines for data processing and model training.\nStay abreast of industry trends and emerging technologies to continuously enhance the data science capabilities within the organization.\nPresent findings and insights to non-technical stakeholders in a clear and understandable manner.\nProficient in SQL for data extraction and manipulation.\nApply machine learning techniques, both supervised and unsupervised, for data analysis and modeling.\nDemonstrate proficiency in forecasting techniques to support decision-making processes.\nExpertise in Gen AI\nStrong proficiency in Excel and PowerPoint for effective communication and presentation of analytical findings.\n\n\n\n\nRequirements:\n\n\n\n\nBachelor's or Master's degree in Computer Science, Statistics, Mathematics, or a related field.\n4-6 years of hands-on experience in data science and analytics.\nStrong programming skills in Python with a focus on OOP principles and classes.\nProficiency in version control systems, especially Git.\nSolid experience with SQL for data manipulation and extraction.\nExpertise in Azure Machine Learning for model development and deployment.\nExcellent problem-solving skills and a keen attention to detail.\nEffective communication skills to convey complex concepts to both technical and non-technical stakeholders.\n\n\n\n\nPreferred Qualifications (Good to Have):\n\nExperience with PowerBI for data visualization and reporting.\nFamiliarity with other cloud platforms such as Azure\nKnowledge of advanced statistical techniques and tools.\nStrong understanding of data privacy and security best practices.\n\n\n\n\nIncase of any further queries, kindly reach out to ramyasrik@quantzig.com\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-quantzig-4151875974?position=9&pageNum=17&refId=rr4SH1GbEVcdwcmKQOXfGg%3D%3D&trackingId=nJeSgDQ92TOFrxgjgyYwbg%3D%3D"
}