{
    "job_id": "4151668093",
    "title": "Data Scientist - Periscope",
    "company": "McKinsey & Company",
    "location": "Bengaluru, Karnataka, India",
    "description": "Who You'll Work With\n\nYou will be based in one of our offices in Bengaluru or Gurugram as part of our Growth, Marketing & Sales practice.\n\nThe Growth, Marketing & Sales practice strives to help client in both consumer and business-to-business environments on a wide variety of marketing and sales topics. The mission of this practice is to help clients achieve marketing-driven profit growth. Our clients benefit from our experience in core areas of marketing such as customer insights, marketing ROI, digital marketing, CLM pricing, and sales and channel management.\n\nYour Impact\n\nYou are a highly collaborative individual and enjoy solving problems that focus on adding business value. You have a sense of ownership and enjoy hands-on technical work. Our values resonate with yours.\n\nCollaboration with business stakeholders, engineers, and internal teams to build and implement extraordinary retail-focused data products (reusable assets) and solutions and delivering them right to the client will be of utmost importance.\n\nYou will also be responsible for developing deep Retail domain understanding in at least one of the following areas – Customer Analytics, Pricing Optimization, Inventory Management, E-commerce, or Digital Transformation.\n\nYou will have a chance to work with teams on cutting edge Generative AI and Advanced AI initiatives solving customer, marketing & sales and pricing use-cases.\n\nOther Key Responsibilities Will Include\n\n\nBuild real-world scalable machine learning pipelines and deploy them to production\nOperate at the intersection of data science and software engineering to create analytics solutions\nProduce high-quality code that allows us to put solutions into production\nAutomate ML workflows and deploy models into production environments\nLead the thinking on choosing and using the right analytical libraries, programming languages, and frameworks\nBuild analytics libraries and tooling based on project experience and the latest research, refactor code into reusable libraries, APIs, and tools\nDevelop and execute comprehensive QA tests for data science pipelines\nAutomate testing processes to improve efficiency and consistency\nPlay an active role in leading team meetings and workshops to inform product development and process evolution\n\n\nWhat You’ll Learn\n\n\nSuccessful projections on real-world problems across Retail use cases are achieved by referencing past deliveries of end-to-end pipelines.\nBuild products alongside the Core engineering team and evolve the engineering process to scale with data, handling complex problems and advanced client situations.\nBe focused on the wrangling, clean-up, and transformation of data by working alongside the Data Science team which focuses on modeling the data.\nUsing new technologies and problem-solving skills in a multicultural and creative environment.\n\n\nYou will work on the frameworks and libraries that our teams of Data Scientists and Data Engineers use to progress from data to impact. You will guide global companies through data science solutions to transform their businesses and enhance performance across industries including E-commerce, Grocery, F&B, and CPG.\n\n\nReal-World Impact – We provide unique learning and development opportunities.\nFusing Tech & Leadership – We work with the latest technologies and methodologies and offer first-class learning programs at all levels.\nMultidisciplinary Teamwork - Our teams include data scientists, engineers, project managers, UX, and visual designers who work collaboratively to enhance performance.\nInnovative Work Culture – Creativity, insight, and passion come from being balanced. We cultivate a modern work environment through an emphasis on wellness, insightful talks, and training sessions.\nStriving for Diversity – With a multicultural team representing diverse nationalities, we recognize the benefits of working with people from all walks of life.\n\n\nYour Qualifications and Skills\n\n\nBachelor’s degree in computer science, engineering, or mathematics, or equivalent experience\n3+ years of relevant experience with strong foundations of statistics and machine learning techniques\nStrong understanding of machine learning algorithms, model training, validation, and deployment; proficiency in popular ML frameworks such as TensorFlow, PyTorch, and scikit-learn\nProven experience writing production-grade code (Python / PySpark) for machine learning in a professional setting and building scalable machine learning pipelines\nProficiency in software development practices, version control (e.g., Git), CI/CD pipelines, containerization (Docker), and orchestration tools (Kubernetes)\nFamiliarity with cloud platforms (AWS, GCP, Azure, Databricks) and infrastructure as code (Terraform, CloudFormation)\nFamiliarity or hands-on experience with data preprocessing, feature engineering, and building scalable data pipelines using tools like Spark, Kafka, and ETL processes. Knowledge of database management (SQL, NoSQL) and data warehousing solutions\nFamiliarity or hands-on experience with data visualization tools (PowerBI, Tableau, etc)\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-periscope-at-mckinsey-company-4151668093?position=3&pageNum=15&refId=YOJOA8ecJcY65rMZmx6Etg%3D%3D&trackingId=4Y9fhVa1TX%2BpXGNGNL%2FJnQ%3D%3D"
}