{
    "job_id": "4151337107",
    "title": "Business Analyst",
    "company": "CSM Technologies",
    "location": "Patna, Bihar, India",
    "description": "CSM Technologies is looking for Qualified Business Analyst having relevant experience in IT Project Delivery & Project Implementation activities. The candidate should have exposure to Software Development/Testing and should be smart and have excellent communication skills. She/He needs to involve in Requirement Gathering, Client Interaction, Presentation and Analytical Report Preparation. Candidates having exposure to e-Governance are preferred.\n\n\n\n\nExperience: 6-8 years\n\nQualification: B.E/B.Tech/MCA\n\n\n\n\n\n\n\nJob Profile:\n\nUnderstand customer requirements and communicate development team with proper documentation.\nMaintain detailed application and domain knowledge to support technical teams, as appropriate Client and Stakeholder Interfacing.\nInvolve in preparation of SRS, FRS after system study.\nManage the Change Requests and Scope during project development and implementation Work closely with Project Manager and Project Leads & do functional impact analysis\nConduct project training and UAT at client place.\nInvolve in additional requirements study at client and MOM preparations of meetings at Client site. Ensure successful implementation of projects.\nSupport in Hosting, Server and other IT Infrastructure deployed for the Project.\nCo-ordinate with ITS and arrange necessary IT Infrastructure during training and demo of project(As per Agreement).\nCo-ordinate with ITS and Communication (Mail/Letter) to Client during hosting/migration of application in the Data Center.\n\n\n\n\nCandidate Profile:\n\nCandidate should have working knowledge on handling Govt. Clients.\nCandidate should have experience in documentation like (BRD/SRS/FRD/FRS)\nCandidate should have exposure to Software Development/Testing.\nCandidate should have good exposure to client interaction.\nShould have very good communication & interpersonal skill.\nCandidate must be smart & should have good presentation skill.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-csm-technologies-4151337107?position=1&pageNum=55&refId=rCPSt2W60wSZDZdAR5hPHw%3D%3D&trackingId=D8thOb6h%2FKv1ln%2FCSlXTmQ%3D%3D"
}