{
    "job_id": "4152082132",
    "title": "Business Analyst",
    "company": "Gallagher",
    "location": "Chandigarh, Chandigarh, India",
    "description": "Introduction\n\nWe believe that every candidate brings something special to the table, including you! So, even if you feel that you’re close but not an exact match, we encourage you to apply. We’d be thrilled to receive applications from exceptional individuals like yourself.\n\nGallagher, a global industry leader in insurance, risk management, and consulting services, boasts a team of over 50,000 professionals worldwide. Our culture, known as \"The Gallagher Way,\" is driven by shared values and a passion for excellence. At the heart of our global operations, the Gallagher Center of Excellence (GCoE) in India, founded in 2006, upholds the values of quality, innovation, and teamwork. With 10,000+ professionals across five India locations, GCoE is where knowledge-driven individuals make a significant impact and build rewarding, long-term careers.\n\nOverview\n\nWorking closely with clients and colleagues, the Business Analyst Health and Welfare plays a key role in the examination of business and functional/ system requirements to ensure the Health and Welfare system implementation and maintenance activities meet the established standards of quality as well as reliability, usability and performance. You will be responsible to ensure that the system solution in place reflects client’s benefits.\n\nHow You'll Make An Impact\n\n\nBe aware of projects and their particularities, develop test scenarios, perform various quality assurance tests and ensure that systems respond effectively\nEnsure the quality, the follow-up and the respect of the phases of test schedules, of the various tests\nCarry on with post-implementation follow-ups to ensure stability and if need, collaborate with the stakeholders to prioritize and to follow-ups on the patches\nIdentify situations that may significantly affect the quality of deliverables, provide feedback to stakeholders and ensure that appropriate corrective actions are taken\nParticipate in the planning, organization and follow-up of projects deliveries so that the various quality assurance, implementation and experimentation tests respect the commitments\nIdentify opportunities to purchase, propose and recommend solutions to optimize and evolve processes and work methods\nReview Business Requirements & System Specifications of client’s proposed solution Health and Welfare plan configuration, web set up, data conversion, payroll interface, carrier feeds, premium Billing etc.)\nExecute configuration of the system through parameters\nDevelop and review test plans and expected results\nTest system functionality and document results\nAttend, participate and contribute to team meeting and client meeting\nWork closely with the H&W Team Lead on communicating project progress and delivery\n\n\nAbout You\n\n\nPost-secondary education, bachelor’s degree in Information Systems or Computer Science is preferred\nIndustry specific certifications\nMinimum of 1-2 years of experience in a similar role\nBachelor’s degree in Business Administration, Mathematics, Finance, Statistics, Technology\nKnowledge of Health and Welfare plans\nKnowledge of automated testing tool (implement and use) and Project and Test Management Tools\nKnowledge of tools, concepts and methodologies of QA\nFacility to handle and manage multiple tasks simultaneously\nAbility to commit to deadlines and deliver on a timely manner\nCapability to take ownership and be accountable for assigned tasks\nExcel working in a fast-paced, deadline-oriented project team environment\nDemonstrate high problem solving and analytical skills\nExcellent oral and written communication skills to share concepts and information to teammates and clients\nClient satisfaction focus along with team-oriented work style\nEnjoy system analysis/implementation/documentation/testing/programming\nProficient with Microsoft Word, Excel, and Access\nKnowledge of SQL, VB\n\n\nAdditional Information\n\nWe value inclusion and diversity\n\nInclusion and diversity (I&D) is a core part of our business, and it’s embedded into the fabric of our organization. For more than 95 years, Gallagher has led with a commitment to sustainability and to support the communities where we live and work.\n\nGallagher embraces our employees’ diverse identities, experiences and talents, allowing us to better serve our clients and communities. We see inclusion as a conscious commitment and diversity as a vital strength. By embracing diversity in all its forms, we live out The Gallagher Way to its fullest.\n\nGallagher believes that all persons are entitled to equal employment opportunity and prohibits any form of discrimination by its managers, employees, vendors or customers based on race, color, religion, creed, gender (including pregnancy status), sexual orientation, gender identity (which includes transgender and other gender non-conforming individuals), gender expression, hair expression, marital status, parental status, age, national origin, ancestry, disability, medical condition, genetic information, veteran or military status, citizenship status, or any other characteristic protected (herein referred to as “protected characteristics”) by applicable federal, state, or local laws.\n\nEqual employment opportunity will be extended in all aspects of the employer-employee relationship, including, but not limited to, recruitment, hiring, training, promotion, transfer, demotion, compensation, benefits, layoff, and termination. In addition, Gallagher will make reasonable accommodations to known physical or mental limitations of an otherwise qualified person with a disability, unless the accommodation would impose an undue hardship on the operation of our business.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-gallagher-4152082132?position=4&pageNum=77&refId=x7m7XCf9mecSRbX%2FzrmwDg%3D%3D&trackingId=69aKo7u0qx4FUVk8onpFJw%3D%3D"
}