{
    "job_id": "4152378816",
    "title": "eCommerce Business Program Analyst",
    "company": "vidaXL",
    "location": "Hyderabad, Telangana, India",
    "description": "ORGANIZATIONAL POSITION\n\nReports directly to: Manager Commercial Projects\n\nSpan of control: The Business Analyst eCommerce is responsible for the coordination and completion of business cases on time, with defined solution-oriented changes, scope and budget to improve our eCommerce domain's overall efficiency, including process optimization, cost reduction, identifying business opportunities. He/She operates within the Commercial Department, which includes teams such as marketing, content, b2b, sales channels, CS.\n\n\n\n\nPURPOSE OF THE JOB\n\nThe Business Analyst eCommerce makes solution-oriented changes within our Commercial Department. He/She accomplishes this through research-gathering and data analysis, collaborating with our cross-domain teams, presenting a range of data-driven solutions to ensure all aspects of a business case are compatible, so our Project Managers can easily implement these solutions and optimisations after the business case is approved by higher management. The Business Analyst aligns with the Manager Commercial Projects as well as Lead PO regarding business case progress and impediments on a weekly base and escalates when research falls behind on schedule. Lastly, he/she supports the project manager with the performance of rolled out projects, to ensure critical and efficient assessments on all projects in eCommerce.\n\n\n\n\nTASKS\n\nMake changes in the eCommerce department, translated into business cases\n\nResearch, analyze and prepare business cases for initial projects.\n\nConduct market-research in available tools if a new feature is desired and/or how competitors do this\n\nIdentify business solutions by being aware of existing eCommerce technology platforms and emerging technologies to determine potential outcomes to achieve through current applications and new offerings.\n\nDevelop innovative solutions for operational and strategic changes\n\nBe proficient in inventing processes or systems needed to implement changes.\n\nWork with colleagues and stakeholders to gain an in-depth understanding of critical business requirements\n\nStrong communication and interpersonal skills to interact with senior-level management regarding the implementation of changes. Sound knowledge and expertise in evaluating the implications of changes. Competence in writing reports and making presentations to highlight the effect of changes to make.\n\nAlign and inform stakeholders on new ideas and business cases\n\nForecast impact and share regular reports on new solutions and business cases\n\nPerforms critical and efficient assessments on all projects in Ecommerce\n\nAlign with Product Owners on development resources needed for each solution\n\nBe capable of assessing inputs from stakeholders, analyzing a situation, and selecting the right plan of action.\n\nPlan the scope of a project and directing a workforce, to forecasting budgets and managing change requests.\n\nConducting tests, surveys, and workshops\n\nEDUCATION AND EXPERIENCE REQUIREMENTS\n\nUniversity level\nMinimum 4-7 years of relevant work experience\nAble to show track-record in change management in an agile company\nAbility to quickly learn and work with the new systems and software\nFluent in English\n\nCOMPETENCIES\n\nThe ideal candidate is someone with an interest in problem-solving, strategic planning, and improving business processes and systems. He/She can work on multiple different business cases, collaborate with cross-functional teams, and has a direct impact on the success of our Commercial Department. He/She is a multitasker, having an interdisciplinary role by collaborating with high-level with management, as well as can focus on details to define business cases. He/She should feel comfortable working independently with minimal supervision in a fast-paced digital/e-commerce environment. In this position, he/she will be part of the Commercial department and be responsible for a subset of business cases that contribute directly to the company goals.\n\nSKILLS\n\nTeamwork\nData analysis skills\nProblem-solving skills\nKnowledge of business analysis process\nCommunication skills\nReport making\nTechnical skills\nAnalytical skills\nDecision-making capabilities\nManagerial skills\n\n\n\n\n4 levels – HRM force:\n\n1. Beginner: Shows basic effective behavior or does not show effective behavior until the\n\ncircumstances demand it.\n\n2. Operational: Conscious and task-oriented interpretation of the end of functioning.\n\n3. Tactical: Consciously and result-oriented interpretation of own performance and\n\nconnecting function between the organization\n\n4. Strategic: Consciously target- or effect-oriented interpretation and development of one's own\n\nfunctioning and professionalism and cooperation of organizations.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/ecommerce-business-program-analyst-at-vidaxl-4152378816?position=4&pageNum=72&refId=Mz5LEAf7jSU4t3WBJ4sgJQ%3D%3D&trackingId=6FEDBzSzSAWVv6NzkcllNw%3D%3D"
}