{
    "job_id": "4152751559",
    "title": "Data Scientist",
    "company": "Artefact",
    "location": "Pune, Maharashtra, India",
    "description": "Job Title – MMM Data Scientist\n\n\n\n\nRequired skills:\n\nExperience with a programming language, such as Python;\n\nExperience with SQL and building data pipelines;\n\nStrong understanding of machine learning: you should be familiar with the process (data collection, training, evaluation, and making iterative improvements) of building effective learning systems;\n\nGood level in maths: linear algebra, calculus, statistics, smoothing, nonlinear optimizations;\n\nGood level of English (communication, presentation in English and writing);\n\nBachelor’s degree in maths, statistics, computer science is a plus\n\nExperience with Bayesian modelling is a plus\n\nExperience in quantitative marketing is a plus\n\n\n\n\nProject Description: MMM Meridian Pilot\n\nWe are looking for a skilled data scientist with experience in Marketing Mix Modelling (MMM) to join our team. In this role, you will leverage and continuously improve our working MMM pipeline to deliver marketing measurement insights for our clients in the fast-moving consumer goods (FMCG) sector.\n\nKey Responsibilities:\n\nPipeline Management & Improvement: Utilise our existing MMM pipeline to deliver actionable marketing measurement insights. Continuously optimise and enhance the pipeline to improve performance and accuracy.\n\nChannel Coverage: Work across all marketing channels (e.g., TV, digital, social media, print) to ensure comprehensive analysis and insights.\n\nAutomation & Customisation: Develop automated processes and build custom models to streamline the workflow, increasing efficiency and accuracy in MMM projects.\n\nCollaboration: Collaborate closely with our internal data science team, the client’s analytics team, and product teams to ensure alignment on goals and deliverables.\n\nClient Interaction: Participate in client-facing discussions and presentations, supported by senior team members, to provide insights and answer technical questions.\n\nTechnical Requirements:\n\nProficiency in Python, with strong skills in Pandas, Numpyro, and Pandera for data manipulation and statistical modelling.\n\nAbility to collaborate in a dynamic, multi-disciplinary environment with both technical and non-technical stakeholders.\n\nPreferred Qualifications:\n\nExperience in developing and maintaining Marketing Mix Models.\n\nExperience in probabilistic programming.\n\nExperience in Bayesian modelling.\n\nExperience working with FMCG clients.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-artefact-4152751559?position=3&pageNum=10&refId=3OwYoZiMWUBkemlaz%2FA01Q%3D%3D&trackingId=iwx5%2BPco7M4jSyfu6RrLDQ%3D%3D"
}