{
    "job_id": "4152291896",
    "title": "Machine Learning Engineer",
    "company": "Coursera",
    "location": "India",
    "description": "Launched in 2012 by two Stanford professors, Andrew Ng and Daphne Koller, Coursera is now one of the largest online learning platforms in the world, with 168 million registered learners. Our mission is to provide universal access to world-class learning. We partner with over 350 leading university and industry partners to offer a broad catalog of content and credentials, including courses, Specializations and Professional Certificates degrees. Institutions around the world use Coursera to upskill and reskill their employees, citizens, and students in fields such as GenAI, data science, technology, and business. Coursera is a Delaware public benefit corporation and a B Corp.\n\nJoin us in our mission to create a world where anyone, anywhere can transform their life through access to education. We're seeking talented individuals who share our passion and drive to revolutionize the way the world learns.\n\nAt Coursera, we are committed to building a globally diverse team and are thrilled to extend employment opportunities to individuals in any country where we have a legal entity. We require candidates to possess eligible working rights and have a compatible timezone overlap with their team to facilitate seamless collaboration.\n\nCoursera has a commitment to enabling flexibility and workspace choices for employees. Our interviews and onboarding are entirely virtual, providing a smooth and efficient experience for our candidates. As an employee, we enable you to select your main way of working, whether it's from home, one of our offices or hubs, or a co-working space near you.\n\nJob Overview:\n\nAt Coursera, our Machine Learning team plays a crucial role in shaping the future of education through cutting-edge AI technologies such as natural language processing, computer vision, and generative models. We are dedicated to defining, developing, and launching models that drive content discovery, personalized learning, machine translation, skill tagging, and machine-assisted teaching and grading. Our vision is centered on creating a next-generation education experience that is personalized, accessible, and efficient. Leveraging our scale, extensive data, advanced technology, and talented team, Coursera is poised to transform this vision into reality.\n\nResponsibilities:\n\n\nWork very closely with ML scientists and help them with model deployment in the production systems\nWork very closely with ML scientists to find and solve engineering pain-points by building scalable, general-use platforms\nBuild scalable and reliable infrastructure and pipelines for data/feature processing and storage and also scalable training and evaluation infrastructure and pipelines to accelerate model development\nAutomate ML workflows to enhance productivity across training, evaluation, testing, and results generation\nPartner with cross functional stakeholders to define a long-term vision for scaling ML/AI applications in production and help teams with their roadmap plannings\n\n\nBasic Qualifications:\n\n\nBS in Computer Science, or related area with 3 Years minimum Machine Learning Scientist or Engineer industry experience\nHighly skilled with Java development, Python and SQL/MySQL.\nHighly skilled with proficiency in ML ops with experience in building large-scale ML applications, services, pipelines and architecture\nSolid understanding and experience in system design of ML systems (design pattern, OOD, architecture, modules, interfaces, etc)\nHighly skilled with distributed processing architecture and ML/data workflow management platform (Spark, Databricks, Airflow, Kubeflow, MLflow etc)\nExperience with containerization such as Docker and Kubernates\n\n\nPreferred Qualifications:\n\n\nMS in Computer Science, or related area with 1 Years minimum Machine Learning Engineer industry experience or Ph.D in in Computer Science, or related area\nUnderstanding in machine learning theory and practice, and experience using machine learning tools (Scikit-Learn, TensorFlow, PyTorch etc.)\nUnderstanding and experience working with cloud-based solutions, especially AWS, Databricks\nExperience with CI/CD pipelines, integrated tests and test-driven development\nExperience with microservice architectures such as RESTful web-services\n\n\nIf this opportunity interests you, you might like these courses on Coursera:\n\n\nMachine Learning Engineering for Production (MLOps) Specialization\nComputer Vision for Engineering and Science Specialization\nNatural Language Processing Specialization\n\n\nCoursera is an Equal Employment Opportunity Employer and considers all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, age, marital status, national origin, protected veteran status, disability, or any other legally protected class.\n\nIf you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, please contact us at accommodations@coursera.org.\n\nFor California Candidates, please review our CCPA Applicant Notice here.\n\nFor our Global Candidates, please review our GDPR Recruitment Notice here.\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/machine-learning-engineer-at-coursera-4152291896?position=8&pageNum=22&refId=Q8Kf9AiV%2Bqa0LUasfvZQ2A%3D%3D&trackingId=1k85XYzrQq2Y%2BOd5q8RYBg%3D%3D"
}