{
    "job_id": "4152831057",
    "title": "Business Analyst",
    "company": "Brillio",
    "location": "Bengaluru, Karnataka, India",
    "description": "Experience 8+ Years\n\nClient Consultation: Collaborate with clients to understand their business objectives and marketing strategies, identifying opportunities to leverage AEM for enhancing digital experiences.\n\n\n\n\nSolution Design & Implementation: Work alongside technical teams to create and implement\n\nAEM- based solutions that meet clients' needs, including content management, digital asset management, personalization, and e-commerce integrations.\n\nRequirement Gathering & Analysis: Lead workshops and discussions with business stakeholders to gather detailed functional and non-functional requirements.\n\nBusiness Process Mapping: Map business requirements to AEM capabilities, recommending best practices and optimizing workflows to ensure efficiency and scalability.\n\nStrategy Development: Assist in developing digital transformation strategies for clients, ensuring AEM aligns with their broader business and marketing goals.\n\nStakeholder Management: Communicate effectively with both technical and non-technical stakeholders, ensuring all parties are aligned and informed throughout the project lifecycle. Training & Support: Provide training and support to clients, empowering them to effectively use AEM and maximize its potential post-implementation.\n\nQuality Assurance: Review and test AEM implementations to ensure they meet business requirements and deliver high-quality results.\n\nContinuous Improvement: Stay updated with the latest AEM features and Adobe Marketing Cloud innovations, advising clients on how to leverage new capabilities to enhance their digital experiences.\n\n\n\n\nSkills & Expertise:\n\nStrong proficiency in AEM components, such as Sites, Assets, Forms, and Commerce.\n\nExperience with Adobe Marketing Cloud and other related technologies (Adobe Analytics, Target, Campaign, etc.) is a plus.\n\nStrong knowledge of business process analysis, and the ability to map business requirements to technical solutions.\n\nExcellent communication and presentation skills, with the ability to engage with senior stakeholders and translate complex technical concepts into business value.\n\nAbility to work in a client-facing role, with a focus on delivering high-quality consulting services.\n\n\n\n\nCertifications: Adobe Certified Expert (ACE) in Adobe Experience Manager or other relevant certifications are a plus\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-brillio-4152831057?position=6&pageNum=25&refId=kluirdiBIoCee5yDSaO06g%3D%3D&trackingId=DBfZoxGomT%2FiQUwqzJL5NA%3D%3D"
}