{
    "job_id": "4152732741",
    "title": "Data Scientist",
    "company": "PepsiCo",
    "location": "Hyderabad, Telangana, India",
    "description": "Overview\n\nWe are PepsiCo\n\nPepsiCo is one of the world's leading food and beverage companies with more than $79 Billion in Net Revenue and a global portfolio of diverse and beloved brands. We have a complementary food and beverage portfolio that includes 22 brands that each generate more than $1 Billion in annual retail sales. PepsiCo's products are sold in more than 200 countries and territories around the world. PepsiCo's strength is its people. We are over 250,000 game changers, mountain movers and history makers, located around the world, and united by a shared set of values and goals.\n\nWe believe that acting ethically and responsibly is not only the right thing to do, but also the right thing to do for our business. At PepsiCo, we aim to deliver top-tier financial performance over the long term by integrating sustainability into our business strategy, leaving a positive imprint on society and the environment. We call this Winning with Purpose. For more information on PepsiCo and the opportunities it holds, visit www.pepsico.com.\n\nData Science Team works in developing Machine Learning (ML) and Artificial Intelligence (AI) projects. Specific scope of this role is to develop ML solution in support of ML/AI projects using big analytics toolsets in a CI/CD environment. Analytics toolsets may include DS tools/Spark/Databricks, and other technologies offered by Microsoft Azure or open-source toolsets. This role will also help automate the end-to-end cycle with Azure Machine Learning Services and Pipelines.\n\nPepsiCo Data Analytics & AI Overview:\n\nWith data deeply embedded in our DNA, PepsiCo Data, Analytics and AI (D&AI) transforms data into consumer delight. We build and organize business-ready data that allows PepsiCo’s leaders to solve their problems with the highest degree of confidence. Our platform of data products and services ensures data is activated at scale. This enables new revenue streams, deeper partner relationships, new consumer experiences, and innovation across the enterprise.\n\nThe Data Science Pillar in DA&AI will be the organization where Data Scientist and ML Engineers report to in the broader D+A Organization. Also DS will lead, facilitate and collaborate on the larger DS community in PepsiCo. DS will provide the talent for the development and support of DS component and its life cycle within DA&AIProducts. And will support “pre-engagement” activities as requested and validated by the prioritization framework of DA&AI.\n\nData Scientist: Hyderabad and Gurugram\n\nYou will be part of a collaborative interdisciplinary team around data, where you will be responsible of our continuous delivery of statistical/ML models. You will work closely with process owners, product owners and final business users. This will provide you the correct visibility and understanding of criticality of your developments.\n\nResponsibilities\n\n\nDelivery of key Advanced Analytics/Data Science projects within time and budget, particularly around DevOps/MLOps and Machine Learning models in scope\nActive contributor to code & development in projects and services \nPartner with data engineers to ensure data access for discovery and proper data is prepared for model consumption. \nPartner with ML engineers working on industrialization. \nCommunicate with business stakeholders in the process of service design, training and knowledge transfer. \nSupport large-scale experimentation and build data-driven models. \nRefine requirements into modelling problems. \nInfluence product teams through data-based recommendations. \nResearch in state-of-the-art methodologies. \nCreate documentation for learnings and knowledge transfer. \nCreate reusable packages or libraries. \nEnsure on time and on budget delivery which satisfies project requirements, while adhering to enterprise architecture standards\nLeverage big data technologies to help process data and build scaled data pipelines (batch to real time)\nImplement end-to-end ML lifecycle with Azure Machine Learning and Azure Pipelines\nAutomate ML models deployments\n\n\nQualifications\n\n\nBE/B.Tech(Full time) in Computer Science, Maths, technical fields.\nOverall 5+ years of experience working as a Data Scientist.\n4+ years’ experience building solutions in the commercial or in the supply chain space. \n4+ years working in a team to deliver production level analytic solutions. Fluent in git (version control). Understanding of Jenkins, Docker are a plus. \nFluent in SQL syntaxis. \n4+ years’ experience in Statistical/ML techniques to solve supervised (regression, classification) and unsupervised problems.\n4+ years’ experience in developing business problem related statistical/ML modeling with industry tools with primary focus on Python or Pyspark development. \n\n\nSkills, Abilities, Knowledge:\n\n\nData Science - Hands on experience and strong knowledge of building machine learning models - supervised and unsupervised models. Knowledge of Time series/Demand Forecast models is a plus\nProgramming Skills - Hands-on experience in statistical programming languages like Python, Pyspark and database query languages like SQL\nStatistics - Good applied statistical skills, including knowledge of statistical tests, distributions, regression, maximum likelihood estimators\nCloud (Azure) - Experience in Databricks and ADF is desirable\nFamiliarity with Spark, Hive, Pig is an added advantage\nBusiness storytelling and communicating data insights in business consumable format. Fluent in one Visualization tool. \nStrong communications and organizational skills with the ability to deal with ambiguity while juggling multiple priorities \nExperience with Agile methodology for team work and analytics ‘product’ creation.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-pepsico-4152732741?position=8&pageNum=20&refId=BnXhiVGngDlsLf9MWrlaFw%3D%3D&trackingId=q94vFAHzNci9oqjZeNAiXw%3D%3D"
}