{
    "job_id": "4152754644",
    "title": "Senior Business Analyst",
    "company": "GreyOrange",
    "location": "Gurugram, Haryana, India",
    "description": "Location: Gurgaon\n\nFull-Time\n\nAs a Business Analyst within Customer success function, you will work closely with multiple functions including Project Management, Professional Services teams, towards improving the efficiency and quality of customer project execution experience. You will be responsible for creation of internal processes, data management, reporting and dashboarding related to project delivery.\n\nThe below roles & responsibilities are indicative of the expectations of GreyOrange from your job role. As your impact on the organization and the responsibilities evolve over time, hence the roles and responsibilities are not limited to the below.\n\nResponsibilities:\n\n\nAct as a POC for the business intelligence within Delivery function.\nUpdate Management Information on various cloud forums like Share Point, Google Appsheets, spreadsheets, and JIRA.\nCreate and automate reports/dashboards catering to MIS/BI needs of Project Management\nDrive high compliance for all the processes related to Project Management.\nShare information between finance and Project Management teams with high data sanity and cadence.\nDrive business decisions using learnings/findings from historical data/experience.\nIdentifying the need for Process standardization /Process improvements for Efficiency improvement in the domain of Project Management\nCreate Standard Operating Procedures (SOPs) and Templates; and evolve the existing ones within the D&S function\nProvide training to all the team members on SOPs and ensure the smooth adaptability of process introduced / updated\n\n\nRequirements/Skillset:\n\n\nBachelor's degree required (preferably with quantitative/statistical major/minor disciplines) with 1 to 2 years of experience in data management and analysis\nFair knowledge and experience with Six Sigma methodology\nExperience in handling Big Data using basic SQL queries, automation using basic VBA macros or any other back-end language, data management skills such as data cleaning and data warehousing, and data modelling & visualization skills using Power BI/DAX queries.\nAdept in advance MS Excel and MS PowerPoint\nAbility to analyze trends and provide reasonable forecast\nShould be able to create Business Intelligence data flows using automated triggers and integration between tools\nHigh adaptability to new tools and display natural interest in exploring latest technologies\nAbility to work in a fast-paced and dynamic environment\nShould display high degree of ownership and autonomy while handling business processes\nAbility to liaise with various internal/external stake holders\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-greyorange-4152754644?position=5&pageNum=60&refId=RBk3qTVB%2BCNiFfiLUXOVnA%3D%3D&trackingId=Ua89PXwSptwmUoEmRbrHbQ%3D%3D"
}