{
    "job_id": "4152380647",
    "title": "Senior Business Analyst",
    "company": "QualityKiosk Technologies Pvt. Ltd.",
    "location": "Mumbai, Maharashtra, India",
    "description": "QualityKiosk Technologies is one of the world’s largest Digital Quality Engineering partners and pioneers in performance engineering for largest Banking and Financial Services, Telecom and Automobile clients. Founded in the year 2000 by IIT-Kanpur graduates, we offer Enterprise Digital Quality Assurance solutions for banking, financial services, insurance, retail, e-commerce, and also government, automotive and telecom verticals. Intelligent Business Automation, DevOps and Customer Experience are some of the key areas where we work with our partners to deliver Digital Quality Assurance. QualityKiosk counts more than 50 of the Fortune 100 companies of India and 18 of the Fortune 500 companies across the globe as clients. With 150+ clients from various verticals across global locations, our clients include Reliance Industries, Reliance Jio, Toyota, HDFC Bank, ICICI Bank, SBI, Kotak Bank, DBS, Citibank, Prudential, BTPN Bank, Manulife, AIA, UAE Government - Ministry of Finance, Tata Group, Government of India (GSTN,NPCI),Vodafone and others. QualityKiosk’s 2000+ Quality Assurance consultants are spread across 20+ countries including India, UAE, Malaysia, Singapore, Indonesia, and Philippines. Some of the recognitions received by us include a mention by Gartner in their 'Build Continuous Quality Into Your DevOps Toolchains' Report 2018, “Asia’s Most Trusted Organization” by the International Brand Consultants, and “Happy Place to Work” by World HRD Congress.\n\n\n\n\n\n\n\nExperience: 3+ Years of experience as a Business Analyst, with specific experience in Finacle and payment products.\n\n\n\n\n\n\n\nJob Summary:\n\nThe Finacle Business Analyst with payment experience will be responsible for analyzing, designing, and implementing solutions using the Finacle banking platform. This role involves working closely with stakeholders to understand business requirements, particularly in the area of payments, and translating them into technical/ buisness specifications.\n\n\n\n\n\n\n\nKey Responsibilities:\n\nRequirement Gathering: Collaborate with business stakeholders to gather and document requirements related to payment products and services.\nAnalysis and Design: Analyze business processes and design solutions using Finacle to meet the identified requirements.\nConfiguration and Customization: Configure and customize the Finacle platform to support payment products, including domestic and international transfers, bill payments, and mobile payments.\nTesting and Validation: Develop test cases and conduct testing to ensure the solutions meet business requirements and are free of defects (Optional)\nSupport and Maintenance: Provide ongoing support and maintenance for the Finacle platform, addressing any issues related to payment products (Optional)\nDocumentation: Create and maintain detailed documentation of business requirements, technical specifications, and user manuals.\nTraining: Train end-users and other stakeholders on the new features and functionalities of the Finacle platform.\n\n\n\n\n\n\n\nSkills:\n\nStrong understanding of payment products and services in the banking sector.\nProficiency in using the Finacle banking platform.\nExcellent analytical and problem-solving skills.\nStrong communication and interpersonal skills.\nAbility to work collaboratively with cross-functional teams.\n\n\n\n\nPreferred:\n\nCertifications: Relevant certifications in business analysis or Finacle.\nTechnical Skills: Knowledge of SQL, data analysis, and reporting tools.\n\nQualifications\n\n\n\n\nBachelor's degree in Business or related field\nProficient in Microsoft Office suite\nStrong written and verbal communication skills\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-qualitykiosk-technologies-pvt-ltd-4152380647?position=2&pageNum=70&refId=HPHgp9Y9QvXuYD8UMhcuvA%3D%3D&trackingId=yftkxMLvFYBzJwtqbzK4JA%3D%3D"
}