{
    "job_id": "4152810750",
    "title": "Business Analyst (Ecommerce Domain)",
    "company": "TVS Next",
    "location": "Chennai, Tamil Nadu, India",
    "description": "What you ‘ll do:\n\nYou will join our high performance team of Business Analysts and act as a senior providing professional advice, managing and/or co-ordinating an area within Business Analysis. You will have the opportunity to lead technical areas within Business Analysis projects using available frameworks, tools and establishing project plans with on-time and on-budget project goals.\nManage and lead multiple phases of technical areas within a project and/or multiple small projects of moderate scope and sometimes complex assignments.\nMap full business processes and implement solutions for technological and process improvements within the context of overall business processes.\nGather business requirements from stakeholders and review existing ones to produce detailed business requirement specification documents.\nRun workshops using proven techniques for creating detailed business, functional and non-functional requirements.\nAssist and lead team contribution and communication to ensure complete requirement coverage.\nApply standards and methodologies. Provide expertise and support on use of methods and tools.\nResponsible for needs analysis, task planning, process/data analysis and modelling and/or logical database design with relational databases.\nIdentify and assess risks to the success of the project.\nAgree the project approach with stakeholders, and prepare realistic plans (including quality, risk and communications plans)\nTrack activities against the project schedule and manage stakeholder involvement as appropriate.\nHandle training and build competency within the practice.\n\n\n\n\nWhat we seek in you:\n\n5+ years experience as Business Analyst.\nStrong experience in Ecommerce Domain.\nExcellent client-facing skills.\nKnowledge in business analysis methodologies and has awareness of new and emerging technologies and developments.\nHas good applications/technology knowledge, building on specialist domain knowledge.\nProven ability in assuring project meets quality standards by providing guidance and developing procedures relating to product quality.\nExperience in applying problem-solving methodologies and tools to diagnose and solve operational problems.\nExperience in providing technical guidance to enable others and solving technical queries from junior colleagues.\nHighly proficient in MS Excel, PowerPoint and Word\nExperience of using recommended project control solutions for planning, scheduling and tracking.\n\n\n\n\nLife at Next:\n\nAt our core, we're driven by the mission of tailoring growth for our customers by enabling them to transform their aspirations into tangible outcomes. We're dedicated to empowering them to shape their futures and achieve ambitious goals. To fulfil this commitment, we foster a culture defined by agility, innovation, and an unwavering commitment to progress. Our organizational framework is both streamlined and vibrant, characterized by a hands-on leadership style that prioritizes results and fosters growth.\n\n\n\n\nPerks of working with us:\n\nClear objectives to ensure alignment with our mission, fostering your meaningful contribution.\nAbundant opportunities for engagement with customers, product managers, and leadership.\nYou'll be guided by progressive paths while receiving insightful guidance from managers through ongoing feedforward sessions.\nCultivate and leverage robust connections within diverse communities of interest. Choose your mentor to navigate your current endeavors and steer your future trajectory.\nEmbrace continuous learning and upskilling opportunities through Nexversity.\nEnjoy the flexibility to explore various functions, develop new skills, and adapt to emerging technologies. Embrace a hybrid work model promoting work-life balance. Access comprehensive family health insurance coverage, prioritizing the well-being of your loved ones.\nEmbark on accelerated career paths to actualize your professional aspirations.\n\n\n\n\nWho we are?\n\nWe enable high growth enterprises build hyper personalized solutions to transform their vision into reality. With a keen eye for detail, we apply creativity, embrace new technology and harness the power of data and AI to co-create solutions tailored made to meet unique needs for our customers.\n\n\n\n\nJoin our passionate team and tailor your growth with us!\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-ecommerce-domain-at-tvs-next-4152810750?position=3&pageNum=37&refId=7Scw1Dd0tMof41tt6zSiVA%3D%3D&trackingId=4YrWakRKjb93KtefxjL4GA%3D%3D"
}