{
    "job_id": "4152775949",
    "title": "Business Analyst I",
    "company": "S&P Global",
    "location": "Hyderabad, Telangana, India",
    "description": "About The Role\n\nGrade Level (for internal use):\n\n08\n\nJob Title: Business Analyst\n\nThe Location: Islamabad – Pakistan\n\nAbout the Role: As a Business Analyst - I, you will have the responsibility to be proactive in understanding and analyzing technical solutions and how to improve them. You will be asked to identify areas to strengthen the operational effectiveness and excellence, leverage technology and improve the quality of process, programs or applications for the business area(s).\n\nJob Responsibilities\n\n\nSupport S&P Global’s critical CRM system for continuous excellence in Commercial Operations.\nWork with end users, product owners, and development teams from our Order-to-cash tools, Salesforce, and Entitlements teams.\nEngage with stakeholders and understand requirements for issue resolution\nBe an active member of a technical support team and manage the resolution of critical incidents\nAssist in creating comprehensive technical documents\nEffective execution of Month-end close process through collaboration with various stakeholder groups and mitigating impediments as necessary\nSupervise activities between resources, and facilitate smooth workflow for service delivery\nBuild Knowledge Base articles, Playbooks, documentation\nIdentify opportunities for functional improvements and enhancements to maximize the effectiveness of available technology\nMonitor user feedback and areas of concern; Engage with Scrum team and Product Owner for suggestive areas of improvement\nBe up to date with current field practices to enhance service standards and delivery\nUnderstand end-to-end solution and integrations in the overall architecture\nRemain knowledgeable of current technology and carry out research to identify new trends that can be used to achieve maximum results\n\n\nWhat We’re Looking For\n\n\nShould have at least 1 years’ experience working with Salesforce and/or on a Technical Support Team in a related field.\nBasic understanding of Agile best practices\nGood understanding of development environments and testing processes\nGood communication skills (Verbal and Written) and be able to articulate the problems and provide comprehensive solutions\nBachelor’s Degree or Master’s degree in engineering or equivalent\nExcellent team player & interpersonal skills\nExperience collaborating with clients on business process enhancements\n\n\nPreferred Qualification\n\n\nKnowledge of CPQ or other OTC Applications will be an added advantage\nUnderstanding of the role of a Business Analyst in Support team\nKnowledge of Salesforce Application will be an added advantage (some combination of Opportunity Management or Quote Management implementation knowledge is a plus)\n\n\nFlexible Working\n\nWe pride ourselves on our agility and diversity, and we welcome requests to work flexibly. For most roles, flexible hours and/or an element of remote working are usually possible. Please talk to us at interview about the type of arrangement that is best for you. We will always try to be adaptable wherever we can. \n\nWhat’s In It For You?\n\nOur Purpose\n\nProgress is not a self-starter. It requires a catalyst to be set in motion. Information, imagination, people, technology–the right combination can unlock possibility and change the world.\n\nOur world is in transition and getting more complex by the day. We push past expected observations and seek out new levels of understanding so that we can help companies, governments and individuals make an impact on tomorrow. At S&P Global we transform data into Essential Intelligence®, pinpointing risks and opening possibilities. We Accelerate Progress.\n\nOur People\n\nWe're more than 35,000 strong worldwide—so we're able to understand nuances while having a broad perspective. Our team is driven by curiosity and a shared belief that Essential Intelligence can help build a more prosperous future for us all.\n\nFrom finding new ways to measure sustainability to analyzing energy transition across the supply chain to building workflow solutions that make it easy to tap into insight and apply it. We are changing the way people see things and empowering them to make an impact on the world we live in. We’re committed to a more equitable future and to helping our customers find new, sustainable ways of doing business. We’re constantly seeking new solutions that have progress in mind. Join us and help create the critical insights that truly make a difference.\n\nOur Values\n\nIntegrity, Discovery, Partnership\n\nAt S&P Global, we focus on Powering Global Markets. Throughout our history, the world's leading organizations have relied on us for the Essential Intelligence they need to make confident decisions about the road ahead. We start with a foundation of integrity in all we do, bring a spirit of discovery to our work, and collaborate in close partnership with each other and our customers to achieve shared goals.\n\nBenefits\n\nWe take care of you, so you can take care of business. We care about our people. That’s why we provide everything you—and your career—need to thrive at S&P Global.\n\nOur Benefits Include\n\n\nHealth & Wellness: Health care coverage designed for the mind and body.\nFlexible Downtime: Generous time off helps keep you energized for your time on.\nContinuous Learning: Access a wealth of resources to grow your career and learn valuable new skills.\nInvest in Your Future: Secure your financial future through competitive pay, retirement planning, a continuing education program with a company-matched student loan contribution, and financial wellness programs.\nFamily Friendly Perks: It’s not just about you. S&P Global has perks for your partners and little ones, too, with some best-in class benefits for families.\nBeyond the Basics: From retail discounts to referral incentive awards—small perks can make a big difference.\n\n\nFor more information on benefits by country visit: https://spgbenefits.com/benefit-summaries\n\nDiversity, Equity, And Inclusion At S&P Global\n\nAt S&P Global, we believe diversity fuels creative insights, equity unlocks opportunity, and inclusion drives growth and innovation – Powering Global Markets. Our commitment centers on our global workforce, ensuring that our people are empowered to bring their whole selves to work. It doesn’t stop there, we strive to better reflect and serve the communities in which we live and work, and advocate for greater opportunity for all.\n\nEqual Opportunity Employer\n\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person. \n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law. Pay Transparency Nondiscrimination Provision - https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp_%20English_formattedESQA508c.pdf\n\n20 - Professional (EEO-2 Job Categories-United States of America), IFTECH203 - Entry Professional (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning)\n\nJob ID: 311871\n\nPosted On: 2025-02-17\n\nLocation: Islamabad, Pakistan\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-i-at-s-p-global-4152775949?position=7&pageNum=97&refId=HcfnYd3BMGIT%2FuoEZTo%2FBg%3D%3D&trackingId=Wg3NUD%2B2jc%2FgSp1XSoreIQ%3D%3D"
}