{
    "job_id": "4153860634",
    "title": "Data Scientist",
    "company": "McCormick & Company",
    "location": "Gurugram, Haryana, India",
    "description": "About Us\n\nWith more than $4 billion in annual sales, the Company manufactures markets and distributes retail outlets, food manufacturers and foodservice businesses. We create differentiating flavors consumers prefer with unmatched quality, science, innovation and service. Every day, no matter.\n\nwhere you are or what you eat, you can enjoy food flavored by McCormick. McCormick brings passion to flavor™!\n\nAs a company recognized for exceptional commitment to employees, McCormick offers a wide variety of benefits, programs and services including, but not limited to, tuition assistance, medical, dental, vision, disability, group life insurance, 401(k) with partial company match, profit sharing, paid holidays, paid sick time and paid vacations.\n\n\n\n\nPOSITION OVERVIEW:\n\nThis Data Scientist will be responsible for providing leadership and subject matter expertise in the application of advanced analytics to solve business problems. The role requires a deep understanding of the processing, analyzing and modeling of structured and unstructured data, combined with the ability to interpret results and make recommendations to business stakeholders to shape strategies for our business units globally. The candidate needs to be able to establish credibility in a wide variety of business partners by providing consulting (advisory) services as well as high quality execution across multiple priorities, in a fast-paced environment.\n\n\n\n\nRESPONSIBILITIES:\n\n\n\n\n3+ years advanced statistics and mathematical modeling\n5+ yrs experience developing and implementing ML/AI models\nGenAI RAG experience\n5+ years in R&D environment scoping, developing, and implementing automated, production level data science solutions using state of the art algorithms\n3+ years proven communication skills and experience and being customer/business facing and responsible to understand customer decision-making process and business logic, workflows, and data analysis goals, and translate these into analytics/reporting requirements\nPython experience\nExperience in a Microsoft Azure environment\nExperience with advanced machine learning concepts like Neural Networks, MLP, gradient descent.\n\n\n\n\nPREFFERED EXPERIENCE\n\n-Fine tuning and alignment of LLM’s; Neo4J/Cypher; Denodo, SAP, CompuSense, DevEx\n\n-Experience in CPG / Food industry\n\n-Experience with food R&D or food science, technical solution companies that support CPG companies\n\n-Date engineering experience\n\n-Graph database experience\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-mccormick-company-4153860634?position=10&pageNum=10&refId=3OwYoZiMWUBkemlaz%2FA01Q%3D%3D&trackingId=982%2B%2FTd7wnmi5ARfr9Sw%2Fw%3D%3D"
}