{
    "job_id": "4153810881",
    "title": "Business Analyst",
    "company": "Synechron",
    "location": "Pune, Maharashtra, India",
    "description": "Good day,\n\n\n\n\nWe have immediate opportunity for VisionPLUS Business Analyst.\n\n\n\n\nJob Role: VisionPLUS BA\n\nJob Location: Bangalore, Pune, Chennai, Hyderabad\n\nExperience- 10+ Years\n\n\n\n\nAbout Company:\n\nAt Synechron, we believe in the power of digital to transform businesses for the better. Our global consulting firm combines creativity and innovative technology to deliver industry-leading digital solutions. Synechron’s progressive technologies and optimization strategies span end-to-end Artificial Intelligence, Consulting, Digital, Cloud & DevOps, Data, and Software Engineering, servicing an array of noteworthy financial services and technology firms. Through research and development initiatives in our FinLabs we develop solutions for modernization, from Artificial Intelligence and Blockchain to Data Science models, Digital Underwriting, mobile-first applications and more. Over the last 20+ years, our company has been honored with multiple employer awards, recognizing our commitment to our talented teams. With top clients to boast about, Synechron has a global workforce of 13,950+, and has 52 offices in 20 countries within key global markets. For more information on the company, please visit our website or LinkedIn community.\n\n\n\n\nJob Description: VisionPLUS BA\n\nSeeking a skilled Visionplus Business Analyst to gather and document business requirements, ensuring seamless integration and functionality.\nThe ideal candidate will possess a deep understanding of Visionplus modules and system integration.\n\nOverall responsibilities:\n\nAreas of work: BA Services\nPerform Parameter setup data mapping to new platform.\nPerform Functional gap analysis and data mapping.\nAssist in analyzing the portfolio migration requirements (internal and client initiated), breaking down to the required level of details to drive a traceability matrix and functional solution documents.\nFacilitate in tracking the portfolio migration requirements throughout the software.\nDevelopment lifecycle, ensuring that the solution, development, and testing deliver the correct coverage and scope.\nAssist in documenting portfolio migration requirements clearly and concisely in the standard format.\nAssist in providing work estimates when applicable.\n\nTechnical Skills:\n\nHands on experience on one or more of the sub-systems in Vision PLUS (CMS Posting, FAS, TRAMS, VMx) needed to solve the issues in the application.\nSkills in Mainframe - JCL, COBOL, VSAM and CICS\nExperience in one of the Methodologies - Waterfall, Agile Scrum, Agile Kanban\nVision Flex experience is preferrable.\n\n\n\n\nIf you find this this opportunity interesting kindly share your updated profile on ajit.horo@synechron.com\n\nWith below details (Mandatory)\n\nTotal Experience -\n\nExperience as a BA in VisionPLUS-\n\nCurrent CTC-\n\nExpected CTC-\n\nNotice period-\n\nCurrent Location-\n\n\n\n\nIf you had gone through any interviews in Synechron before? If yes when\n\n\n\n\nRegards,\n\nAjit Horo\n\najit.horo@synechron.com\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-synechron-4153810881?position=6&pageNum=20&refId=7fN7Ckox%2BLonxiKufmjeog%3D%3D&trackingId=ZYVxV00hNjoXkiZ089Zdqg%3D%3D"
}