{
    "job_id": "4153803162",
    "title": "Senior Business Analyst",
    "company": "Sell.Do",
    "location": "Pune, Maharashtra, India",
    "description": "Job Description\n\nWe are seeking a dynamic and results-driven Sr. Business Analyst to join our team at Sell.do. The ideal candidate will be responsible for owning the product lifecycle, driving the vision, and delivering impactful solutions tailored to the real estate industry. This role requires a combination of strategic thinking, customer empathy, technical knowledge, and a data-driven approach to build products that create exceptional value for our users.\n\n\n\n\nKey Responsibilities\n\n1.Product Ownership\n\nTake full ownership of the product lifecycle from ideation to launch, ensuring the product aligns with business objectives.\nDevelop a deep understanding of customer pain points, competitive landscape, and market trends within the real estate and SaaS domains.\nDefine product KPIs and track their performance post-launch to ensure long-term success.\n\n2.Strategy and Roadmap Development\n\nCollaborate with stakeholders to define and articulate the product vision and strategy.\nBuild and maintain a detailed, forward-looking product roadmap, ensuring alignment with company goals.\nPrioritize features and initiatives based on business impact, technical feasibility, and customer value.\n\n3.Cross-Funtional Collaboration\n\nAct as the primary liaison between engineering, design, marketing, sales, and customer success teams to ensure cohesive product delivery.\nDrive alignment across teams by facilitating regular touchpoints and maintaining clear communication of goals and priorities.\nAdvocate for the voice of the customer across all stages of the product development lifecycle.\n\n4.Data-Driven Product Management\n\nLeverage customer feedback, analytics, and market research to identify opportunities for product enhancements and new feature development.\nConduct regular A/B testing, usability studies, and product performance reviews to refine user experiences.\nAnalyze product usage and industry benchmarks to recommend data-backed improvements.\n\n5.Agile product Development\n\nServe as a Product Owner in Agile processes, ensuring clear user stories, acceptance criteria, and well-groomed backlogs.\nWork with engineering teams to prioritize sprints and ensure timely delivery of high-quality features.\nContinuously iterate on the product roadmap based on feedback, evolving requirements, and market conditions.\n\n\n\n\nRequired Skills & Qualification\n\nProven experience as a Product Manager, preferably in SaaS, CRM, or real estate tech domains.\nStrong analytical and problem-solving abilities, with a customer-first mindset.\nExcellent communication and interpersonal skills for engaging with stakeholders, customers, and cross-functional teams.\nDemonstrated ability to balance strategic thinking with tactical execution.\nExpertise in writing detailed product requirements, user stories, and workflows.\n\n\n\n\nPreferred Tools & Methodology\n\nProject Management: Jira, Trello, or Asana.\nDesign Collaboration: Figma or Adobe XD.\nProduct Analytics: Mixpanel, Google Analytics, or Amplitude.\nCRM Understanding: Familiarity with real estate workflows, sales processes, and customer journey mapping.\nAgile Practices: Scrum or Kanban frameworks.\n\n\n\n\nWhy Join Us?\n\nOpportunity to shape the future of real estate technology and redefine industry standards.\nWork in a fast-paced, innovative environment with a collaborative team culture.\nCompetitive salary and benefits, with opportunities for career growth.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-sell-do-4153803162?position=8&pageNum=55&refId=rCPSt2W60wSZDZdAR5hPHw%3D%3D&trackingId=1GDnL8%2FhUO%2Fx3uIf3GRO9A%3D%3D"
}