{
    "job_id": "4153255839",
    "title": "Data Scientist",
    "company": "Lowe's India",
    "location": "Bengaluru, Karnataka, India",
    "description": "About Lowe’s\n\nLowe’s Companies, Inc. (NYSE: LOW) is a FORTUNE® 50 home improvement company serving approximately 16 million customer transactions a week in the United States. With total fiscal year 2023 sales of more than $86 billion, Lowe’s operates over 1,700 home improvement stores and employs approximately 300,000 associates. Based in Bengaluru, Lowe’s India develops innovative technology products and solutions and delivers business capabilities to provide the best omnichannel experience for Lowe’s customers. Lowe’s India employs over 4,200 associates across technology, analytics, merchandising, supply chain, marketing, finance and accounting, product management and shared services. Lowe’s India actively supports the communities it serves through programs focused on skill-building, sustainability and safe homes. For more information, visit, www.lowes.co.in.\n\nAbout The Team\n\nDACI Merchandising primarily focused on Assortment planning and store merchandising execution areas. The team is responsible for solving the problem of which items should we be placed in each store and also determining if we are using the retail selling space effectively or not. We are primarily the data team, using big data and machine learning to help the business users make the best assortment and store merchandising execution decisions.\n\nJob Summary\n\nThe primary purpose of this role is to provide advanced analytical capabilities to support data science initiatives. This position gains experience in various areas including, but not limited to: predictive modeling; personalization and recommendation algorithms; natural language processing and text mining; search recall, precision, ranking, and related problems; optimization and mathematical programming with applications in merchandising like assortment optimization, retail space planning, and product description,. A Data Scientist solves complex problems that do not yet have solutions in the research. Therefore, the individual in this role must be an expert in his/her field and confident in interacting and proposing solutions to the business. This role influences the thought process and methodology for other team members.\n\nRoles & Responsibilities\n\nCore Responsibilities:\n\n\nYou will build and deploy state of the art predictive models for use cases such as assortment optimization, automated item listing validation and retail space optimization.\nDevelop and maintain pipelines for training and deploying machine learning models\nDevelop and maintain forecasting models and tools using frameworks such as TensorFlow\nDesign and deploy scalable API services for distributing model output data\nSupport enterprise forecasting applications\nCollaborate with Data Scientists and Data Engineers to ensure that specifications are translated into flexible, scalable, and maintainable solutions\nStay abreast of state-of-the-art machine learning technologies; follow code standards and best practices\nMines and extracts data and applies statistics and algorithms necessary to derive insights for Lowe's\nSupports the generation of an automated insights generation framework for Lowe's business partners to effectively interpret data\nProvides actionable insights through data science on Merchandising priorities\nTracks success of Lowe's through the development of dashboard reports that measure financial results, customer satisfaction, and engagement metrics\nConducts deep statistical analysis, including predictive and prescriptive modeling in order to provide a competitive advantage at Lowe's\nMaintains expert-level knowledge on industry trends, emerging technologies, and new methodologies and applies it to projects as well as using it to guide team members\nTranslates or provides guidance to more junior level scientists to translate requirements into an analytical approach; asks the right questions to understand the problem; validates understanding with Stakeholder or Manager\nBuilds or provides guidance for building the analytic approach to solving a business problem; helps identify the sources, methods, parameters, and procedures to be used; clarifies expectations with stakeholders and plans resources accordingly\nLeverages deep understanding of statistical techniques and tools to analyze data according to the project plan; communicates with stakeholders to provide updates and manage scope\nMaintains knowledge of techniques, technology, industry trends, best practices, and emerging methodologies\n\n\nYears Of Experience\n\n\n2-5 years of experience in data science\n\n\nRequired Minimum Qualifications\n\n\nBachelor's Degree in Mathematics, Statistics, Physics, Economics, Engineering, Computer Science, Data or Information Science, or related quantitative analytic field (or equivalent work experience in a related field) AND 4 years of experience in analytics AND 2 years of programming experience (Python, Java, Scala, Rust, etc.) OR Master's Degree in Mathematics, Statistics, Physics, Economics, Engineering, Computer Science, Data or Information Science, or related quantitative analytic field AND 2 years of experience in analytics AND 1 year of programming experience (Python, Java, Scala, Rust, etc.) OR Ph.D. in Mathematics, Statistics, Physics, Economics, Engineering, Computer Science, Data or Information Science, or related quantitative analytic field AND 1 year of experience in analytics Also\nKnowledge of SQL and various statistical modeling or machine learning techniques\n\n\nSkill Set Required\n\nPrimary Skills (must have)\n\n\nHands on experience in AI/ML\nHands on experience in Python to build applications that are scalable\nStatistics\nStrong problem solving skills\nData munging/wrangling\nExperience with SQL\n\n\nSecondary Skills (desired)\n\n\nExperience with Big Data systems like Hadoop or Big Query or Druid\nExperience solving data science problems in retail\n\n\nLowe's is an equal opportunity employer and administers all personnel practices without regard to race, color, religious creed, sex, gender, age, ancestry, national origin, mental or physical disability or medical condition, sexual orientation, gender identity or expression, marital status, military or veteran status, genetic information, or any other category protected under federal, state, or local law.\n\nStarting rate of pay may vary based on factors including, but not limited to, position offered, location, education, training, and/or experience. For information regarding our benefit programs and eligibility, please visit https://talent.lowes.com/us/en/benefits.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-lowe-s-india-4153255839?position=9&pageNum=20&refId=BnXhiVGngDlsLf9MWrlaFw%3D%3D&trackingId=mbWc7vytmHEPpNEyFbthvw%3D%3D"
}