{
    "job_id": "4153637501",
    "title": "Business Analyst- P&C Insurance",
    "company": "Coforge",
    "location": "Noida, Uttar Pradesh, India",
    "description": "Job Title / Role: Business Analyst - P&C Insurance\n\nKey Skills: P&C Insurance, SQL & Commercial LOB\n\nExperience: 6-10 years\n\nLocation: Greater Noida & Pune\n\nShift: 12:00 PM - 8:30 PM\n\nMode: Hybrid\n\n\n\n\nImmediate Joiner are preferable\n\n\n\n\nWe at Coforge are hiring Business Analyst- P&C Insurance with the following skill set:\n\n\n\n\nMinimum 6 years experience working as a technical business analyst within the general insurance (Property & Casualty) industry, ideally within specialty commercial and London markets.\nStrong domain experience of Finance, underwriting and/or reinsurance highly desirable.\nExperience producing technical requirements as BRDs or user stories, requirements catalogues, process flows (Levels 1 to 4), gap analysis and impact assessment documents.\nStrong interaction and communication skills to quickly establish rapport with business and technical SME personnel at all levels.\nExcellent documentation skills to create clear business level definitions in diagrams and written form.\nProcess Mapping (current and future state); development of data flow diagrams and entity relationship diagrams , other UML techniques.\nUnderstanding of regulatory landscape within which an insurance company operates.\nAble to work in a team and help assist other team members develop Business Analysis skills.\nExperience of working in an Agile cross-functional team.\nExcellent analytical and problem-solving skills.\nStrong presence and ability to interact with various levels of seniority within a client organization.\nExperience of the data warehouse development cycle and challenges posed by data quality.\nHighly desirable experience with data tools desirable, including SQL and SSRS.\nPrior BI development experience (ETL and Reporting).\nHand on experience with SSIS, SSAS and SSRS.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-p-c-insurance-at-coforge-4153637501?position=6&pageNum=47&refId=al9nUfzCZGF%2B%2BRebT5L1EA%3D%3D&trackingId=ShMp%2Bw%2BMDjpjNY545qsHiw%3D%3D"
}