{
    "job_id": "4153692153",
    "title": "Data Analyst",
    "company": "Deloitte",
    "location": "Hyderabad, Telangana, India",
    "description": "What impact will you make?\n\n\n\n\nEvery day, your work will make an impact that matters, while you thrive in a dynamic culture of inclusion, collaboration and high performance. As the undisputed leader in professional services, Deloitte is where you will find unrivaled opportunities to succeed and realize your full potential\n\n\n\n\nDeloitte is where you will find unrivaled opportunities to succeed and realize your full potential.\n\n\n\n\nThe Team\n\nDeloitte’s Technology and Transformation practice can help you uncover and unlock the value buried deep inside vast amounts of data. Our global network provides strategic guidance and implementation services to help companies manage data from disparate sources and convert it into accurate, actionable information that can support fact-driven decision-making and generate an insight-driven advantage. Our practice addresses the continuum of opportunities in business intelligence & visualization, data management, performance management and next-generation analytics and technologies, including big data, cloud, cognitive and machine learning.\n\nLearn more about Analytics and Information Management Practice\n\n\n\n\nWork you’ll do\n\nAs a Consultants/Senior Consultant in our Consulting team, you’ll build and nurture positive working relationships with teams and clients with the intention to exceed client expectations. You’ll:\n\n\n\n\nExcellent Data handling and good analytical skills to collect, transform and discover patterns.\nTechnical proficiency in writing code in Python, advanced SQL queries\nCompetence in conducting more sophisticated data analyses.\nAbility to manipulate and transform complex datasets for in-depth analysis.\nProficiency in working with databases, including designing queries and managing large datasets.\nAdvanced Visualization: Capability to create advanced visualizations and dashboards to communicate complex findings. (Looker Studio/Power BI/Tableau).\nProblem-Solving: Strong problem-solving skills to address complex data challenges and discrepancies\nExperience in translating business challenges into data problems and coming up with solutions.\nFluency in articulating findings to peer group and stakeholders\nPrior experience in data transformation projects is a bonus.\nGood domain knowledge understanding\n\n\n\n\nYour role as a leader\n\nAt Deloitte India, we believe in the importance of leadership at all levels. We expect our people to embrace and live our purpose by challenging themselves to identify issues that are most important for our clients, our people, and for society and make an impact that matters.\n\n\n\n\nIn addition to living our purpose, Senior Consultant across our organization:\n\n\n\n\nDevelop high-performing people and teams through challenging and meaningful opportunities\nDeliver exceptional client service; maximize results and drive high performance from people while fostering collaboration across businesses and borders\nInfluence clients, teams, and individuals positively, leading by example and establishing confident relationships with increasingly senior people\nUnderstand key objectives for clients and Deloitte; align people to objectives and set priorities and direction.\nActs as a role model, embracing and living our purpose and values, and recognizing others for the impact they make\n\n\n\n\nHow you will grow\n\nAt Deloitte, our professional development plan focuses on helping people at every level of their career to identify and use their strengths to do their best work every day. From entry-level employees to senior leaders, we believe there is always room to learn. We offer opportunities to help build excellent skills in addition to hands-on experience in the global, fast-changing business world. From on-the-job learning experiences to formal development programs at Deloitte University, our professionals have a variety of opportunities to continue to grow throughout their career. Explore Deloitte University, The Leadership Centre.\n\n\n\n\nBenefits\n\nAt Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits. Learn more about what working at Deloitte can mean for you.\n\n\n\n\nOur purpose\n\nDeloitte is led by a purpose: To make an impact that matters.\n\nEvery day, Deloitte people are making a real impact in the places they live and work. We pride ourselves on doing not only what is good for clients, but also what is good for our people and the\n\nCommunities in which we live and work—always striving to be an organization that is held up as a role model of quality, integrity, and positive change. Learn more about Deloitte's impact on the world\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-analyst-at-deloitte-4153692153?position=2&pageNum=0&refId=BZHRvUcLUc4bYfhU1pUsCg%3D%3D&trackingId=WxRczjuK6zzdT4aA8bvNVQ%3D%3D"
}