{
    "job_id": "4153173085",
    "title": "Senior Business Analyst",
    "company": "EPAM Systems",
    "location": "Kanpur, Uttar Pradesh, India",
    "description": "We are seeking a talented Senior Business Analyst to become a key player in our team. In this role, you will be responsible for analyzing business needs, managing requirements, and collaborating with stakeholders to optimize processes and systems. Your expertise in business analysis and insurance solutions will directly contribute to the success of our projects.\n\nResponsibilities\n\n\n\nAct as a bridge between stakeholders, ensuring clear communication and expectation management\nDevelop, document, and maintain essential business analysis artifacts\nStrategically plan and execute business analysis activities\nConduct comprehensive requirements analysis and oversee change management processes\nIdentify opportunities for process enhancements and provide actionable recommendations\nPartner with cross-functional teams to ensure smooth project execution\nAssess current business analysis methodologies and suggest areas for improvement\nBe available for occasional late meetings when required\n\n\n\nRequirements\n\n\n\nA minimum of 3 years of experience in business analysis\nStrong stakeholder management and communication skills\nProficiency in documenting BA artifacts and planning business analysis activities\nDeep understanding of requirements analysis and change management\nHands-on experience with EIS ClaimCore v12\nStrong analytical skills and attention to detail\nEnglish proficiency at B2+ level\nKnowledge of insurance industry processes\n\n\n\nNice to have\n\n\n\nExperience working with EIS Solutions\nA proven track record in enhancing business analysis workflows\nAbility to tackle complex business challenges with innovative solutions\nExperience in facilitating late meetings when necessary\n\n\n\nWe offer\n\n\n\nInternational projects with top brands\nWork with global teams of highly skilled, diverse peers\nHealthcare benefits\nEmployee financial programs\nPaid time off and sick leave\nUpskilling, reskilling and certification courses\nUnlimited access to the LinkedIn Learning library and 22,000+ courses\nGlobal career opportunities\nVolunteer and community involvement opportunities\nEPAM Employee Groups\nAward-winning culture recognized by Glassdoor, Newsweek and LinkedIn\n\n\n\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-epam-systems-4153173085?position=9&pageNum=25&refId=kluirdiBIoCee5yDSaO06g%3D%3D&trackingId=aF53Jdc7J%2BwRmbxdgveyXA%3D%3D"
}