{
    "job_id": "4153680324",
    "title": "Data Scientist",
    "company": "HCLTech",
    "location": "Chennai, Tamil Nadu, India",
    "description": "HCL Tech is Hiring for Data Scientist for Chennai Location role for one of the leading product based client. \"Come join us in reshaping the future”\n\nExp required : 7 to 9 yrs.\n\nJob Location: Chennai\n\nInterested candidates can share their resumes on- kale_pritiramesh@hcltech.com\n\nKey Skills Required:\n\nData Scientist\n\nWhat you'll do...\n\n• Enthusiastic and self-motivated, with ability to lead machine learning & GenAI based use cases and projects\n\n• Meticulous attention to detail, with an overall passion for continuous improvement\n\n• Innovative and creative, with a logical and methodical approach to problem solving\n\n• Credible and articulate, with excellent communication, presentation, and interpersonal skills\n\n• Ability to multi-task and manage competing priorities\n\n• Work closely with Tech Anchor, Product Manager and Product Owner.\n\n• Work with other Software and ML Engineers to tackle challenging AI problems.\n\n• Participate in Pair Programming for cross training/upskilling, problem solving.\n\n• Leverage latest ML and GCP technologies.\n\n• Work with Architects to make technical decision on tools, integration, and other issues.\n\n• Drive PoCs/Discoveries of new tools and technologies to support robust ML Platform\n\n• Grow technical capabilities / expertise and provide guidance to other software engineers.\n\nResponsibilities\n\n· Lead And Co-Lead high impact business projects with time bound and effective project management leveraging tools like rally, jira\n\n· Use statistical methodologies leveraging analytical tools to support different business initiatives\n\n· Compile and analyze the results from modeling output and translate into actionable insights through dashboards or web applications\n\n· Execute analytics special studies and ad hoc analyses in a quick turn around time\n\n· Various classical Statistical techniques such as Regression, Multivariate Analysis etc.\n\n· Time Series based forecasting modeling\n\n· Experience with SQL and data warehousing (e.g. GCP/Hadoop/Teradata/Oracle/DB2)\n\n· Experience using tools in BI, ETL, Reporting /Visualization/Dashboards\n\n· Programming experience in languages like Python with the understanding of object-oriented programming strongly desired\n\n· Exposure to Bigdata based analytical solutions and hands-on experience with data lakes/ data cleansing/ data management.\n\n· Ability to get Insights from Data, provide visualization, and story-telling.\n\n· Evaluate new tools and technologies to improve analytical processes\n\n· Experience working with Google Cloud platform.\n\n· Experience with Python and has used Machine Learning tools (pytorch, tensorflow, xgboost etc).\n\n· Experience using orchestration tools like Airflow.\n\n· Good to have experience or knowledge of Deep Learning, LLM.\n\n· Experience in supporting continuous improvement by investigating development alternatives.\n\n· Experience in Software Craftsmanship such as Paired Programming, Test Driven Development, DevOps etc.\n\n· Experience working with container technology, docker files, docker images, GitHub, CI/CD concepts.\n\n· Experience applying Agile practices to solution delivery.\n\n· Must be a self-starter to understand existing bottlenecks and come up with innovative solutions.\n\n· Strong communication and presentation skills, ability to share/teach others, work collaboratively with others.\n\n· Flexibility to explore and work with newer technologies and tools.\n\n· Ability to learn quickly, adapt, and set direction when faced with ambiguous scenarios.\n\nQualifications\n\n· Bachelors/Masters/PhD in Statistics / Econometrics/ Operation Research / Actuarial Science or any other quantitative\n\n· Candidates should have 7 plus years of hands-on experience with analytics projects using advanced Statistical / Econometrics / Operation Research / Actuarial or related quantitative techniques across various functions\n\n· Candidates will be expected to successfully prioritize and manage multiple analytical projects / ad-hoc requests\n\n· Good technical depth with strong analytical/programing skills and ability to apply technical knowledge to do research\n\n· Experience in Python , SQL , GCP or any other cloud platforms highly desired\n\n· Experience using Gen AI technologies.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-hcltech-4153680324?position=5&pageNum=10&refId=3OwYoZiMWUBkemlaz%2FA01Q%3D%3D&trackingId=pq7RQFhxNl2Yq8II%2FiBGOg%3D%3D"
}