{
    "job_id": "4154044145",
    "title": "Senior Analyst - Enterprise Business Excellence",
    "company": "NAB",
    "location": "Gurugram, Haryana, India",
    "description": "Purpose of the role:\n\nOE Analyst will work across a range of activities that bring process transformation, enterprise workflow and intelligent automation solutions to life for our customers. You will use your lean and agile approach together with enterprise methodologies, tools and standards to lead scoping and delivery of optimised solutions that maximise customer and business value.\nThis role works within a delivery squad, so there is an expectation that there may be movement between areas and programs of work as required. You will work closely with the Delivery Owners to ensure the solutions are successfully delivered into the business in a timely manner.\nProcess Modelling, Instructional Writing, High quality PowerPoint packs, graphic designs for packs, excel skills.\n\n\n\n\nKey Accountabilities:\n\nSupport small to medium size initiatives or support delivery of larger deliverables\nReview assigned business processes from end-to-end, and document “As is” process if not available\nWork with the Business Owners to document ‘To-Be’ process maps and artefacts to embed lasting process change.\nCreate work instructions for the business based on business processes and requirements\nData analysis and modelling, converting analysis into insights and recommendations.\nProduce high quality PowerPoint packs and support the development of other appropriate materials to communicate and present opportunities for relevant stakeholders\nStakeholder engagement,\nHelp support workshops, working with stakeholders to define process, identify current issues and develop future state process maps.\nEnsure alignment to enterprise process methodologies, frameworks, standards and tools (including Lean Six Sigma and Agile).\n\n\n\n\nEssential capabilities:\n\nGreen Belt certified and experience applying the tools\nStakeholder management skills and influencing skills.\nKnowledge of project delivery methodologies and associated tools, with working experience in Lean and Six Sigma methodologies and practices in an Agile delivery environment.\nExperience working on projects delivering changes, ideally with a business improvement focus\nAnalysis & Problem Solving with demonstrable measurement techniques.\nExperience process mapping to BPMN standards (MS Visio, Signavio), developing process documentation (Standard Operating Procedures)\nStrong presentation and facilitation skills.\nEffective communication skills with the ability to synthetise data and communicate findings in a meaningful way.\nAbility to adapt to a changing environment, present challenges with alternative solutions.\nDemonstrated application of Risk Management fundamentals.\nGrowth Mindset, comfortable with ambiguity and experimentation\nUnderstand risk, issue & dependency management.\n\n\n\n\nPreferred Experience:\n\nExperience in banking/financial sector\nExperience working with Agile methodology/projects\nAbility to work in complex environments across multiple streams/evolving timelines\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-analyst-enterprise-business-excellence-at-nab-4154044145?position=7&pageNum=15&refId=rYf7Kk8Eb63jO7gIoGSEug%3D%3D&trackingId=2rZPZDUI90KPTrjklxoCqw%3D%3D"
}