{
    "job_id": "4154780803",
    "title": "Senior Business Analyst",
    "company": "Pearson",
    "location": "Bengaluru East, Karnataka, India",
    "description": "At Pearson, we’re committed to a world that’s always learning and to our talented team who makes it all possible. From bringing lectures vividly to life, to creating interactive and engaging courseware, to creating textbooks, we are always re-examining the way people learn best, whether it’s one child in our own backyard or an education community across the globe. We are bold thinkers and standout innovators who motivate each other to explore new frontiers in an environment that supports and inspires us to always be better. By pushing the boundaries of technology — and each other to surpass these boundaries — we create seeds of learning that become the catalyst for the world’s innovations, personal and global, large and small.\n\nSummary\n\nWe are looking for a experienced Business Analyst to support the requirements gathering, development, testing, and implementation of the content authoring, development, and delivery tools and services.\n\nResponsibilities\n\nThe analyst will work as part of the project team along with working with business stakeholders (at various levels) to ensure our tools and services meet business requirements and is in alignment with Pearson vision, technology, roadmaps and/or standards. This person is expected to have a proven track record for business analysis with experience in capturing as-is and to-be business processes and implementing technologies to meet business and learner needs. They will understand the industry specifically content management and have an in depth understanding of business processes and workflows, technical standards, specifications and policies that are supported within the environment.\n\nIn this role, the person will be required to take a business centric approach and interact with business users--across all levels of the organization to ensure that Business Requirements are documented, managed, prioritized, signed off, tested and that the system is successfully adopted by the Users.\n\n\nFacilitate requirement gathering meetings via workshops, interviews, case studies and any other effective means\nIdentify, define, interpret and clarify scope of problems/issues in terms of business and/or system requirements and processes\nDocument and maintain Operational Processes including capture of As Is Processes and definition and mapping of To Be Processes (in conjunction with technology)\nCommunicate complex business needs into clear, actionable systems requirements, researches and evaluates alternative solutions.\nEvaluate design of existing systems and target core Platform to judge their functionality, effectiveness, reliability, performance, usage, maintainability and cost of ownership.\nCreate Acceptance Criteria\nCreate UAT scenarios and oversee the UAT process\nConduct Stakeholder analysis\nWork with technology development teams to enable them to define solutions\nWork with the test team to ensure requirements are understood and testable\nWork to ensure that user training needs are met\nDemonstrate understanding of technical details and solutions\nArticulate data requirements and data quality standards\nCollaborate with other analysts and project contributors to create comprehensive and cohesive solution approaches.\nSolve complex problems and support the development of innovative solutions related to the asset management platform for work in progress and archive processes for content and products; while driving for OOTB solutions and articulate pros/cons of customizations\nDeliver optimal and scalable solutions with best practice\n\n\nKey Program Challenges\n\n\nWorking in a matrixed and virtual environment\nWorking with a number of stakeholders: externally, internally and internationally\nWorking as part of a global team and thinking globally\nSome out of hours working will be required to support the global organization\nBuilding internal confidence in a situation of consistent change\nDeveloping effective solutions that not only satisfy immediate project requirements but also deliver a coherent, reusable, reliable and phased transformation of business processes enable through technology to help the business grow and change while aligning to strategic vision.\n\n\nEssential Skills And Experience\n\n\nBachelor's Degree or has relevant experience\nProfessional Qualifications / Certified Business Analyst\nAt least 5 years of proven experience in a Business Analyst role covering the end-to-end project lifecycle and all of the responsibilities above\nEducated to degree level or has relevant experience\nWorked Agile environments\nExperience with content creation, management, and development solutions\nEnterprise business solutioning experience for large corporations\nExperience with gherkin method for requirements writing\n\n\nDesired Experience\n\n\nExperience within Publishing or Media\nSpecific BA certifications\n\n\nSkills/knowledge/abilities   \n\n\nAbility to perform efficiently within a high pressure, fast-paced environment.\nExcellent problem-solving skills required\nSelf starter\nExcellent communication, leadership, organization, research, and team-work skills required\nProficient in process mapping applications\nProficient in Microsoft Office suite products\nAble to demonstrate a range of techniques to elicit requirements\n\n\nWho We Are\n\nAt Pearson, our purpose is simple: to help people realize the life they imagine through learning. We believe that every learning opportunity is a chance for a personal breakthrough. We are the world's lifelong learning company. For us, learning isn't just what we do. It's who we are. To learn more: We are Pearson.\n\nPearson is an Affirmative Action and Equal Opportunity Employer and a member of E-Verify. We want a team that represents a variety of backgrounds, perspectives and skills. The more inclusive we are, the better our work will be. All employment decisions are based on qualifications, merit and business need. All qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, gender expression, age, national origin, protected veteran status, disability status or any other group protected by law. We strive for a workforce that reflects the diversity of our communities.\n\nIf you are an individual with a disability and are unable or limited in your ability to use or access our career site as a result of your disability, you may request reasonable accommodations by emailing TalentExperienceGlobalTeam@grp.pearson.com.\n\nNote that the information you provide will stay confidential and will be stored securely. It will not be seen by those involved in making decisions as part of the recruitment process.\n\nJob: TECHNOLOGY\n\nOrganization: Corporate Strategy & Technology\n\nSchedule: FULLTIME\n\nWorkplace Type: Hybrid\n\nReq ID: 18761\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-pearson-4154780803?position=5&pageNum=90&refId=%2Bkyw8zwbzHgObrojL52nxA%3D%3D&trackingId=HtvnLVDjVtVedtK%2B%2FFB1SA%3D%3D"
}