{
    "job_id": "4154730047",
    "title": "Business Analyst",
    "company": "HyreSpree",
    "location": "Hyderabad, Telangana, India",
    "description": "Role: Developer - Business Analyst\n\nExperience: 5+ years\n\nLocation: Hyderabad ( Work from office)\n\nJob Type: Full Time Permanent position\n\nNotice Period : Immediate joiners or max 15 days\n\nRequirements\n\n\nAnalytical skills, problem-solving skills, Strong communication and domain knowledge.\nSound Knowledge in HTML,CSS, Microsoft. Net framework, Javascript, PHP, React and SQL.\nAble to create detail business analysis, outlining problems, opportunities and solutions for the business.\nExperience in Agile scrum methodologies creating user stories and estimating story points for each stories.\nExceptional analytical and conceptual thinking skills.\nWorking experience with any wireframe tools (Sketch ,Adobe, UXPin, Mockplus, JustInMind etc)\nAbility to influence stakeholders and work closely with them to determine acceptable solutions.\nMasters/Degree with a background in business, Engineering and IT with minimum 5 years working experience as business Analyst.\n\n\nResponsibilities\n\n\nHelp the product owner groom the product backlog by considering purpose, prioritizing the stories,\norganizing the stories, splitting epics into user stories, and ensuring a complete description of the\nsolution.\nStudies the software application domain, prepares software requirements, and specification\n(Software Requirements Specification) documents.\nWorks with the stakeholders to analyze and document business processes for the system to be\ndeveloped\nPerform actual analysis on requirements to consider all scenarios/exceptions that may occur\nDetermine functional requirements and features and prepare a wireframe for user interface screen\nAdvise the product owner and coach the team, as well as other business analysis considerations\nCommunicates with both the developers and stakeholders in such a manner until the project ends.\nCo-facilitate trainings/workshops client-side.\n\n\nSkills:- Business Analysis\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-hyrespree-4154730047?position=4&pageNum=95&refId=oHWbHPyc2vtOBB1ZeF%2F1RA%3D%3D&trackingId=fUKMcgj8K92mZfU5v0KUMQ%3D%3D"
}