{
    "job_id": "4154544609",
    "title": "Business Analyst",
    "company": "VeARC Technologies Private Limited",
    "location": "Bengaluru, Karnataka, India",
    "description": "We are seeking a skilled Business Analyst with a minimum of 7 years of experience in the technology sector. They will be responsible for collaborating with cross-functional teams to analyse business requirements and convert them into well-defined stories. The Business Analyst will also play a critical role in identifying and implementing innovative solutions to improve business processes.\n\n\n\n\nResponsibilities:\n\nAct as the voice of the customer/user and collaborate with internal teams to understand and document business requirements\nCreate detailed documentation of business requirements, processes, and solutions.\nTranslate requirements into technical specifications that can be easily understood by the development team\nWork with IT and other departments to implement solutions and ensure they align with business goals.\nWork with and report to CXOs to ensure that the application meets the business objectives and is aligned with the overall business strategy\nConduct research and analysis to identify and evaluate potential enhancements or new features for the application\nCollaborate with the QA team to ensure that the application meets the quality standards and Requirements\nCommunicate findings, recommendations, and project updates to stakeholders and executives.\n\n\n\n\nRequired Qualifications/Experience:\n\nBachelor’s degree in business administration, Computer Science, or a related field\nMinimum of 7 years of experience in business analyst role, with a focus on technology (.Net stack preferred)\nKnowledge on API Development desirable.\nStrong analytical and problem-solving skills\nStrong communication and interpersonal skills to effectively collaborate with cross-functional teams and with CXO leaders\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-vearc-technologies-private-limited-4154544609?position=10&pageNum=30&refId=8iL61BV3%2BLG7BSz3Qgjsxw%3D%3D&trackingId=ZZUXFZTjXGbQOHfZGFsKPA%3D%3D"
}