{
    "job_id": "4154185001",
    "title": "Data Scientist",
    "company": "Networth Corp",
    "location": "Bengaluru, Karnataka, India",
    "description": "The ideal candidate's favorite words are learning, data, scale, and agility. You will leverage your strong collaboration skills and ability to extract valuable insights from highly complex data sets to ask the right questions and find the right answers. \n\n \n\nResponsibilities\n\nSolve Real-World Problems: Dive into challenging business questions and uncover solutions using advanced analytics and machine learning.\nCreate Impact: Design predictive models and tools that help shape strategic decisions across the organization.\nWork with Cutting-Edge Tech: Leverage the latest in AI, big data, and cloud computing to process and analyze complex datasets.\nVisualize Your Vision: Build dashboards and data stories that captivate and inform stakeholders at all levels.\nCollaborate Across Teams: Partner with experts in engineering, design, and business to bring your ideas to life.\n\n\n\n\nEnvironment\n\nMeaningful Work: Work on high-impact projects that tackle real-world challenges\nOwnership & Autonomy: We empower you to take the lead on projects\nCutting-Edge Environment: Experiment with the latest technologies and methodologies in data science and AI.\nCloud Culture: Carefully crafted culture for efficiency and transparency\n\n\n\n\nQualifications\n\nBachelor's degree or equivalent experience in quantitative field (Statistics, Mathematics, Computer Science, Engineering, etc.)\nAt least 1 - 2 years' of experience in quantitative analytics or data science\nProgramming: Proficiency in Python for data analysis and machine learning.\nStatistical Analysis: Strong understanding of probability, hypothesis testing, and inferential statistics.\nMachine Learning: Experience with supervised and unsupervised algorithms, using libraries like Scikit-learn, TensorFlow, or PyTorch.\nData Wrangling: Expertise in cleaning, transforming, and preprocessing data.\nData Visualization: Ability to create impactful visuals using tools like Tableau, Power BI, or libraries like Matplotlib and Seaborn.\nSQL: Advanced querying and database management skills for relational databases.\nBig Data Tools: Familiarity with Hadoop, Spark, or similar technologies for large-scale data processing.\nCloud Platforms: Experience with AWS, Azure, or Google Cloud for data storage and deployment.\nData Engineering Basics: Knowledge of ETL pipelines and workflow orchestration tools like Apache Airflow.\nVersion Control: Proficiency in Git for collaborative development and version tracking.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-networth-corp-4154185001?position=47&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=hD9JlmaqkqaZ5OAYeljBGA%3D%3D"
}