{
    "job_id": "4154772978",
    "title": "Business Analyst",
    "company": "Aquaconx Solutions",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Description\n\nAs a Business Analyst Trainee, you will work closely with senior business analysts and cross-functional teams to analyze business processes, gather requirements, and assist in the implementation of business solutions. You will be involved in data analysis, process improvement, and problem-solving, contributing to the achievement of business objectives.\n\nKey Responsibilities:\n\n\nAssist in gathering, documenting, and analyzing business requirements from stakeholders.\nHelp in the creation of functional specifications and business process documentation.\nSupport the senior business analysts in analyzing and improving business processes.\nParticipate in data collection, interpretation, and analysis to identify trends and insights.\nCollaborate with technical teams to ensure business requirements are understood and implemented.\nAssist in the development and execution of test cases for system implementations or improvements.\nAssist in the creation of user manuals and training materials for end users.\nSupport ongoing project management tasks including project tracking, status updates, and risk management.\nParticipate in meetings with business stakeholders to understand challenges and opportunities.\nAssist in preparing reports and presentations for internal and external stakeholders.\n\n\nRequirements\n\nSkills and Qualifications:\n\n\nBachelor’s degree in Business Administration, Management, IT, or a related field (Freshers are welcome).\nStrong analytical and problem-solving skills.\nGood understanding of business processes and workflow.\nAbility to work collaboratively in a team environment.\nExcellent written and verbal communication skills.\nBasic knowledge of SQL or other data analysis tools is a plus.\nFamiliarity with Business Analysis tools (e.g., Microsoft Visio, JIRA, or similar) is a plus.\nStrong attention to detail and ability to manage multiple tasks efficiently.\n\n\nPersonal Attributes:\n\n\nEagerness to learn and grow within the business analysis field.\nStrong initiative and a proactive approach to challenges.\nAbility to work well under pressure and meet deadlines.\nStrong interpersonal skills and the ability to interact with diverse teams.\nA positive attitude and willingness to take on new responsibilities.\n\n\nRequirements\n\nRequirements: Currently pursuing or recently completed a degree in Computer Science, Software Engineering, or a related field. Basic knowledge of Python programming and its libraries (e.g., Pandas, Flask, Django, etc.). Familiarity with Git or other version control systems. Strong problem-solving skills and a keen eye for detail. Ability to work independently and collaborate in a remote team environment. Eagerness to learn, take on challenges, and improve coding skills. Good communication skills in English (both written and verbal). Preferred Skills (optional but advantageous): Familiarity with web development frameworks such as Django or Flask. Experience with databases like MySQL, PostgreSQL, or MongoDB. Understanding of REST APIs and web services. Knowledge of front-end technologies (HTML, CSS, JavaScript) is a plus.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-aquaconx-solutions-4154772978?position=1&pageNum=67&refId=6wIEzwS4x6APeTXACdRUdw%3D%3D&trackingId=7DbFLkWAeO8H1OfWrytkkw%3D%3D"
}