{
    "job_id": "4154542005",
    "title": "Data Scientist 1",
    "company": "PayPal",
    "location": "Bengaluru, Karnataka, India",
    "description": "The Company\nPayPal has been revolutionizing commerce globally for more than 25 years. Creating innovative experiences that make moving money, selling, and shopping simple, personalized, and secure, PayPal empowers consumers and businesses in approximately 200 markets to join and thrive in the global economy.\n\nWe operate a global, two-sided network at scale that connects hundreds of millions of merchants and consumers. We help merchants and consumers connect, transact, and complete payments, whether they are online or in person. PayPal is more than a connection to third-party payment networks. We provide proprietary payment solutions accepted by merchants that enable the completion of payments on our platform on behalf of our customers.\n\nWe offer our customers the flexibility to use their accounts to purchase and receive payments for goods and services, as well as the ability to transfer and withdraw funds. We enable consumers to exchange funds more safely with merchants using a variety of funding sources, which may include a bank account, a PayPal or Venmo account balance, PayPal and Venmo branded credit products, a credit card, a debit card, certain cryptocurrencies, or other stored value products such as gift cards, and eligible credit card rewards. Our PayPal, Venmo, and Xoom products also make it safer and simpler for friends and family to transfer funds to each other. We offer merchants an end-to-end payments solution that provides authorization and settlement capabilities, as well as instant access to funds and payouts. We also help merchants connect with their customers, process exchanges and returns, and manage risk. We enable consumers to engage in cross-border shopping and merchants to extend their global reach while reducing the complexity and friction involved in enabling cross-border trade.\n\nOur beliefs are the foundation for how we conduct business every day. We live each day guided by our core values of Inclusion, Innovation, Collaboration, and Wellness. Together, our values ensure that we work together as one global team with our customers at the center of everything we do – and they push us to ensure we take care of ourselves, each other, and our communities.\n\nJob Description Summary:\nWhat you need to know about the role: This Data Scientist will prepare, extract, and analyze data covering a wide range of information from user data, such as profile, platform interaction, transactional, and restriction data to employee operational data derived from investigator tools. This individual is responsible for the insights that impact the overall productivity and effectiveness of the GFCCP and will work closely with internal and external stakeholders to ensure GFCCP leaders have the reporting and analytics needed to operate effectively. Successful candidates will offer a strategic perspective, sound business judgment, deep analytical capabilities, and a collaborative working style. They will possess strong intellectual curiosity, a deep understanding of PayPal’s products and associated typologies, and have experience with PayPal data systems. Skills in problem solving, rigorous analysis, and distilling complex and voluminous data into concise summaries will be critical. The successful candidate will have exceptional interpersonal skills, the ability to manage conflicting priorities to a defined timeline, and strong project management and communication skills. Demonstrated working knowledge in SQL, dashboard development and relational database fundamentals is required. Meet our team: The Global Financial Crimes & Customer Protection (GFCCP) organization is responsible for detecting and preventing financial crimes and providing protections and remediation paths to PayPal’s customers. The Data Scientist, as a member of the Data, Infrastructure, Analytics, & Insights (DAIS) team, will support the technical analysis, development, and implementation of metrics-based reporting and visualization, including internal operational management, policy, key performance indicator, and board/committee level reporting.\n\nJob Description:\nYour way to impact:\n\nGlobal Financial Crimes and Customer Protection (GFCCP) is responsible for fulfilling PayPal’s commitment to combat money laundering, terrorism financing, and related financial crimes around the world, including sanctions enforcement. This is achieved through a global network of best-in-class investigators and specialized teams dedicated to the development and implementation of strategic policies, advanced analytics, robust reporting, and cutting-edge technology.\n\nYour day-to-day:\n\n\nExpertise in the underlying investigative processes driving the data to provide meaningful insights into the health of GFCCP\nPrepare, extract, and analyze data covering a wide range of both customer and operational data\nDesign and implement innovative reports and insightful approaches to identify business opportunities\nPartner closely with GFCCP stakeholders on envisioning new reporting and analysis opportunities while continually enhancing existing reports\nDesign and develop metrics-based internal management and leadership reporting for regular distribution\nPerform ongoing analysis of program related data (KPIs) and trends. Develop ad-hoc reports as requested to support oversight of GFCCP\nMeet regularly with global teams to communicate process changes, improve standards and procedures\nCreate and distribute reports and other essential intelligence while also providing context for trends and patterns within those reporting packages\nUse data to help management and operations identify and escalate business issues and opportunities\nWork efficiently and collaboratively in a fast-paced and deadline driven environment\nRapidly adjust to changing requirements and business environments\n\n\n\nWhat do you need to bring:\n\n\nStrong understanding in SQL and RDBMS technology. Teradata and Google BigQuery are the RDBMS in use but candidates with strong Oracle, DB2, MS SQL, MySQL etc. will be considered\nExcellent Excel skills (including pivot tables, functions, macros, charts)\nExcellent reporting and business analysis skills (experience with data/statistical analysis tools such as SAS, R, Python a plus)\nData visualization experience using an Enterprise Reporting tool like Tableau, Looker, ThoughtSpot, SSRS, Business Objects, Cognos, MicroStrategy\n4+ years of experience with database query tools, including Teradata, SQL Server, Oracle, and MySQL; along with basic understanding of data warehouse architecture\n4+ years of experience in analytics and reporting\nBS/BA degree in related field required or equivalent professional work-related experience.\nStrong communication skills and experience distilling and presenting complex quantitative analysis\nExperience with extracting data from multiple disparate sources\nStrong interpersonal skills including ability to present insights and recommendations persuasively. Skill and confidence in dealing with people at all levels of the organization are essential\nCreative problem solver, analytic thinker, and ability to learn new and complex concepts quickly\nWillingness to learn new tools and business processes\nExcellent English, both written and oral, as the role involves working as part of a global team\nGood interpersonal and organization skills\nRequires an excellent understanding of standard business practices related to Compliance processes and systems\nClear, strategic thinker with vision, with the ability to execute on priorities\n\n\n\nFor the majority of employees, PayPal's balanced hybrid work model offers 3 days in the office for effective in-person collaboration and 2 days at your choice of either the PayPal office or your home workspace, ensuring that you equally have the benefits and conveniences of both locations.\n\nOur Benefits:\n\nAt PayPal, we’re committed to building an equitable and inclusive global economy. And we can’t do this without our most important asset—you. That’s why we offer benefits to help you thrive in every stage of life. We champion your financial, physical, and mental health by offering valuable benefits and resources to help you care for the whole you.\n\nWe have great benefits including a flexible work environment, employee shares options, health and life insurance and more. To learn more about our benefits please visit https://www.paypalbenefits.com\n\nWho We Are:\n\nTo learn more about our culture and community visit https://about.pypl.com/who-we-are/default.aspx\n\nCommitment to Diversity and Inclusion\n\nPayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state, or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at paypalglobaltalentacquisition@paypal.com.\n\nBelonging at PayPal:\n\nOur employees are central to advancing our mission, and we strive to create an environment where everyone can do their best work with a sense of purpose and belonging. Belonging at PayPal means creating a workplace with a sense of acceptance and security where all employees feel included and valued. We are proud to have a diverse workforce reflective of the merchants, consumers, and communities that we serve, and we continue to take tangible actions to cultivate inclusivity and belonging at PayPal.\n\nAny general requests for consideration of your skills, please Join our Talent Community.\n\nWe know the confidence gap and imposter syndrome can get in the way of meeting spectacular candidates. Please don’t hesitate to apply.\n\nREQ ID R0122770\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-1-at-paypal-4154542005?position=4&pageNum=12&refId=C8%2Bsob%2BWGMHdmBeyzLMkdA%3D%3D&trackingId=dNFDMeXm5de5SitjB8pKSw%3D%3D"
}