{
    "job_id": "4154024563",
    "title": "Business Analyst 2-Ops",
    "company": "Oracle",
    "location": "Bengaluru, Karnataka, India",
    "description": "Job Description\n\nQualifications:\n\n\nSummarize issues and communicate them effectively in both written and oral format\nStrong understanding of how to prioritize tasks\nWork effectively as a member of a team remote\nWork in a fast-paced, high volume and time-sensitive environment\nEmbrace a continually changing environment and drive change\nManage multiple tasks/projects simultaneously\nExcellent customer service and interpersonal skills\nAttention to detail for reconciliation and research of discrepancies raised by partners\nBuild and maintain positive and productive relationships with both internal and external partners\nAble to absorb concepts day to day, outside of structured training sessions (quick learner)\nSkilled with MS Office applications; MS Excel intermediate level\nExcellent communication skills (verbal, written) in English; any other language is a plus\n\n\n\nCareer Level - IC2\n\nResponsibilities\n\nResponsibilities may include:\n\n\ngenerate revenue reports\ndetermine eligible partners\nverify attached support\nconfirm registration eligibility\nidentify eligible products\nresearch partner discrepancies\nrespond to partner questions\ncalculate incentive amounts\ncreate summary reports\ncreate payment reports\n\n\n\nAbout Us\n\nAs a world leader in cloud solutions, Oracle uses tomorrow’s technology to tackle today’s problems. True innovation starts with diverse perspectives and various abilities and backgrounds.\n\nWhen everyone’s voice is heard, we’re inspired to go beyond what’s been done before. It’s why we’re committed to expanding our inclusive workforce that promotes diverse insights and perspectives.\n\nWe’ve partnered with industry-leaders in almost every sector—and continue to thrive after 40+ years of change by operating with integrity.\n\nOracle careers open the door to global opportunities where work-life balance flourishes. We offer a highly competitive suite of employee benefits designed on the principles of parity and consistency. We put our people first with flexible medical, life insurance and retirement options. We also encourage employees to give back to their communities through our volunteer programs.\n\nWe’re committed to including people with disabilities at all stages of the employment process. If you require accessibility assistance or accommodation for a disability at any point, let us know by calling +1 888 404 2494, option one.\n\nDisclaimer:\n\nOracle is an Equal Employment Opportunity Employer*. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans’ status, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.\n\n\nWhich includes being a United States Affirmative Action Employer\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-2-ops-at-oracle-4154024563?position=8&pageNum=47&refId=al9nUfzCZGF%2B%2BRebT5L1EA%3D%3D&trackingId=JvLy56Y1jGMmbYrCahsQrQ%3D%3D"
}