{
    "job_id": "4154764183",
    "title": "Business Analyst",
    "company": "Hireginie",
    "location": "Bengaluru, Karnataka, India",
    "description": "About Our Client: Founded in 2020, the company is a digital platform in the spirituality and wellness sector, offering tailored apps to help users with personal growth and well-being. It combines technology with traditional practices to deliver engaging content and experiences that drive long-term user retention. The brand aims to cater to individuals seeking high-quality and authentic devotional products, blending traditional craftsmanship with modern convenience.\n\nJob Description: Senior Business Analyst\n\nLocation: Bangalore (HSR Layout)\n\nExperience: 2 - 4 years\n\nQualification: Bachelor’s or Master’s degree in Business Administration, Economics, Finance, Engineering, Mathematics, Statistics, or Data Science or Related field\n\nAbout the role: We are seeking a highly motivated and self-driven Business Analyst (Individual contributor role) with 2-4 years of experience in a B2C/D2C product startup. In this pivotal role, you will analyse data, generate insights, and help shape our business strategies. You will collaborate with cross-functional teams to ensure our products meet and exceed user expectations, driving growth and success.\n\nKey Responsibilities:\n\nData-Driven Insights: Analyse complex datasets to inform business strategies, optimise product performance, and support decision-making.\nUser Behaviour Analysis: Deeply understand customer behaviour and translate insights into actionable recommendations that enhance product and marketing efforts.\nCross-Functional Collaboration: Partner with product managers, marketing, and engineering teams to ensure alignment on goals and seamless execution of business strategies.\nStrategic Planning: Identify business opportunities, forecast challenges, and provide data-backed recommendations to senior management.\nKPI Management: Dene, monitor, and optimise key performance metrics across customer acquisition, retention, and overall product performance.\nMarket Research: Conduct thorough market research to stay ahead of industry trends, understand competitor strategies, and anticipate customer needs.\nProcess Improvement: Identify opportunities to streamline operations, enhancing efficiency and customer satisfaction.\n\n\n\n\n\n\n\n\n\n\nRequirements:\n\nExperience: 2-4 years as a Business Analyst in a B2C/D2C product startup or a similarly dynamic environment.\nAnalytical Excellence: Strong analytical skills with a proven ability to work with large datasets and generate meaningful insights.\nUser-Centric Mindset: A deep understanding of user behaviour, customer journeys, and the importance of customer-focused design.\nTechnical Proficiency: Skilled in data analysis tools such as SQL, Excel, and Tableau, with experience in Agile methodologies.\nStrong Communication: Ability to distill complex information into clear, actionable insights for diverse stakeholders.\nProactive Attitude: Self-starter who takes initiative, thrives in fast-paced environments, and can work independently.\nAdaptability: Comfortable navigating and excelling in a rapidly evolving, high-growth environment.\n\n\n\n\n\n\n\nAbout Hireginie: Hireginie is a prominent talent search company specializing in connecting top talent with leading organizations. We are committed to excellence and offer customized recruitment solutions across industries, ensuring a seamless and transparent hiring process. Our mission is to empower both clients and candidates by matching the right talent with the right opportunities, fostering growth and success for all.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-hireginie-4154764183?position=1&pageNum=32&refId=VFsnRMMnT7hGO1gnBq9n6A%3D%3D&trackingId=TmmU476j4Ifdf5Qf7YWOSg%3D%3D"
}