{
    "job_id": "4155855122",
    "title": "Business Analyst",
    "company": "Quantzig",
    "location": "India",
    "description": "About Quantzig:\n\nQuantzig is a global analytics and advisory firm with offices in the US, UK, Canada, China, and India. we have assisted our clients across the globe with end-to-end advanced analytics, visual storyboarding, Machine Learning, and data engineering solutions implementation for prudent decision making. We are a rapidly growing organization that is built and operated by high-performance champions If you have what it takes to be the champion with business and functional skills to take ownership of an entire project end-to-end, help build a team with great work ethic and a drive to learn, you are the one we’re looking for. The clients love us for our solutioning capability, our enthusiasm and we expect you to be a part of our growth story.\n\nFind out more about the company: https://www.quantzig.com/\n\n\n\n\nJob Description:\n\nDesignation- Business Analyst\n\nExperience- 5 to 7 Years\n\nNotice Period- 0-30days\n\nLocation- Remote\n\n\n\n\nKey Requirements:\n\nTechnical Expertise: Minimum 3 years of hands-on experience with SQL and Power BI.\nIndustry Experience: Strong background in the retail sector.\nAnalytical Skills: Proven expertise in Promo Analytics and Campaign Analysis (mandatory).\nSoft Skills: Excellent communication and stakeholder management abilities\n\n\n\n\nKey Responsibilities:\n\nStakeholder Management: o Collaborate with cross-functional teams, including business leaders, IT, and external partners, to understand and address their data needs.\nFacilitate effective communication and manage expectations with stakeholders at all levels.\nProvide training and support to stakeholders on BI tools and data interpretation.\n\n\n\n\nPower BI Dashboard Development:\n\nDesign, develop, and maintain advanced Power BI dashboards and reports that provide actionable insights.\nEnsure data accuracy and integrity by implementing robust data validation and quality checks.\nOptimize dashboard performance and user experience through best practices in data visualization and user interface design.\n\n\n\n\nData Analysis and Reporting:\n\nConduct in-depth data analysis to identify trends, patterns, and opportunities for improvement.\nDevelop and maintain comprehensive documentation of data sources, methodologies, and processes.\nPresent findings and recommendations to senior management and other stakeholders in a clear and concise manner.\n\n\n\n\nComplex Data Landscape Management:\n\nWork with large and diverse datasets from multiple sources, ensuring seamless data integration and consistency.\nImplement and manage data governance policies and procedures to maintain data security and compliance.\nUtilize advanced analytics techniques and tools to derive meaningful insights from complex data sets.\n\n\n\n\nMust have Skills:\n\nProficient in coding and creating compelling presentations for the senior stakeholders\nEasily analyzes, draws, and synthesizes important insights from complex data.\nExtremely curious and self-driven to understand business performance through data.\nAbility to translate a business or marketing question into a well-defined analytical plan that includes data requirements for technical resources to extract the necessary data.\nRapid onboarding on projects, understanding analytics goal and working with ill-defined datasets\nCommunicating technical jargon in plain English to colleagues within Data Science team and outside\nVirtual working with network of colleagues located throughout the globe\n5+ years of relevant experience\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-quantzig-4155855122?position=7&pageNum=17&refId=otcMTVij75x3rORf5Q9zLA%3D%3D&trackingId=fE50LEeOZZl2bG1odTD2Hw%3D%3D"
}