{
    "job_id": "4155803197",
    "title": "Business Analyst",
    "company": "Twixor",
    "location": "Mumbai Metropolitan Region",
    "description": "Skills:\nRequirement Gathering, Process Mapping, Problem Solving, Critical Thinking, Documentation, Stakeholder Management, BFSI, Business Analyst,\n\nCompany Overview\n\nTwixor is a pioneering IT services and consulting company headquartered in Singapore, with offices in India, serving a global clientele including several Fortune 500 companies. We specialize in enabling business transactions and customer engagement over messaging channels for industries such as banking, insurance, retail, logistics, and more. Our patented low-code Digital Process Automation platform enhances customer experiences using AI, NLP, and dynamic rich cards.\n\nJob Overview\n\nWe are seeking a Junior Business Analyst to join our team in Chennai or Mumbai. As a Business Analyst, you will play a vital role in bridging the gap between our clients and development team. This full-time position offers an exciting opportunity to contribute to digital transformation projects within diverse industries. You will be responsible for gathering requirements, analyzing processes, and proposing solutions to enhance business operations.\n\nQualifications And Skills\n\n\nStrong proficiency in requirement gathering with an ability to identify and document business needs and requirements (Mandatory skill).\nHands-on experience in the BFSI sector, demonstrating an understanding of banking, financial services, and insurance processes (Mandatory skill).\nProven expertise as a Business Analyst, with experience in analyzing business processes and recommending improvements (Mandatory skill).\nAbility to perform process mapping, highlighting areas of improvement and creating detailed documentation to support development efforts.\nSkilled in stakeholder management, ensuring effective communication and alignment between multiple teams and clients.\nCritical thinking skills to analyze complex business issues and provide sensible solutions that meet business needs.\nExcellent problem-solving capabilities, with the ability to tackle challenges systematically and propose feasible strategies.\nProficient in creating comprehensive documentation, capturing requirements, process flows, and detailed project analysis.\n\n\nRoles And Responsibilities\n\n\nCollaborate with stakeholders to gather and document detailed business requirements and specifications.\nConduct thorough analysis of existing business processes, identifying inefficiencies and recommending improvements.\nCreate detailed process maps and documentation to assist development teams in understanding project objectives and user stories.\nFacilitate effective communication between business units and technical teams to ensure alignment and successful project delivery.\nEngage in problem-solving and troubleshooting, addressing issues that arise during project execution to avoid deviations.\nSupport stakeholder management efforts, ensuring that all parties are informed and aligned throughout the project lifecycle.\nParticipate in user acceptance testing, verifying that project deliverables meet business requirements and quality standards.\nAssist in the preparation of presentations and reports for clients, conveying project outcomes and potential opportunities for further improvement.\n\n\nNotice Period: Below 30 days.\n\nWork Location: Chennai/ Mumbai\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-twixor-4155803197?position=9&pageNum=62&refId=9DAZTOuB47vYA4MZxFKVVA%3D%3D&trackingId=meNBfls2%2ButXkP16%2Bi5zJw%3D%3D"
}