{
    "job_id": "4155803826",
    "title": "Business Analyst",
    "company": "Twixor",
    "location": "Mumbai Metropolitan Region",
    "description": "Skills:\nRequirement Gathering, Process Mapping, Problem Solving, Critical Thinking, Documentation, Stakeholder Management, Business Analyst in Banking Experience, BFSI,\n\nCompany Overview\n\nTwixor is a groundbreaking company in the IT Services and IT Consulting industry, catering to businesses by enabling structured engagements over preferred social and messaging channels. With headquarters located in Singapore, Twixor's innovative offerings span across banking, insurance, retail, and more, serving a global clientele including several Fortune 500 companies. Twixor specializes in customer acquisition and engagement solutions through low-code Digital Process Automation, fostering hyper-personalized customer experiences.\n\nJob Overview\n\nTwixor is seeking a Junior Business Analyst, based in Mumbai, for a full-time position. The ideal candidate will collaborate with cross-functional teams to enhance customer journeys through insightful data analysis. This role requires experience in business analysis within the banking sector, focusing on developing strategic solutions tailored for the BFSI industry.\n\nQualifications And Skills\n\n\nRequirement Gathering (Mandatory skill): Proven expertise in collecting, analyzing, and managing business requirements to enhance process efficiency.\nBusiness Analyst in Banking Experience (Mandatory skill): Demonstrated experience in banking operations, delivering insights to improve banking processes.\nBFSI (Mandatory skill): In-depth understanding of the Banking, Financial Services, and Insurance sector to align business solutions with industry standards.\nProcess Mapping: Ability to create detailed process maps that clarify workflows, identify inefficiencies, and propose optimized solutions.\nProblem Solving: Strong problem-solving skills to address complex business challenges by developing innovative, practical solutions.\nCritical Thinking: Excellent critical thinking abilities to assess situations, define problems, and design effective solutions.\nDocumentation: Skilled in preparing clear, concise documentation to support business processes and facilitate stakeholder communication.\nStakeholder Management: Ability to efficiently manage relationships with diverse stakeholders to ensure alignment and project success.\n\n\nRoles And Responsibilities\n\n\nConduct thorough requirement gathering sessions to understand and document business needs and objectives.\nAnalyze business processes in the banking domain to identify areas for improvement and propose effective solutions.\nCollaborate with cross-functional teams to ensure seamless implementation and adherence to project timelines.\nCreate detailed process maps to provide clarity on current workflows and suggest enhancements.\nFacilitate meetings with stakeholders to discuss project status, gather feedback, and ensure alignment on deliverables.\nDevelop documentation to capture business requirements, process flows, and other critical project information.\nApply critical thinking to analyze challenges and opportunities within the BFSI sector, recommending viable solutions.\nSupport the implementation of new business processes, ensuring compliance and efficiency in line with company objectives.\n\n\nNotice Period: Preference will be given to candidates with a notice period of less than 30 days or immediate joiners\n\nWork location: Mumbai.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-twixor-4155803826?position=2&pageNum=62&refId=9DAZTOuB47vYA4MZxFKVVA%3D%3D&trackingId=oo9Z6R5%2F%2FL6Ed9lx35efeA%3D%3D"
}