{
    "job_id": "4155571732",
    "title": "Business Analyst",
    "company": "Machan Resorts LLP",
    "location": "Mumbai Metropolitan Region",
    "description": "Skills:\nDashboards, Data Analysis, Project Management, reports, Microsoft Excel, Data Modeling,\n\nob Title: Business Analyst - Resorts\n\nJob Overview\n\nAs a Business Analyst for our resort, you will be responsible for analyzing business processes, identifying opportunities for improvement, and recommending data-driven solutions to enhance operational efficiency, guest satisfaction, and profitability. You will work closely with cross-functional teams, including operations, finance, marketing, and IT, to gather requirements, conduct data analysis, and develop actionable insights and recommendations. Your analytical skills, business acumen, and ability to translate complex data into meaningful insights will be key to driving informed decision-making and strategic initiatives.\n\nResponsibilities\n\n\nData Analysis: Collect, analyze, and interpret data from various sources to identify trends, patterns, and insights related to resort operations, guest behavior, market trends, and financial performance.\nRequirements Gathering: Collaborate with stakeholders to understand business needs, define project objectives, and gather requirements for new initiatives, processes, or system enhancements.\nProcess Improvement: Evaluate existing business processes, workflows, and systems to identify inefficiencies and areas for improvement. Develop and implement strategies to optimize operations and enhance productivity.\nReporting and Dashboards: Design and develop reports, dashboards, and data visualizations to communicate key performance indicators (KPIs), metrics, and insights to stakeholders and senior management.\nFinancial Analysis: Assist in budgeting, forecasting, and financial modeling to support strategic planning, cost optimization, and revenue growth initiatives.\nProject Management: Manage projects from inception to completion, including planning, execution, monitoring, and documentation. Coordinate cross-functional teams and stakeholders to ensure project success.\nStakeholder Engagement: Build and maintain strong relationships with internal departments, vendors, and partners. Communicate findings, recommendations, and project updates effectively to drive alignment and collaboration.\nTechnology Evaluation: Evaluate and recommend technologies, tools, and solutions that can improve business processes, data analytics capabilities, and overall performance.\nContinuous Improvement: Stay updated with industry trends, best practices, and emerging technologies. Identify opportunities for innovation and continuous improvement to maintain a competitive edge.\n\n\nQualifications\n\n\nBachelor's degree in Business Administration, Finance, Economics, Information Systems, or related field. Master's degree or MBA is a plus.\nMinimum of 1-3 years of experience as a Business Analyst or similar role, preferably in the hospitality or resort industry.\nStrong analytical, problem-solving, and critical-thinking skills.\nProficiency in data analysis tools and software (e.g., Excel, SQL, Tableau, Power BI).\nKnowledge of business process modeling, project management methodologies, and best practices.\nExcellent communication, presentation, and interpersonal skills.\nAbility to work independently, manage multiple priorities, and meet deadlines in a fast-paced environment.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-machan-resorts-llp-4155571732?position=7&pageNum=70&refId=HPHgp9Y9QvXuYD8UMhcuvA%3D%3D&trackingId=dYJw3BJnuXxO4e6fv05wAA%3D%3D"
}