{
    "job_id": "4155467636",
    "title": "Business Analyst",
    "company": "IBM",
    "location": "Bengaluru, Karnataka, India",
    "description": "Introduction\n\nAt IBM Cloud, we're on a mission to transform how businesses operate through the power of AI and cloud technology. We're a team of innovators and problem-solvers, dedicated to building cutting-edge solutions that help our customers succeed.\n\nThis is an exciting opportunity to join a growing team within IBM Cloud's IaaS (Infrastructure as a Service) division. You'll play a vital role in supporting the operational excellence of our business by analyzing data, identifying trends, and driving improvements across key areas.\n\nYour Role And Responsibilities\n\nRole Summary: We are seeking a dynamic, organized, and collaborative Business Operations Specialist to enhance our internal operations. This role involves cross-functional coordination, driving operational improvements, and supporting core business functions within IBM Cloud IaaS\n\nKey Responsibilities\n\n\nSupport strategic business planning, reporting and enhancing operational efficiency.\nManage and report on key metrics, particularly focusing on headcount and recruitment data.\nFoster strong partnerships across various IaaS teams to align objectives and coordinate initiatives, ensuring clear communication and effective data management across IaaS teams .\nConsult with management to develop and refine Key Performance Indicators (KPIs) for enhanced decision-making.\nConduct ad-hoc data analysis and prepare detailed reports for the leadership team, highlighting trends and performance metrics.\nDevelop high-quality presentations to clearly communicate strategies, objectives, and performance.\nAdhere to high privacy standards, particularly concerning employee Personally Identifiable Information (PII), aligning with both IBM and international regulations.\n\n\nPreferred Education\n\nBachelor's Degree\n\nRequired Technical And Professional Expertise\n\n\n2-4 years of experience in business operations, demonstrating a track record of impactful performance.\nAdvanced proficiency in Microsoft Excel, and ability to manage large and complex datasets.\nProficient in Microsoft Power Point; capable of crafting high-quality presentations\nStrong analytical and problem-solving skills with the ability to analyze data, draw insights, and make data-driven decisions.\nExcellent communication skills, operate in a highly organized manner with strong attention to detail\nStrong time management skills with the ability to prioritize tasks and meet deadlines.\nProven ability to work independently and as part of a high-performing team.\nA strong work ethic and a passion for continuous learning.\nBachelor's degree in Business Administration, Finance, Economics, or a related field.\n\n\nPreferred Technical And Professional Experience\n\n\nExperience in data analytics and financial modeling.\nProficiency in using analytical tools and developing dashboard reports.\nUnderstanding of public cloud technologies and services (e.g., IBM Cloud, AWS, Azure, GCP).\nExperience with project management methodologies (e.g., Agile, Scrum).\nFamiliarity with financial concepts and accounting principles.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-ibm-4155467636?position=8&pageNum=87&refId=KM8cdGPQyPT7yvIRKZCULw%3D%3D&trackingId=9V18f7BXTX8bAvgukvXu9g%3D%3D"
}