{
    "job_id": "4155567289",
    "title": "Business Analyst",
    "company": "Defenzelite",
    "location": "Seoni, Madhya Pradesh, India",
    "description": "Skills:\nCross-functional Partnerships, Market Knowledge, Microsoft Excel, Business, Microsoft PowerPoint, Microsoft Outlook, Proposal Writing, Reporting Metrics,\n\nWork Mode: WFO Only\n\nPriority: Immediate / Maximum 15-Day Notice Period Acceptable\n\nInterview Rounds: 3 (HR, Technical, and Practical)\n\nWorking Days: 5 Days a Week (MondayFriday) | 9:30 AM6:30 PM\n\nLeave Policy: 8 Paid Leaves *Terms Applied\n\nNotice Period: 1 Month (Mandatory) - If Bypassed, No Relieving/Experience Letter Allotted\n\nProvisional Period: 90 Days\n\nCommitment Period (Bond): Provisional Period + 365 Days (1 Year)\n\nMotive\n\nTo seamlessly bridge the gap between developers and clients. By distilling complex ideas into clear, actionable tasks, we ensure mutual understanding and effective collaboration, turning visions into reality.\n\nResponsibility\n\n\nCollaborate with business stakeholders to understand their needs and objectives.\nGather, document, and prioritize business requirements for projects and initiatives.\nDevelop and maintain databases, data models, and reporting tools to facilitate data-driven decision-making.\nEvaluate current business processes and workflows to identify areas for improvement.\nAssist in project management activities, including project planning, tracking, and reporting.\nDocument business processes, requirements, and solutions for reference and future analysis.\nBrainstorm innovative solutions that align with client objectives.\nDemonstrate strong technical understanding and analytical thinking.\nEfficiently work on tasks and projects, maximizing productivity.\nConvince clients of the value of our services and negotiate favorable terms.\nActively listen to client concerns, requirements, and feedback.\nConduct on-site visits to gather insights and data.\nCreate compelling presentations tailored to diverse audiences.\nDevelop Standard Operating Procedures (SOPs) to optimize processes.\nPossess in-depth knowledge of Data architecture and databases.\nAdvocate for the rights and interests of both clients and the company.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-defenzelite-4155567289?position=9&pageNum=57&refId=a19Gt2bufEipNHhOPT%2FEtw%3D%3D&trackingId=9MX1ZtoBCNtnN9di%2BnTz8g%3D%3D"
}