{
    "job_id": "4155807191",
    "title": "Business Analyst",
    "company": "Infograins Software Solutions Pvt. Ltd.",
    "location": "Indore, Madhya Pradesh, India",
    "description": "Skills:\nStatistical Analysis, Machine Learning, Python Programming, Data Visualization, Predictive Modeling, Big Data, SQL, Data Mining,\n\nWe are seeking a highly skilled and detail-oriented Business Analyst to join our team. The ideal candidate will possess a blend of technical knowledge, business acumen, and communication skills, enabling them to analyze and improve business processes, collaborate with stakeholders, and ensure that our solutions meet business needs.\n\nKey Responsibilities\n\n\nRequirements Gathering & Analysis:\nCollaborate with stakeholders to gather business requirements, define project scope, and identify functional/non-functional requirements.\nCreate clear and concise Business Requirements Documents (BRD) and Software Requirements Specifications (SRS).\nConduct workshops, interviews, and surveys to ensure comprehensive understanding of business needs.\nDocumentation & Process Mapping:\nDevelop and maintain detailed documentation such as BRD, SRS, user stories, and use cases.\nCreate process maps, workflows, and diagrams to visually represent business processes and system interactions.\nEnsure proper traceability of requirements throughout the project lifecycle.\nWireframing & UI/UX Collaboration:\nCollaborate with UX/UI designers to create wireframes and mockups to visually communicate the design and functionality of proposed solutions.\nCreate low-fidelity and high-fidelity wireframes to illustrate user flows and application design.\nAssist in the development of functional specifications and user acceptance criteria based on wireframes.\nAgile Methodology & Tools:\nWork within an Agile environment, facilitating sprint planning, daily stand-ups, and retrospective meetings.\nManage user stories, backlogs, and tasks within Jira, ensuring that they are well defined, prioritized, and tracked throughout the development process.\nAssist in the development of test cases and support user acceptance testing (UAT).\n\n\nSkills And Qualifications\n\n\nTechnical Skills:\nProficient in Jira for managing tasks, user stories, and project backlogs.\nKnowledge of creating and maintaining BRD and SRS documentation.\nExperience with wireframing tools (e.g., Balsamiq, Figma, Axure, Sketch).\nFamiliarity with Agile methodologies, Scrum, and Sprint management.\nBusiness Analysis Skills:\nStrong analytical and problem-solving skills.\nExperience in process mapping and requirements analysis.\nAbility to translate business needs into technical specifications and solutions.\nStrong understanding of software development lifecycle (SDLC).\nExperience in conducting gap analysis, impact analysis, and risk assessments.\nCommunication & Collaboration:\nExcellent verbal and written communication skills.\nAbility to effectively interact with stakeholders, technical teams, and vendors.\nStrong interpersonal skills with the ability to build relationships and influence decision-makers.\nOther Skills:\nExperience with project management tools (e.g., Confluence, Trello).\nStrong attention to detail and ability to document complex information in a clear, structured manner.\nKnowledge of data analysis and visualization tools is a plus (e.g., Excel, Power BI).\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-infograins-software-solutions-pvt-ltd-4155807191?position=1&pageNum=62&refId=9DAZTOuB47vYA4MZxFKVVA%3D%3D&trackingId=vZBbO2YxJ37PlcwA%2FF4AjA%3D%3D"
}