{
    "job_id": "4155570295",
    "title": "Business Analysts",
    "company": "Money Honey Financial Services Pvt Ltd",
    "location": "Goregaon, Maharashtra, India",
    "description": "Skills:\nBusiness Analytics, Research Skills, Reports, Fact Sheets, One pager, Dividend History,\n\nRole of Business Analysts\n\nBusiness Analyst is responsible for website content, time to time research note on market and various asset class, building financial planning models, presentations for corporate activity, etc... Business analyst work long hours and must be available at any given point in time depending on development in domestic or global economy.\n\nBusiness Analyst Desk - JD\n\n\nTo update regular reports like\nFact Sheets\nOne Pager\nPerformance Snapshot\nSIP Report\nDividend History Report\nTrack daily news from newspaper and keep proper log in soft copy / Hard copies. Prepare small notes based on these reports and the same can be shared to our investors and our business development team.\nMaintain interest rate tracker for all fixed income products (Corporate FD, Bank FD, Debenture, post office schemes, etc) in soft copies\nTrack market quotes of all close ended products and debenture issues and tax free bond issues\nKeep track on forthcoming events like\nForthcoming dividend\nNew Fund Offer\nIPO List\nPublic Issues of debenture\nTrack quarterly results of all companies which are offering fixed deposit and those companies who have issued debentures to public\nEmpanelment process with respective companies wherever we wanted to engage them with business.\nProvide data/content and write up to our monthly newsletter.\n\n\nCompany Profile\n\nWe are a one-stop financial services shop, widely known for quality of its advice, personalized service and cutting-edge technology. We started our journey in 2008. Currently we are serving more than 50,000 investors with a team of 150+ members.\n\nLocation- Goregaon, Mumbai\n\nQualification - Engineering Background preferred\n\nThanks,\n\nYashaswini\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analysts-at-money-honey-financial-services-pvt-ltd-4155570295?position=9&pageNum=45&refId=UbUFWb7IHPllL5XcmhINQg%3D%3D&trackingId=3bA2yAO6UpO1W36Ewh5xbA%3D%3D"
}