{
    "job_id": "4155563522",
    "title": "Project Business Analyst",
    "company": "Revalsys Technologies",
    "location": "Hyderabad, Telangana, India",
    "description": "Skills:\nBusiness Analysis, Requirements Gathering, BRDs, FRD, User Stories, Flow Charts, Project Coordination, Agile Project Management,\n\nWe are looking for an experienced Business Analyst who identifies, researches, analyzes and writes business requirements to ensure client and market needs are met. This includes working closely with clients and internal departments to clearly understand and address business problems and issues. Responsible for delivery of projects to the client and/or internal organizations. This includes requirement discussion, project scope understanding, defining functional specifications, Liasing with the development and testing teams, completion and approval of testing, user documentation, and blended learning plans. Ensures business and system development methodologies are followed and continuously improved. This includes ensuring clients and other departments actively participate in appropriate phases of the project delivery and post and pre project support , such as requirements definition and quality inspection of design documents.\n\nExperience: 2+ years\n\nEducation: Any Graduate\n\nLocation: Hyderabad.\n\nCandidate Requirements\n\n\nA bachelors degree in business or related field or an MBA.\nA minimum of 3 years experience in business analysis or a related field.\nExceptional analytical and conceptual thinking skills.\nThe ability to influence stakeholders and work closely with them to determine acceptable solutions.\nExcellent documentation skills.\nFundamental analytical and conceptual thinking skills.\nExperience in creating BRDs, Functional specification documents, quality assurance.\nKnowledge and preferred experience in Agile/Scrum project methodologies.\nExperience creating detailed reports and giving presentations.\nCompetency in quality assurance tools and project management tools is a plus.\nExcellent planning, organizational, and time management skills.\nA history of leading and supporting successful projects.\n\n\nResponsibilities\n\n\nEvaluating business processes, anticipating requirements, uncovering areas for improvement, and developing and implementing solutions.\nStaying up to date on the latest process and IT advancements to automate and modernize systems.\nConducting meetings and presentations to share ideas and findings.\nPerforming requirements analysis.\nDocumenting and communicating the results of your efforts.\nEffectively communicating your insights and plans to cross-functional team members and management.\nGathering critical information from meetings with various stakeholders and producing useful reports.\nPerforming user acceptance testing.\nManaging projects, developing project plans, and monitoring performance.\nUpdating, implementing and maintaining procedures.\nPrioritizing initiatives based on business needs and requirements.\nManaging competing resources and priorities.\nMonitoring deliverables and ensuring timely completion of projects.\nEffective team player for managing team tasks, coordinating their work and aligning to the end deliverables and client timelines.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/project-business-analyst-at-revalsys-technologies-4155563522?position=7&pageNum=65&refId=c7sH5y8Mkcxycc0ZQ9ncOA%3D%3D&trackingId=G9idCD8iZv9KdhrJxIVXsA%3D%3D"
}