{
    "job_id": "4155588894",
    "title": "Business Analyst",
    "company": "Money Honey Financial Services Pvt Ltd",
    "location": "Mumbai Metropolitan Region",
    "description": "Skills:\nStatistical Analysis, Data Visualization, Predictive Modeling, Big Data Technologies, SQL, Data Mining, Business Analytics,\n\nKey Responsibilities\n\n\nEvaluating business processes, anticipating requirements, uncovering areas for improvement, and developing and implementing solutions.\nIdentify opportunities for process improvements to understand their needs gather detailed business requirements and contribute to ongoing optimization efforts.\nUnderstand pain points, weak links, and shortcomings in the business process.\nPropose changes to move from a manual process to a digital process.\nDesign and document the process flow of the user journey of software applications as per business needs.\nDevelop and document business process models to illustrate current and future states.\nCommunicate findings, recommendations, and project updates to stakeholders and executives.\nCreate detailed documentation of business requirements, processes, and solutions. The document should help to outline the proposed changes and the steps involved.\nWork with IT and other departments to implement solutions and ensure they align\n\n\nwith business goals.\n\n\nServe as thought leader for technical business processes, developing systems\n\n\nprototypes that promote increased efficiency and productivity on multiple levels\n\nOther Requirements\n\n\nB-Tech from the premier institute of India.(Preferred IITians). CFA certification is a plus.\nStrong working knowledge of relevant Microsoft applications and design tools.\nExperience with data visualization.\nHigh proficiency in technical writing.\nMinimum of 6 months to 1 year of experience as a Business Analyst or in a related role.\nStrong analytical and problem-solving skills.\nAbility to build logic and conceptualize various scenarios, and ability to present the findings concisely.\nExcellent reading, verbal, and written communication skills, with an ability to\n\n\ndistinguish between incomplete facts, complete facts, and wrong facts.\n\n\nProficiency in data analysis tools and techniques.\nAbility to work collaboratively with cross-functional teams.\nKnowledge of project management methodologies and tools.\nExperience with business process modeling and documentation tools.\nExperience in generating process documentation and reports.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-money-honey-financial-services-pvt-ltd-4155588894?position=10&pageNum=45&refId=UbUFWb7IHPllL5XcmhINQg%3D%3D&trackingId=cNS%2BkWXiae49JZ5kO8%2B27w%3D%3D"
}