{
    "job_id": "4155566463",
    "title": "Business Analyst Intern",
    "company": "Modus Enterprise Transformation Platform",
    "location": "Bengaluru, Karnataka, India",
    "description": "Skills:\ndocumentation skill, design skill, BRD, FSD, microsoft office 365, power portal,\n\nJob Description\n\nGreetings form Modus ETP!!\n\nWe are UK based Management Consulting firm providing management consulting and Enterprise Transformation Platform solutions to various businesses across multiple industries and countries.\n\nWe are hiring Business Analyst to work across UK and US client projects.\n\nRole Description\n\nOutstanding verbal, presentation, and written communication skills.\n\nStrong knowledge in Dynamics 365\n\nExperience in researching, requirements capturing, documenting and optimizing the applications.\n\nDocumentation Skill\n\nKey role in deriving Functional change form proposed business changes and preparing Functional Specification document (FSD).\n\nResponsible for developing documents like, BRD\n\nGood Testing skills\n\n\nSolid understanding of Microsoft technology and its application in enterprise environments.\nKnowledge of Microsoft Power Portal\nAbility to interact with and lead international teams.\nStrong conflict resolution and negotiation skills\nExcellent documentation skills.\nFundamental analytical and conceptual thinking skills.\nExcellent problem-solving skills, with a demonstrated ability to identify and solve problems\nExperience creating detailed reports and giving presentations.\nCompetency in Microsoft applications including Word, Excel, and Outlook.\nA track record of following through on commitments.\nExcellent planning, organizational, and time management skills.\nGood to have\nknowledge on Project Planning\nKnowledge on Microsoft Project.\nknowledge on Sharepoint\nknowledge on Microsoft Office 365 (Excel, Word, Powerpoint)\nAbility to problem solve and apply methodologies\nKnowledge of proper requirements specification and development\nKnowledge of Power Portal\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-intern-at-modus-enterprise-transformation-platform-4155566463?position=5&pageNum=47&refId=al9nUfzCZGF%2B%2BRebT5L1EA%3D%3D&trackingId=ZYDsNmQ5V73x805MUG0NoA%3D%3D"
}