{
    "job_id": "4156898373",
    "title": "Business Analyst",
    "company": "StatusNeo",
    "location": "India",
    "description": "About Us:\n\nAt StatusNeo, we are committed to redefining the way businesses operate. As a leader in digital transformation, we leverage cutting-edge technologies and innovative strategies to empower organizations around the globe. Our partnerships with industry giants and our commitment to continuous learning and improvement provide an unparalleled platform for professional growth. Embrace a career at StatusNeo, where we value diversity, inclusivity and foster a hybrid work culture.\n\n\n\n\nPosition: Business Analyst\n\nLocation: India\n\nType: Full-time, Remote\n\n\n\n\nResponsibilities:\n\nAnalyze business processes and workflows to identify areas for improvement and optimization.\nGather, document, and validate business requirements from stakeholders.\nDevelop detailed business and functional specifications for new systems and processes.\nCollaborate with cross-functional teams, including IT, operations, and management, to implement solutions.\nConduct data analysis to support business decisions and identify trends.\nPrepare and deliver reports, presentations, and recommendations to stakeholders.\nAssist in project management tasks, including planning, scheduling, and tracking project progress.\nSupport the development and implementation of business strategies and initiatives.\nPerform user acceptance testing (UAT) and ensure that solutions meet business needs.\nStay up-to-date with industry trends and best practices to provide insights and recommendations.\n\n\n\n\nQualification\n\n1 year of professional experience as a Business Analyst or in a similar role.\nBachelor’s degree in Business Administration, Information Technology, or a related field.\nStrong analytical and problem-solving skills.\nProficiency in data analysis tools and techniques (e.g., Excel, SQL).\nExcellent communication and interpersonal skills.\nAbility to document and translate business requirements into technical specifications.\nBasic understanding of project management principles.\nDetail-oriented with strong organizational skills.\nAbility to work independently and as part of a team.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-statusneo-4156898373?position=9&pageNum=5&refId=lj%2BaylP9Zxb0xcLPbmF98Q%3D%3D&trackingId=Qi6eqXa5PmGXDSjdlDX%2Bag%3D%3D"
}