{
    "job_id": "4156286200",
    "title": "Manager Business Analyst",
    "company": "Conduent",
    "location": "Bengaluru, Karnataka, India",
    "description": "Through our dedicated associates, Conduent delivers mission-critical services and solutions on behalf of Fortune 100 companies and over 500 governments - creating exceptional outcomes for our clients and the millions of people who count on them. You have an opportunity to personally thrive, make a difference and be part of a culture where individuality is noticed and valued every day.\n\n\nSupervises Individual Contributors, production and teams to ensure monthly deliverables are met based on service level agreement.\nFacilitates development, coaches, mentors, interviews and resolves conflicts and conducts performance evaluations\nReviews and approves journal entries and account reconciliations.\nProvides commentary and support explanations for monthly and quarterly results of the company.\nPerforms as Account Controller or SME for a specific business unit or centralized process.\nEnsures project financials are in compliance with customer contracts, accounting standards, companies policies, SOX and other accounting related guidance.\nLiaises with Finance, Operations and functional peer managers on matters that impact financial information.\n\n\nConduent is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity, gender expression, sex/gender, marital status, sexual orientation, physical or mental disability, medical condition, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law.\n\nPeople with disabilities who need a reasonable accommodation to apply for or compete for employment with Conduent may request such accommodation(s) by submitting their request through this form that must be downloaded: click here to access or download the form. Complete the form and then email it as an attachment to FTADAAA@conduent.com. You may also click here to access Conduent's ADAAA Accommodation Policy.\n\nAt Conduent we value the health and safety of our associates, their families and our community. For US applicants while we DO NOT require vaccination for most of our jobs, we DO require that you provide us with your vaccination status, where legally permissible. Providing this information is a requirement of your employment at Conduent.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/manager-business-analyst-at-conduent-4156286200?position=3&pageNum=65&refId=c7sH5y8Mkcxycc0ZQ9ncOA%3D%3D&trackingId=z9wJqYej9KLLGzEj0NxxqA%3D%3D"
}