{
    "job_id": "4156722950",
    "title": "Senior Analyst - Strategy",
    "company": "Awfis Space Solutions Limited",
    "location": "Delhi, Delhi, India",
    "description": "Department: Corporate Strategy & Analytics\n\nDesignation: Senior Analyst\n\nPosition Overview\n\nThe Senior Analyst will work closely with the senior leadership and cross-functional teams to drive business growth strategies, financial modelling, data-driven insights, and investor communications. The role requires strong analytical, financial, and problem-solving skills to support strategic decision-making and improve business performance.\n\nKey Responsibilities: Strategic Planning & Execution\n\n\nConduct financial and strategic analyses, including revenue projections, cost analysis, market benchmarking, and pricing evaluations.\nBuild and evaluate financial models to assess project feasibility and business impact, driving strategic decision-making.\nCoordinate with different business units to advance strategic initiatives while pinpointing opportunities to boost operational efficiency and enhance processes.\n\n\nData Analytics\n\n\nGather, structure, and maintain data as per evolving business needs.\nAnalyze company-wide data to generate actionable insights for process improvements, revenue growth, and customer satisfaction.\nSupport ad-hoc strategic projects by delivering timely, data-driven insights to stakeholders across the organization.\n\n\nInvestor & Business Reporting\n\n\nPrepare reports, presentations and other materials for investor meetings and industry events.\nMaintain and prepare monthly business reports to track company performance.\nPrepare presentations and dashboards that clearly communicate findings, insights, and recommendations to senior management.\n\n\nMarket & Competitive Analysis\n\n\nConduct comprehensive market research to understand industry trends, customer behavior, and competitive dynamics.\nAnalyze competitor strategies and performance to identify potential opportunities and risks.\n\n\nRequired Qualifications & Skills: Education & Experience:\n\n\nBachelors degree from a Tier-1 college (preferred majors: Economics, Engineering, Business, Statistics, Mathematics).\n1-2 years of relevant experience in corporate strategy, management consulting, business analysis, or a related field.\n\n\nTechnical Skills:\n\n\nAdvanced MS Excel skills ability to structure and perform analysis independently.\nProficiency in MS PowerPoint and MS Word to create professional presentations and reports.\nStrong grasp of financial concepts and numerical analysis.\nAbility to manage large datasets and extract meaningful insights.\nExperience in data handling, market research, and business intelligence tools (preferred).\n\n\nSoft Skills & Competencies:\n\n\nStrong analytical and problem-solving abilities.\nStrong interpersonal and communication skills for cross-functional collaboration.\nAbility to work in a fast-paced environment with minimal supervision.\nDetail-oriented, proactive, and highly motivated.\n\n\nFor more information about our company's background and to learn more about our management team refer to the links below:\n\n\nWebsite: www.awfis.com\nLinkedIn: https://www.linkedin.com/company/awfis\n\n\nLocations: Delhi\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-analyst-strategy-at-awfis-space-solutions-limited-4156722950?position=10&pageNum=87&refId=KM8cdGPQyPT7yvIRKZCULw%3D%3D&trackingId=mOJeEabgSGgqZhK6Dh666g%3D%3D"
}