{
    "job_id": "4156898690",
    "title": "Business Analyst - Presales",
    "company": "Dev Technosys HR",
    "location": "Jaipur, Rajasthan, India",
    "description": "We seek a skilled Business Analyst—presales to join our dynamic team in Jaipur, India. In this role, you will connect our clients with our technical teams, translating business requirements into effective solutions. You will also play a crucial role in the presales process, helping us win new business and expand our client base.\n\n\nEngaging with clients directly - driving initial scope discussions as well as working with the delivery and sales team on quotes and proposal\nSchedule and lead workshops with the client to understand, define and document their business requirements\nProvide quality proposals that articulate the customer's needs and fulfil the customer's requirements.\nCollaborate with the Solution Architect and other team members to confirm the solution design approach for the project\nInvolved in preparing presentations for prospective clients for positioning the company's services & offerings.\nWork closely with sales teams in the pursuit of new business\n5+ years’ experience as a business analyst or as a presales consultant\nExperience with Commerce, Marketing or CRM software implementation\nExcellent written and verbal communication skills\nAbility to set priorities and meet deadlines in a dynamic, autonomous environment\nAbility to work in a highly dynamic team and fast-paced environment with continuous challenges\n\n\nSkills: stakeholder management,commerce software,proposal writing,it & business strategy alignment,communication,brd,solution design,pre-sales consulting,client engagement,business analysis,presentation skills,analytical thinking,presales,frd,marketing software,crm software implementation,business requirements,team collaboration,pre-sales,it sales\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-presales-at-dev-technosys-hr-4156898690?position=6&pageNum=52&refId=45I0DUvCFXw1ux4xI%2B7zbg%3D%3D&trackingId=%2FmNq4%2B%2Fvn8THjDo1PiwysQ%3D%3D"
}