{
    "job_id": "4156123361",
    "title": "Machine Learning Engineer",
    "company": "Infinite Locus",
    "location": "Gurugram, Haryana, India",
    "description": "Role: Data Scientist / Machine Learning Engineer\n\nLocation: Cybercity, Gurugram (Onsite)\n\nWorking Days: Monday - Saturday\n\nAbout Infinite Locus\n\nInfinite Locus focuses on helping its customers across the value chain of their Information Technology landscape. We believe in the meaningful outcomes driven through simplified processes, effective technologies and scalable architectures. This helps streamline TCO overtime, and enables agile, continuous innovation. Read more here: www.infinitelocus.com\n\nRole Summary\n\nInfinite Locus is seeking a skilled Machine Learning Engineer to build and enhance our Data Science capabilities. In this role, you will lead the end-to-end implementation of ML initiatives, working closely with stakeholders to identify opportunities and drive data science projects that align with business goals.\n\nKey Responsibilities\n\n● Develop and deploy scalable ML solutions, ensuring efficient model development, validation, and implementation processes.\n\n● Collaborate with stakeholders to identify and translate business opportunities into impactful data science projects.\n\n● Mentor and manage the Data Science team, fostering a collaborative environment and a high-quality data culture.\n\n● Advocate for Data Science practices within the organization, sharing insights, case studies, and best practices.\n\n● Work with software engineering teams to design experiments, implement models, and develop new features.\n\n● Continuously explore new data sources, tools, partners, and infrastructure to enhance Data Science capabilities.\n\nQualifications and Skills\n\n● Proficiency in Python and machine learning frameworks like XGBoost, scikit-learn, PyTorch, and TensorFlow.\n\n● Experience with techniques such as regression, classification, and natural language processing (NLP).\n\n● Strong knowledge of MLOps practices, including model deployment, monitoring, optimization, and interpretability.\n\n● Excellent problem-solving skills and the ability to think creatively and strategically.\n\n● Self-motivated and results-oriented with the ability to manage multiple projects effectively.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/machine-learning-engineer-at-infinite-locus-4156123361?position=4&pageNum=15&refId=YOJOA8ecJcY65rMZmx6Etg%3D%3D&trackingId=0RY%2FgNyIfcjCs0qS3HWe7w%3D%3D"
}