{
    "job_id": "4156896624",
    "title": "Artificial Intelligence Researcher",
    "company": "Infosys",
    "location": "Bangalore Urban, Karnataka, India",
    "description": "Location: India (Multiple Locations)\n\nJob Type: Full-time\n\nIntroduction: We are looking for a passionate and talented Researcher to join Infosys Applied AI research team. As an Researcher, you will work on architecting, building, refining, and optimizing state-of-the-art Models that drive cutting-edge multi-modal, multi-domain understanding and generation capabilities. If you have experience building LLM/SLM/Multimodal models, we would love to hear from you.\n\nKey Responsibilities:\n\nDesign, develop, and train transformer-based models for multiple-modality to support a variety of AI-powered applications.\nExperiment with various architectures, training techniques, and optimization methods to improve the model’s understanding and generative capabilities.\nInnovate robust and scalable architectures to accommodate the future requirements.\nTroubleshoot and debug model issues, ensuring the models remain robust and adaptable.\n\nQualifications:\n\nExperience- 8+ yrs\n\nMaster’s degree or PhD in Computer Science, Artificial Intelligence, Machine Learning, or related fields (Ph.D. preferred).\nProven experience in training models (both text and multi-modal models).\nStrong knowledge of transformer architectures and their underlying principles.\nExperience with model pre-training, finetuning and distributed training.\nOne or more scientific publication submissions for conferences, journals, or public repositories (e.g., ICML, ICLR, NeurIPS).\n\nWhy Join Us?:\n\nWork with an innovative team on cutting-edge projects that are pushing the boundaries of artificial intelligence.\nOpportunity to grow professionally and contribute to groundbreaking advancements in NLP and AI.\nCompetitive compensation and benefits package.\n\nBangalore preferred but flexible on Location Flexible work environment,\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/artificial-intelligence-researcher-at-infosys-4156896624?position=2&pageNum=20&refId=BnXhiVGngDlsLf9MWrlaFw%3D%3D&trackingId=ax9yfaDY7ngv95pdkBsHUg%3D%3D"
}