{
    "job_id": "4156458356",
    "title": "Data Scientist",
    "company": "BNP Paribas CIB",
    "location": "Mumbai, Maharashtra, India",
    "description": "As a Data Scientist on our team, you can expect to work on challenging projects, collaborate with stakeholders to identify business problems, and have the opportunity to learn and grow with our team. A typical day may involve working on model development, meeting with stakeholders to discuss project requirements/updates, and brainstorming/debugging with colleagues on various technical aspects.\n\nAt the Lab, we're passionate about staying at the forefront of AI research, bridging the gap between research & industry to drive innovation and to make a real impact on our businesses..\n\nResponsibilities\n\n1. Develop and maintain AI models from inception to deployment, including data collection, analysis, feature engineering, model development, evaluation, and monitoring.\n\n2. Identify areas for model improvement through independent research and analysis, and develop recommendations for updates and enhancements.\n\n3. Working with expert colleagues and business representatives to examine the results and keep models grounded in reality.\n\n4. Documenting each step of the development and informing decision makers by presenting them options and results.\n\n5. Ensure the integrity and security of data.\n\n6. Provide support for production models delivered by the Mumbai team but potentially as well for other models to any of the Asian/EU/US time zones.\n\n\n\n\nQualifications\n\n\n\n\nBachelors / Master / PhD degree in Computer Science / Data Science / Mathematics / Statistics / relevant STEM field.\n\n2. Knowledge of key concepts in Statistics and Mathematics such as Statistical methods for Machine learning, Probability Theory and Linear Algebra.\n\n3. Experience with Machine Learning & Deep Learning concepts including data representations, neural network architectures, custom loss functions.\n\n4. Proven track record of building AI model from scratch or finetuning on large models for Tabular or/and Textual data.\n\n5. Programming skills in Python and knowledge of common numerical and machine-learning packages (like NumPy, scikit-learn, pandas, PyTorch, transformers, langchain).\n\n6. Ability to write clear and concise code in python.\n\n7. Intellectually curious and willing to learn challenging concepts daily.\n\n8. Knowledge of current Machine Learning/Artificial Intelligence literature.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-bnp-paribas-cib-4156458356?position=48&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=%2FZXFRfSUur7rBrnZrmR4TA%3D%3D"
}