{
    "job_id": "4156958826",
    "title": "Senior Data Scientist",
    "company": "Siemens",
    "location": "Greater Bengaluru Area",
    "description": "Hello Talented Techie!\n\n\n\n\nWe provide support in Project Services and Transformation, Digital Solutions and Delivery Management.\n\n\n\n\nWe offer joint operations and digitalization services for Global Business Services and work closely alongside the entire Shared Services organization. We make optimal use of the possibilities of new technologies such as Business Process Management (BPM) and Robotics as enablers for efficient and effective implementations around the globe.\n\n\n\n\nWe are looking for Sr Data Scientist:\n\n\n\n\nUnderstand customer challenges and suggest them actionable insights with clear business benefit of the proposed solution\nWork with large, complex data sets and applying advanced analytical methods as needed\nDevelop deployable machine learning solutions that address the real root cause\nInteract with multiple stakeholders (from different levels) and effectively present findings by exploiting visual displays of complex quantity information in a simplified way\nBe the partner of choice regarding technology advisory for advanced analytics\nActively and proactively perform market/trend scouting to stay up to date on the state-of-the-art technologies.\n\n\n\n\nYou’d describe yourself as:\n\n\n\n\nKnowledge in advanced data analytics/data science\nHave five years of relevant experience with data science/optimization/statistical models\nBachelor’s degree in a quantitative discipline (e.g., Statistics, Operations Research, Bioinformatics, Economics, Computational Biology, Compute Science, Mathematics, Physics, Electrical Engineering, Industrial Engineering) or related field\nUnderstand the mathematics/optimization behind machine learning algorithms\nSkilled in applying algorithmic models and are well acquainted with the properties and limits of a diverse set of established as well as state-of-the-art models, as well as validating the model results against the stated business objectives\nKnow-how on Extract, Transform and Load (ETL) of Big Data in enterprise environments (e.g., SAP, Oracle), cloud infrastructure (e.g., AWS, Azure), as well as familiarity of data architecture requirements and conceptual approaches for deploying algorithmic solutions in Big Data productive environments\nComfortable working in programming languages like SQL, Python and R, as well as with frameworks like Tensorflow and Keras; experience developing solutions in distributed teams using Version Control tools like GIT\nExperience with cloud technologies: AWS Sagemaker, Lambda etc.\nStay abreast of new technologies in artificial intelligence and digitalization and seek creative ways of applying emerging and state-of-the-art algorithmic approaches in real world business applications\nOutstanding analytical and conceptual skills and an entrepreneurial mindset\nExperience on collecting business requirements and traduce it into solution designs\nVery good communication and presentation skills\n\n\n\n\nReady to unlock the full potential of technology? Join us!\n\n\n\n\nThis role is based in Bangalore. But you’ll also get to visit other locations in India and globe, so you’ll need to go where this journey takes you. In return, you’ll get the chance to work with teams impacting entire cities, countries and the shape of things to come.\n\n\n\n\nWe’re Siemens. A collection of over 379,000 minds building the future, one day at a time in over 200 countries. We're dedicated to equality and we welcome applications that reflect the diversity of the communities we work in. All employment decisions at Siemens are based on qualifications, merit and business need. Bring your curiosity and creativity and help us craft tomorrow.#GBSDS\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-data-scientist-at-siemens-4156958826?position=2&pageNum=22&refId=Q8Kf9AiV%2Bqa0LUasfvZQ2A%3D%3D&trackingId=tFKHKdpd4zu9oVW%2FKkbaYA%3D%3D"
}