{
    "job_id": "4156898083",
    "title": "Business Analyst Intern",
    "company": "Jar",
    "location": "Bengaluru, Karnataka, India",
    "description": "What is Jar?\n\nThe Jar app is a habit-building micro-savings platform that helps users save fixed amounts from as little as ₹10 in 24K digital gold. Our users also have the option to convert these savings to cash or physical gold at their convenience.\n\nJar also effortlessly facilitates investments by enabling users to save while they spend, utilizing our round-off method, like a digital piggy bank.\n\nFounded by Misbah Ashraf, former founder of community-focused e-commerce platform Marsplay, and Nishchay AG, former director and founding member at mobility start-up Bounce, Jar's unwavering mission is to shatter psychological barriers to saving and investing, thus spearheading the Financial Fitness revolution for Bharat.\n\nAt Jar, we believe that savings are just the beginning for our customers. We want to walk alongside them through every step of their financial journey, which is why we have now expanded our offerings to meet those needs.\n\nOur Offerings\n\nJar Ready Cash\n\nJar Ready Cash is Jar's loan product with a 100% digital journey, no paperwork, and quick disbursals so that customers can access credit conveniently. With flexible repayments and help just a click away, customers don't have to break their savings when an emergency comes calling.\n\nNek\n\nNek is an affordable luxury jewelry brand that is powered by Jar. It is the culmination of what we know best; affordability, the value of gold, and crafting incredible connections. Nek's wide collection of silver and gold jewelry is made with meticulous artisanship to celebrate you and find the magic in every occasion.\n\nResponsibilities\n\n\nDevelop and optimize in-app engagement strategies using Plotline and Clevertap, iterating to improve user interaction.\nAnalyze A/B experiments and product features, translating data into actionable insights for product and business teams.\nEnsure data accuracy through event testing, manual validation, and collaboration with tech teams to resolve data issues.\nMaintain trackers, perform quantitative analysis, and assist in data-driven decision-making.\nSupport Product Managers and Business teams, identifying new opportunities and driving innovation through insights.\nUtilize Python and Excel for reporting and advanced data analysis.\n\n\nWhat are we looking for?\n\n\nEducation: Bachelor's in Engineering, Math, Statistics, or related field; or an MBA from a reputed institute.\nTechnical Skills: Strong proficiency in Excel and basic knowledge of Python.\nAbility to adapt quickly in a fast-paced startup environment.\nPassion for learning and exploring product analytics tools.\nA creative mindset for engagement strategies and user communications.\n\n\nFrom The Founders' Desk\n\nAs founders, we take a great deal of pride in how far Jar has come as a company, not just in terms of the product and service we have built, but because of the many incredible people who have trusted us and joined us on our journey. At Jar, we're working on solutions that could positively impact over 400 million Indians who find themselves stalled on their financial journey.\n\nIt's not something we can solve alone; it takes the collective effort and innovation of a great number of people to do that. It's only natural, then, that we look for problem solvers and collaborators, people who fail fast, learn just as quickly from those failures and boldly offer unconventional insight and perspective when faced with challenges.\n\nWe know that the next great idea can come from anyone and we strive to foster the kind of environment where those ideas get carried to execution without losing their greatness. No matter what their stint at Jar was like, we want our team to look back on it and feel like they learned, grew and succeeded, just as Jar did. If that sounds a little scary, a little difficult, but also interesting and exciting, then you'll probably fit right in.\n\nWhy join Jar, you ask?\n\nJar is a diverse and inclusive workplace that embraces the ideas and perspectives of all employees, and recognises their efforts and contributions regardless of ethnicity. Our workspace also boasts a great blend of youth and experience, which helps us maintain a transparent culture with no micromanagement. We also have flexible working hours, and provide medical insurance to all employees.\n\nNote: This is a paid internship.\n\nSkills: excel,business analysis,a/b experiments,high-level analysis,python,tech teams collaboration,data analysis,event testing,analysis reports,quantitative analysis,data maintenance\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-intern-at-jar-4156898083?position=4&pageNum=5&refId=lj%2BaylP9Zxb0xcLPbmF98Q%3D%3D&trackingId=szOuSAd8tmxHRR7Xz6lgHg%3D%3D"
}