{
    "job_id": "4156112615",
    "title": "Data Scientist",
    "company": "AB InBev GCC India",
    "location": "Bengaluru, Karnataka, India",
    "description": "AB InBev GCC was incorporated in 2014 as a strategic partner for Anheuser-Busch InBev. The center leverages the power of data and analytics to drive growth for critical business functions such as operations, finance, people, and technology. The teams are transforming Operations through Tech and Analytics.\n\nDo You Dream Big?\n\nWe Need You.\n\n\n\n\nJob Description\n\nJob Title: Data Scientist\n\nLocation: GCC Bengaluru\n\nReporting to: Sr. Program Manager\n\n\n\n\n1.Purpose of the role\n\n\n\n\nAnheuser-Busch InBev (AB InBev)’s Supply Analytics is responsible for building competitive differentiated solutions that enhance brewery efficiency through data-driven insights. We optimize processes, reduce waste, and improve productivity by leveraging advanced analytics and AI-driven solutions.\n\nAs a Data Scientist you will work at the intersection of\n\nConceptualize the analytical solution for the business problem by implementing statistical models and programming techniques\nApplication of machine learning solutions.\nBest in class cloud technology & micro-services architecture.\nUse DevOps best practices that include model serving, data & code versioning.\n\n\n\n\n2. KEY TASKS AND ACCOUNTABILITIES\n\n\n\n\nWhat will you do?\n\nDevelop and fine-tune Gen AI models to solve business problems, leveraging LLMs, and other advanced AI techniques\nDesign, implement, and optimize AI-driven solutions that enhance automation, efficiency, and decision-making\nWork with cloud-based architectures to deploy and scale AI models efficiently using best-in-class microservices.\nApply DevOps and MLOps best practices for model serving, data and code versioning, and continuous integration/deployment\nCollaborate with cross-functional teams (engineering, business, and product teams) to translate business needs into AI-driven solutions\nEnsure model interpretability, reliability, and performance, continuously improving accuracy and reducing biases\nDevelop internal tools and utilities to enhance the productivity of the team and streamline workflows\nMaintain best coding practices, including proper documentation, testing, logging, and performance monitoring.\nStay up to date with the latest advancements in Gen AI, LLMs, and deep learning to incorporate innovative approaches into projects.\n\n\n\n\nWho are we looking for?\n\nAcademic degree in, but not limited to, Bachelors or master's in computer application, Computer science, or any engineering discipline.\nBeyond academic degrees, we give more weightage to 3-6 years of real-world experience to develop scalable & high-quality software.\n\n\n\n\n3. Qualifications, Experience, Skills\n\n\n\n\nYou should have expertise in the following:\n\nProgramming Languages: Proficiency in Python\nMathematics and Statistics: Strong understanding of linear algebra, calculus, probability, and statistics.\nMachine Learning Algorithms: Knowledge of supervised, unsupervised, and reinforcement learning techniques.\nNatural Language Processing (NLP): Understanding of techniques such as tokenization, POS tagging, named entity recognition, and machine translation.\nLLMs: Experience with Langchain, inferring from LLMs and fine tuning LLMs for specific tasks, Prompt Engineering\nData Preprocessing: Skills in data cleaning, normalization, augmentation, and handling imbalanced datasets.\nDatabase Management: Experience with SQL and NoSQL databases like MongoDB and Redis.\nCloud Platforms: Familiarity with Azure and Google Cloud Platform.\nDevOps: Knowledge of CI/CD pipelines, Docker, Kubernetes\n\n\n\n\nFew skills in addition that will make you stand out…\n\n\n\n\nAPIs: Experience with FastAPI or Flask\nSoftware Development: Understanding of software development lifecycle (SDLC) and Agile methodologies.\n\n\n\n\nAnd above all of this, an undying love for beer!\n\nWe dream big to create a future with more cheers.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-ab-inbev-gcc-india-4156112615?position=23&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=LnK5QhiKh89u%2FocNI%2FHUjA%3D%3D"
}