{
    "job_id": "4156949559",
    "title": "Machine Learning Engineer – Recommendation Systems",
    "company": "Kuku FM",
    "location": "Bengaluru, Karnataka, India",
    "description": "As a Machine Learning Engineer, you will design and optimize recommendation algorithms for our Audio Stories and Podcasting Platform. You’ll work on ML pipelines, model deployment, and real-time inference systems to enhance personalized content discovery.\n\nResponsibilities\n\n\nModel Development: Build and optimize recommendation models for content ranking and retrieval.\nMLOps & Deployment: Develop scalable ML pipelines for training, deployment, and monitoring.\nSystem Design: Architect real-time inference systems with high availability and low latency.\nData-Driven Insights: Analyze user interactions to improve recommendation strategies.\nCollaboration: Work closely with engineering, product, and data teams to align ML initiatives with business goals.\n\n\nRequirements\n\n\nExperience: 3-4 years in Machine Learning, focusing on recommendation systems.\nTechnical Skills:\nExpertise in Python, SQL, PyTorch, TensorFlow\nStrong understanding of ranking algorithms, deep learning, and MLOps\nExperience with real-time ML serving architectures\nBusiness Impact: Proven ability to deliver measurable improvements in user engagement through ML solutions.\nBonus:\nExperience in OTT platforms\nPublications or patents in recommendation systems\n\n\nWhy Join KUKU?\n\n\nStock Options – Own a part of the company based on performance.\nGreat Team – Work with smart, ambitious people.\nBig Impact – Entertain over 4 million customers monthly.\n\n\nAbout KUKU\n\nFounded in 2018, KUKU is India’s leading storytelling platform, offering a vast digital library of audio stories, short courses, and vertical microdramas. We deliver immersive entertainment and education through our OTT platforms: Kuku FM, Guru, Kuku TV, and more. With a mission to deliver high-quality, personalized stories across genres from entertainment across multiple formats and languages, KUKU continues to push boundaries and redefine India’s entertainment industry.\n\n📢 Ready to make an impact? Apply now!\n\nSkills: algorithms,mlops,ranking algorithms,ml,sql,python,machine learning,tensorflow,recommendation systems,pytorch,deep learning\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/machine-learning-engineer-%E2%80%93-recommendation-systems-at-kuku-fm-4156949559?position=4&pageNum=22&refId=Q8Kf9AiV%2Bqa0LUasfvZQ2A%3D%3D&trackingId=UwbURXAV2nCZew1br70mVw%3D%3D"
}