{
    "job_id": "4157189771",
    "title": "KPMG India - Business Analyst - Consultant & Assistant Manager - Mumbai",
    "company": "KPMG India",
    "location": "Mumbai, Maharashtra, India",
    "description": ">> OVERVIEW\n\n\n\n\nKPMG is a global network of independent member firms offering audit, tax, and advisory services. The firms work closely with clients, helping them to mitigate risks and grasp opportunities.\n\nMember firms' clients include business corporations, governments and public sector agencies and not-for-profit organizations. They look to KPMG for a consistent standard of service based on high order professional capabilities, industry insight and local knowledge.\n\nKPMG member firms can be found in 152 countries. Collectively they employ more than 189,000 people across a range of disciplines.\n\n\n\n\nSustaining and enhancing the quality of this professional workforce is KPMG's primary objective. Wherever our firms operate, we want them to be no less than the professional employers of choice.\n\nKPMG was established in India in September 1993 and has rapidly built a significant competitive presence in the country. The firm operates from its offices in Ahmedabad, Bengaluru, Chandigarh, Chennai, Gurugram, Hyderabad, Kochi, Kolkata, Mumbai, Noida, Pune and Vadodara, and offers its clients a full range of services, including financial and business advisory, tax and regulatory, and risk advisory services.\n\nIn India, KPMG has a client base of over 2700 companies. The firm's global approach to service delivery helps provide value-added services to clients. The firm serves leading information technology companies and has a strong presence in the financial services sector in India while serving a number\n\nof market leaders in other industry segments.\n\n\n\n\nOur differentiation is derived from a rapid performance-based, industry-tailored and technology-enabled business advisory services delivered by some of the leading talented professionals in the country. KPMG professionals are grouped by industry focus and our clients are able to deal with industry professionals who speak their language. Our internal information technology and knowledge management systems enable the delivery of informed and timely business advice to clients.\n\nKPMG’s global Financial Risk Management (FRM) practice was founded in 1998. Today, it is a market leader supported by 2,100 risk professionals in 51 countries. FRM practice in India is an integral part of a global practice helping clients to identify their exposures, develop a risk management strategy that maximizes competitive advantage and business performance, and apply a comprehensive risk management discipline, supported by leading tools and experienced, specialist resources.\n\n\n\n\nKPMG is hiring individuals for projects with Multinational Investment Banks.\n\n\n\n\n>> ROLE & RESPONSIBILITIES\n\n\n\n\nEnsuring E2E delivery - requirement gathering, test execution plan, defining scope, identifying risks, dependencies and aligning stakeholder expectations throughout the lifecycle of the project\n\nEngage in Finance architecture roll out projects and define As-Is and To-Be mapping\n\nInvolve in extensive analysis of the Client data and drive insights for the system implementation\n\n\n\n\nJob Description:\n\n\n\n\n1-10 years of experience as a Business analyst in Investment Banking/Capital Markets/Market risk/CCR/IRRBB/Complaince/IT/Data Governance/Data Lineage domain.\n\nGood working knowledge on Equities, Fixed income, Prime Brokerage, Repo, OTC Derivatives\n\nGood exposure over New, Amendment, Cancellation, Novation Step In and Step Out & Trade Unwind\n\nGood experience in documentation of project artefacts like BRDs, FSDs and defining UAT phases\n\nProficient in Alteryx, Power BI and SQL\n\nExposure to Project Management principles and deliverables in Agile and Waterfall methodology\n\nExcellent communication and stakeholder management skills\n\n\n\n\nMarket risk:\n\n\n\n\nStrong understanding of capital market products and derivatives across asset classes\n\n Good knowledge of the Market Risk domain with project experience in areas like computation of risk\n\nmeasures (VaR, IRC, ES etc.), management of risk limits, risk reporting etc.\n\n Good understanding of the Basel norms, particularly FRTB and Basel 2.5 standards\n\n\n\n\nCCR:\n\n\n\n\nExperience of validated counterparty exposure on a daily, monthly, and quarterly basis using various metrics including Exposure metrics (PFE, EPE, EEPE, EAD etc ) and VAR computation using both Internal Model (IMM) and Standardized approaches like CEM.\n\nHands-on Experience of Exposure Calculation (EAD/PFE) at Portfolio level for both Modeled (IMM) & Non-Modeled (CEM/SACCR , Credit VAR ,CEF) transactions.\n\nWorking knowledge of calculating & reporting default risk for traded products.\n\nUnderstanding of adjustments at the counterparty level where traded product exposure (derivatives, debt and equity financing) was found to be erroneous and material to mitigate impact on risk monitoring, CVA, and RWA.\n\n\n\n\nData Governance/Data Lineage:\n\n\n\n\nCandidates having data management and governance experience. Please use BCBS239 as keyword as someone who has worked on BCBS239 will know all principals of data aggregation.\n\n\n\n\nBCBS239, Regulatory reporting, Data Quality Management Framework, Data Management Framework, metadata, Data Stewards, data sourcing, data management, data management policy & standards, Data Governance, Data Quality controls, Critical Data Elements (CDEs), Critical Data Attributes (CDAs), enterprise data model, data glossary, data lineage, data quality requirements, data quality issues, Data Service Level Agreement (DSLA), data Aggregation.\n\n\n\n\n\n\n\nIRRBB:\n\n\n\n\nProven experience in liquidity risk, risk modeling or model validation. Assess the model's conceptual soundness and methodology. Models - Liquidity Risk Models (LCR, NSFR, ILAAP), Interest Rate Risk in Banking Book (IRRBB) Models, Stress Test Models etc. Produce high quality model validation reports, with a particular focus on noting limitations, weakness and assumptions.\nUnderstanding of Interest rate risk Metrics like NII (Net Interest Income), EVE (Economic Value of Equity), Basis risk, option risk etc. is required. Behavioralisation of products, prepayment risk etc.\nStrong understanding of regulations and guidelines like SR 11-7 or other equivalent guidelines for model risk management.\n\n\n\n\n\n\n\n>> QUALIFICATION\n\n\n\n\nMBA or Master’s / Doctorate Degree in fields such as Mathematics, Statistics, Econometrics, Finance or Operations Research\n\nPeople with CFA/ FRM degrees will be preferred\n\nKnowledge of risk management functions across different lines of business in banking industry\n\n\n\n\n>> SELECTION PROCESS\n\n\n\n\nCandidates should expect minimum 3 rounds of personal or telephonic interviews to assess fitment and communication skills\n\n>> COMPENSATION\n\n\n\n\nCompensation is competitive with industry standards\n\nDetails of the compensation breakup will be shared with short-listed candidates only\n\n\n\n\n>> PEOPLE BENEFITS\n\n\n\n\nContinuous learning program\n\nDriving a culture of recognition through ‘ENCORE’ our quarterly rewards and recognition program\n\nComprehensive medical insurance coverage for staff and family\n\nExpansive general and accidental coverage for staff\n\nExecutive Health checkup (Manager & above, and for staff above the age of 30)\n\nLes Concierge desks\n\nInternal & Global mobility\n\nVarious other people friendly initiatives\n\nStrong commitment to our Values such as CSR initiatives\n\n\n\n\nThe opportunity is now! If you are interested in being part of a dynamic team, serving clients and reaching your full potential – KPMG Advisory Services is for you!\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/kpmg-india-business-analyst-consultant-assistant-manager-mumbai-at-kpmg-india-4157189771?position=18&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=e7lquTdHYoubd5J99t1vkw%3D%3D"
}