{
    "job_id": "4157072486",
    "title": "AI/ML Engineer",
    "company": "SolvusAI",
    "location": "India",
    "description": "Do you have a passion for data, ML, Generative-AI and LLMs? Are you excited about using cutting-edge technologies to tackle real-world challenges and create a lasting impact for businesses? If yes, we’d love to hear from you!\n\n\n\n\nSolvusAI is looking for an AI/ML Engineer to drive industry transformation. Explore the job details below.\n\n\n\n\nKey Responsibilities:\n\n·     Design AI systems that are scalable, maintainable, and robust, adhering to best practices in software engineering\n\n·     Develop innovative AI solutions to solve pertinent business problems\n\n·     Validate AI models through rigorous testing, ensuring they generalize well to unseen data\n\n·     Identify potential risks and biases in AI models, implementing strategies to mitigate them\n\n\n\n\nRequired Skills & Qualifications:\n\nB. Tech. / B.E. / MCA\n1-2 years of relevant experience\nStrong Python coding skills\nHands-on experience in writing RESTful APIs using python\nExperience in SQL and data management\nExposure to application deployment in cloud environment\nGood understanding of LLM models, Vector databases, and frameworks like LangChain/LlamaIndex\nStrong problem-solving skills and the ability to work in a fast-paced environment\nExcellent teamwork & communication skills\nThis role will be full-time and completely remote\n\n\n\n\nWhy Join Us?\n\nAt SolvusAI, you’ll work with a dynamic team on groundbreaking AI projects that shape the future. We foster a culture of innovation, creativity, and teamwork. Apply now and be part of the AI revolution!\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/ai-ml-engineer-at-solvusai-4157072486?position=4&pageNum=17&refId=rr4SH1GbEVcdwcmKQOXfGg%3D%3D&trackingId=mAA1tGke1kW0hpFBiENfSA%3D%3D"
}