{
    "job_id": "4157695550",
    "title": "AI/ML Lead",
    "company": "CodeCraft Technologies Pvt Ltd",
    "location": "Bengaluru, Karnataka, India",
    "description": "Position Overview\n\nWe are looking for an experienced AI/ML Lead to join our team in Bengaluru. The ideal candidate will bring a deep understanding of machine learning, artificial intelligence, and big data technologies, with proven expertise in developing scalable AI/ML solutions. You will lead technical efforts, mentor team members, and collaborate with cross-functional teams to design, develop, and deploy cutting edge AI/ML applications.\n\nJob Details\n\n\nJob Category: AI/ML Lead\nJob Type: Full-Time\nJob Location: Bengaluru\nExperience Required: 6-8 Years\n\n\nAbout Us\n\nWe are a multi-award-winning creative engineering company. Since 2011, we have worked with our customers as a design and technology enablement partner, guiding them on their digital transformation journeys.\n\nRoles And Responsibilities\n\nBackend Development\n\n\nDesign, develop, and maintain robust backend systems to support AI/ML applications.\nImplement APIs and services to integrate AI models with frontend applications and other services.\nEnsure scalability, performance, and security of backend systems.\n\n\nBig Data Solutions\n\n\nWork with large-scale data processing frameworks like Hadoop and Spark, as well as CRMs (e.g., Salesforce) and databases (e.g., Postgres, MongoDB).\nDevelop and optimize data pipelines for efficient data ingestion, processing, and storage.\nEnsure data integrity and consistency across multiple sources and formats.\n\n\nMachine Learning\n\n\nDevelop, train, and deploy traditional machine learning models (e.g., regression/classification models, neural networks).\nPerform data analysis and feature engineering to improve model performance.\nContinuously monitor and refine models based on performance metrics.\n\n\nGenerative AI Knowledge Base Solutions\n\n\nDesign and implement generative AI models for knowledge base creation and maintenance.\nDevelop systems to integrate generative AI with existing knowledge management platforms.\nOptimize generative models for high-quality, relevant output in knowledge base contexts.\n\n\nCollaboration and Communication\n\n\nCollaborate with data scientists, software engineers, and product managers.\nCommunicate complex technical concepts effectively to non-technical stakeholders.\nLead technical discussions and mentor junior team members.\n\n\nResearch and Innovation\n\n\nStay updated on advancements in AI, machine learning, and big data technologies.\nConduct research to explore new methodologies and enhance existing solutions.\nPropose and implement innovative approaches to solve complex problems.\n\n\nKey Skills And Competencies\n\nCore Technical Skills\n\n\nProficiency in data analytics, descriptive analytics, and predictive analytics.\nExperience with regression and classification models like Linear Regression, Logistic\nRegression, Decision Trees, Random Forest, and Neural Networks.\nExpertise in programming languages: Python, R, SQL, Java, C, and C++.\nFamiliarity with AI/ML tools provided by cloud platforms (AWS, Azure, GCP) such as TensorFlow, SageMaker, and Azure ML.\nHands-on experience working with LLM models.\nProficiency in data modeling and data visualization.\n\n\nAdditional Skills\n\n\nStrong problem-solving skills focused on product development.\nProven track record of supporting global clients or internal stakeholders in data science projects.\nKnowledge of AI-related fields such as image processing and video analytics.\nAbility to work across time zones and geographic borders.\nExceptional written and spoken communication skills to convey technical concepts\neffectively to non-technical audiences.\n\n\nQualifications\n\n\nGraduation/Post-graduation in Computers, Engineering, or Statistics from a reputed institute.\n\n\nWhat We Offer\n\n\nCompetitive salary and benefits package.\nOpportunity to work in a dynamic and innovative environment.\nProfessional development and learning opportunities.\n\n\nVisit us on: CodeCraft Technologies\n\nLinkedIn : CodeCraft Technologies LinkedIn\n\nInstagram : CodeCraft Technologies Instagram\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/ai-ml-lead-at-codecraft-technologies-pvt-ltd-4157695550?position=10&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=c%2BPfHDeM94PFzS4av6SMiQ%3D%3D"
}