{
    "job_id": "4157400437",
    "title": "Data Science Analyst",
    "company": "Deutsche Bank",
    "location": "Pune, Maharashtra, India",
    "description": "Position Overview\n\nJob Title: AI Engineer\n\nLocation: Pune, India\n\nRole Description\n\nIndra is the central program driving the introduction and safe scaling of AI at DB. Focus is identify AI potential across various banking operations, driving funded use cases into production to create value and confidence and scale across the bank, creating selected shared services with embedded safety to enable low cost scale, developing an AI Workbench for developers for safe AI development at pace, and introducing AI controls whilst aiming to maintain time to market.\n\nWhat We’ll Offer You\n\nAs part of our flexible scheme, here are just some of the benefits that you’ll enjoy\n\n\nBest in class leave policy\nGender neutral parental leaves\n100% reimbursement under childcare assistance benefit (gender neutral)\nSponsorship for Industry relevant certifications and education\nEmployee Assistance Program for you and your family members\nComprehensive Hospitalization Insurance for you and your dependents\nAccident and Term life Insurance\nComplementary Health screening for 35 yrs. and above\n\n\n\nYour Key Responsibilities\n\n\nModel Deployment: Collaborate with data scientists to deploy machine learning models into production environments. Implement deployment strategies such as A/B testing or canary releases to ensure safe and controlled rollouts.\nInfrastructure Management: Design and manage the infrastructure required for hosting ML models, including cloud resources and on-premises servers. Utilize containerization technologies like Docker to package models and dependencies. Continuous Integration/Continuous Deployment (CI/CD): Develop and maintain CI/CD pipelines for automating the testing, integration, and deployment of ML models. Implement version control to track changes in both code and model artifacts. Monitoring and Logging: Establish monitoring solutions to track the performance and health of deployed models. Set up logging mechanisms to capture relevant information for debugging and auditing purposes.\nScalability and Resource Optimization: Optimize ML infrastructure for scalability and cost-effectiveness. Implement auto-scaling mechanisms to handle varying workloads efficiently.\nSecurity and Compliance: Enforce security best practices to safeguard both the models and the data they process. Ensure compliance with industry regulations and data protection standards.\nData Management: Oversee the management of data pipelines and data storage systems required for model training and inference. Implement data versioning and lineage tracking to maintain data integrity.\nCollaboration with Cross-Functional Teams: Work closely with data scientists, software engineers, and other stakeholders to understand model requirements and system constraints. Collaborate with DevOps teams to align MLOps practices with broader organizational goals.\nPerformance Optimization: Continuously optimize and fine-tune ML models for better performance. Identify and address bottlenecks in the system to enhance overall efficiency.\nDocumentation: Maintain clear and comprehensive documentation of MLOps processes, infrastructure, and model deployment procedures. Document best practices and troubleshooting guides for the team.\n\n\n\nYour Skills And Experience\n\n\nUniversity degree in a technical or quantitative field (e.g., computer science, mathematics, physics, economics, etc.), preferably a Master’s or Doctoral degree\n2-4 years of experience in applying AI, machine learning and/or data science in business and/or academia. Strong knowledge of at least one programming language (e.g., Python, JavaScript) and relevant data science or engineering framework (e.g., scikit-learn, TensorFlow, Spark, etc.).\nIdeally, practical experience in finance and banking\nComfortable working with and managing uncertainty and ambiguity\nExcellent oral and written communication skills in English\n\n\n\nHow We’ll Support You\n\n\nTraining and development to help you excel in your career\nCoaching and support from experts in your team\nA culture of continuous learning to aid progression\nA range of flexible benefits that you can tailor to suit your needs\n\n\n\nAbout Us And Our Teams\n\nPlease visit our company website for further information:\n\nhttps://www.db.com/company/company.htm\n\nWe strive for a culture in which we are empowered to excel together every day. This includes acting responsibly, thinking commercially, taking initiative and working collaboratively.\n\nTogether we share and celebrate the successes of our people. Together we are Deutsche Bank Group.\n\nWe welcome applications from all people and promote a positive, fair and inclusive work environment.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-science-analyst-at-deutsche-bank-4157400437?position=9&pageNum=5&refId=FRPXiP9y%2BhIxsqwsMRn%2BVQ%3D%3D&trackingId=XrnuxUSvKjKkQjtBgFAubw%3D%3D"
}