{
    "job_id": "4157014490",
    "title": "Business Management Analyst",
    "company": "LSEG (London Stock Exchange Group)",
    "location": "Bengaluru East, Karnataka, India",
    "description": "We are looking for an enthusiastic Business Management Analyst to join our team as we strive to deliver excellence for our partners. Reporting to the Senior Business Operations Manager, you will lead the SOW process, resource onboarding, and funding request administration in addition to ad-hoc requests. You will be responsible for supporting the implementation of standard methodology and maturing of processes.\n\nResponsibilities:\n\n\nEnd to end SOW process.\nExternal resource onboarding and offboarding, including access approval.\nWork across teams and senior leaders to secure approval for funding requests.\nWork with external and internal partners to ensure proof of execution approval.\nSupport daily operational activities.\nUse metrics for analyzing and reporting efficiency and make recommendations for process improvements.\nSupport the coordination of timelines, templates, and submissions for key processes.\nTrack, and follow up on post meeting actions, driving strong interlock with team members.\nRecognize issues and raise through appropriate channels.\nCultivate an inclusive and collaborative environment that values diversity and different viewpoints.\nApply judgement to prioritize tasks effectively.\n\n\nSkills and proficiency:\n\n\nApplies critical thinking to analyze facts and information in order to form a judgement.\nCollects, analyzes and interprets data to reach conclusions and/or present insights and findings.\nAnalyzes, questions and challenges the way things are done to optimize processes.\nFinds opportunities to improve efficiency.\nBuilds solid relationships with internal and external partners\nWorks optimally across teams and adapts ways of working to achieve a common goal.\nCommunicates with clarity and precision that is audience appropriate.\n\n\nLSEG is a leading global financial markets infrastructure and data provider. Our purpose is driving financial stability, empowering economies and enabling customers to create sustainable growth.\n\nOur purpose is the foundation on which our culture is built. Our values of Integrity, Partnership, Excellence and Change underpin our purpose and set the standard for everything we do, every day. They go to the heart of who we are and guide our decision making and everyday actions.\n\nWorking with us means that you will be part of a dynamic organisation of 25,000 people across 65 countries. However, we will value your individuality and enable you to bring your true self to work so you can help enrich our diverse workforce. You will be part of a collaborative and creative culture where we encourage new ideas and are committed to sustainability across our global business. You will experience the critical role we have in helping to re-engineer the financial ecosystem to support and drive sustainable economic growth. Together, we are aiming to achieve this growth by accelerating the just transition to net zero, enabling growth of the green economy and creating inclusive economic opportunity.\n\nLSEG offers a range of tailored benefits and support, including healthcare, retirement planning, paid volunteering days and wellbeing initiatives.\n\nWe are proud to be an equal opportunities employer. This means that we do not discriminate on the basis of anyone’s race, religion, colour, national origin, gender, sexual orientation, gender identity, gender expression, age, marital status, veteran status, pregnancy or disability, or any other basis protected under applicable law. Conforming with applicable law, we can reasonably accommodate applicants' and employees' religious practices and beliefs, as well as mental health or physical disability needs.\n\nPlease take a moment to read this privacy notice carefully, as it describes what personal information London Stock Exchange Group (LSEG) (we) may hold about you, what it’s used for, and how it’s obtained, your rights and how to contact us as a data subject.\n\nIf you are submitting as a Recruitment Agency Partner, it is essential and your responsibility to ensure that candidates applying to LSEG are aware of this privacy notice.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-management-analyst-at-lseg-london-stock-exchange-group-4157014490?position=2&pageNum=50&refId=%2FVyrdZh82hXsETPuNBCAVQ%3D%3D&trackingId=ZN6vEuH6Mxq7trLMJfwS8A%3D%3D"
}