{
    "job_id": "4157402805",
    "title": "Business Analyst, Alexa AI",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nAlexa AI Team in Bangalore is seeking a Business Analyst to support metrics development, insight generation & analytical solution building using LLM as a judge methods for Alexa's business products. This is an opportunity to help shape the scientific direction using state of the art LLM based solutions for a product with global impact.\n\nKey job responsibilities\n\n\nUnderstand backend data structures, pipelines and data warehouse architecture.\nOwn entire data ecosystem and be the SME for all the different datasets, existing dashboards and cross functional solutions/applications.\nWork on statistical modelling techniques for various analysis using state of the art GenAI methods (LLMs)\nMetric generation/standardization and logic building\nCross functional collaboration with product, Science and program teams on various pain points and solve using data based insights.\nCollaborate internally and work on ML related problems\nConduct Research based experiments and publish papers.\nWork on automation solutions using any scripting language.\nGenerate insights for various complex business problems using customized scalable solutions.\n\n\nBasic Qualifications\n\n\n3+ years of business analyst, data analyst or similar role experience\nBachelor's degree in computer science, engineering, mathematics or equivalent\nExperience defining requirements and using data and metrics to draw business insights\nExperience making business recommendations and influencing stakeholders\n\n\nPreferred Qualifications\n\n\nExperience working with machine learning based products\nExperience working on large scale data to derive actionable insights\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI - Karnataka\n\nJob ID: A2903857\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-alexa-ai-at-amazon-4157402805?position=1&pageNum=35&refId=Qg1XFYd2a5oBsKA4VCuZSA%3D%3D&trackingId=un2kZ3J0Mb0mqGokljn4TQ%3D%3D"
}