{
    "job_id": "4157800691",
    "title": "Business Analyst, ROW SHARP",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nROW Supply Chain Analytics team is looking for an innovative, hands-on and customer-obsessed Business Analyst. Candidate must be detail oriented, have superior verbal and written communication skills, strong organizational skills, excellent technical skills and should be able to juggle multiple tasks at once.\n\nThe BA will bring innovation, a strategic perspective, a passionate voice, and an ability to prioritize and execute on a fast-moving set of priorities, competitive pressures, and operational initiatives. You will partner closely with program, product and technology teams to define and build innovative and delightful experiences for customers. You must be highly analytical, able to work extremely effectively in a matrix organization, and have the ability to break complex problems down into steps that drive programs.\n\nKey job responsibilities\n\n\nConverting data into digestible business intelligence and actionable information\nWriting high quality SQL codes to retrieve and analyze data.\nWorking with large data sets, automate data extraction, and build monitoring/reporting dashboard\nInteracting with internal stakeholders to deep-dive outlier events\nAnalyze and solve business problems with focus on understanding root causes and driving forward-looking opportunities\nCommunicating complex analysis and insights to our stakeholders and business leaders, both verbally and in writing.\nEnable effective decision making by retrieving and aggregating data from multiple sources and compiling it into a digestible and actionable format\nShould be open to learn and develop skillsets in the latest technologies and analytical techniques\n\n\nBasic Qualifications\n\n\n3+ years of tax, finance or a related analytical field experience\n3+ years of Excel or Tableau (data manipulation, macros, charts and pivot tables) experience\nExperience creating complex SQL queries joining multiple datasets, ETL DW concepts\nExperience with reporting and Data Visualization tools such as Quick Sight / Tableau / Power BI or other BI packages\nExperience scripting for automation (e.g., Python, Perl, Ruby)\n\n\nPreferred Qualifications\n\n\nBachelor's degree or equivalent\nBachelor's degree in business or analytical discipline\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ASSPL - Karnataka\n\nJob ID: A2904701\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-row-sharp-at-amazon-4157800691?position=6&pageNum=57&refId=a19Gt2bufEipNHhOPT%2FEtw%3D%3D&trackingId=%2BwOBJBmN1bprzdUCyPuTmg%3D%3D"
}