{
    "job_id": "4157957717",
    "title": "Data Scientist I, FinTech",
    "company": "Uber",
    "location": "Hyderabad, Telangana, India",
    "description": "About The Role\n\nShape the Future of Uber's Financial Data!\n\nAre you excited by the challenge of building high-impact financial models, solving complex data problems, and working at the intersection of finance, data science, and machine learning? If so, we've got the perfect role for you!\n\nThe FinTech - Data Science team at Uber is on the lookout for an exceptional Data Scientist to join our Finance Data Store (FDS) team in Hyderabad, India. This is not just another data science role-you will be at the core of Uber's financial data ecosystem, driving automation, anomaly detection, and financial forecasting that power Uber's global operations.\n\nIn this role, you'll work hand-in-hand with Finance, Engineering, Data Science, Product and Operations teams to turn raw financial data into meaningful insights and strategic decisions. You'll build cutting-edge machine learning models, develop financial forecasting tools, and create scalable, automated data pipelines that fuel Uber's financial strategy.\n\nIf you're a data powerhouse with a passion for financial modeling, analytics, and automation, this is your chance to make a massive impact at a company that moves millions of people every day.\n\nWhy Join Us?\n\nThe Finance Data Store (FDS) team sits at the heart of Uber's financial ecosystem, influencing high-impact decisions across Finance, Operations, and Data Science. We're the data backbone of Uber's financial strategy, ensuring our numbers are accurate, scalable, and automated.\n\nIf you love diving deep into financial data, driving innovation through machine learning, and collaborating with world-class teams, this is the place to be.\n\nJoin us and shape the future of Uber's financial data infrastructure!\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-i-fintech-at-uber-4157957717?position=3&pageNum=5&refId=FRPXiP9y%2BhIxsqwsMRn%2BVQ%3D%3D&trackingId=fIzytXZ9t6C6C1IpLrCqEw%3D%3D"
}