{
    "job_id": "4157362550",
    "title": "BA Payments",
    "company": "Capgemini",
    "location": "Pune, Maharashtra, India",
    "description": "Job Description\n\nWorks in the area of Software Engineering, which encompasses the development, maintenance and optimization of software solutions/applications.\n\n\nApplies scientific methods to analyse and solve software engineering problems.\nHe/she is responsible for the development and application of software engineering practice and knowledge, in research, design, development and maintenance.\nHis/her work requires the exercise of original thought and judgement and the ability to supervise the technical and administrative work of other software engineers.\nThe software engineer builds skills and expertise of his/her software engineering discipline to reach standard software engineer skills expectations for the applicable role, as defined in Professional Communities.\nThe software engineer collaborates and acts as team player with other software engineers and stakeholders.\n\n\nWorks in the area of Software Engineering, which encompasses the development, maintenance and optimization of software solutions/applications.1. Applies scientific methods to analyse and solve software engineering problems.2. He/she is responsible for the development and application of software engineering practice and knowledge, in research, design, development and maintenance.3. His/her work requires the exercise of original thought and judgement and the ability to supervise the technical and administrative work of other software engineers.4. The software engineer builds skills and expertise of his/her software engineering discipline to reach standard software engineer skills expectations for the applicable role, as defined in Professional Communities.5. The software engineer collaborates and acts as team player with other software engineers and stakeholders.\n\nJob Description - Grade Specific\n\nHas more than a year of relevant work experience. Solid understanding of programming concepts, software design and software development principles. Consistently works to direction with minimal supervision, producing accurate and reliable results. Individuals are expected to be able to work on a range of tasks and problems, demonstrating their ability to apply their skills and knowledge. Organises own time to deliver against tasks set by others with a mid term horizon. Works co-operatively with others to achieve team goals and has a direct and positive impact on project performance and make decisions based on their understanding of the situation, not just the rules.\n\nSkills (competencies)\n\nVerbal Communication\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/ba-payments-at-capgemini-4157362550?position=5&pageNum=42&refId=xxyg9D9a0iqwhm5TUVsTxQ%3D%3D&trackingId=ollFjsKFXAGQfiji93ZaSA%3D%3D"
}