{
    "job_id": "4157196516",
    "title": "Business Analyst-CCR",
    "company": "KPMG India",
    "location": "Mumbai, Maharashtra, India",
    "description": "About KPMG in India\n\nKPMG entities in India are professional services firm(s). These Indian member firms are affiliated with KPMG International Limited. KPMG was established in India in August 1993. Our professionals leverage the global network of firms, and are conversant with local laws, regulations, markets and competition. KPMG has offices across India in Ahmedabad, Bengaluru, Chandigarh, Chennai, Gurugram, Jaipur, Hyderabad, Jaipur, Kochi, Kolkata, Mumbai, Noida, Pune, Vadodara and Vijayawada.\n\nKPMG entities in India offer services to national and international clients in India across sectors. We strive to provide rapid, performance-based, industry-focused and technology-enabled services, which reflect a shared knowledge of global and local industries and our experience of the Indian business environment.\n\n\n\n\nMust have of the roles :\n\n\n\n\nStrong understanding of capital market products and derivatives across asset classes\nGood knowledge and experience in CCR domain areas such as PFE, EE, EEE, EPE and EEPE computation methodologies, ECL computation\nGood understanding of the Basel norms and its impact on Banks\nExperience working in Capital and RWA computations.\nAbility to operate in both agile and waterfall style project methodologies and understand deliverables required for each methodology.\nAttention to detail and high-quality standards of documentation, processes, and control environment.\nExperience in the full E2E systems delivery lifecycle (SDLC) / Agile framework.\n\n\n\n\nGood to have:\n\nDetailed knowledge of all Microsoft Office products, i.e. Word, Excel, Power Point, Project, and Visio\nProficiency in data analysis, virtualization, and BI solutions – SQL, Python, Dremio, PowerBI, Alteryx, Tableau etc.\nExcellent communication, organization, prioritization, and documentation skills\nFlexibility – adapts effectively to changing plans, domains and priorities; Is open and flexible when faced with changing project constraints\n\n\n\n\nQualifications:\n\nDegree/ Qualified accountant/FRM with regulatory reporting background.\nCA/MBA(Finance)/ M.SC (stats)\nCertifications in CFA/ FRM\nA power user of Excel spreadsheet and PowerPoint. Acumen and demonstrated knowledge to use visualization tools (i.e., Power BI) will be advantageous.\nInvestment banking product knowledge and other regulatory development around IB\nSAS, Python\n\n\n\n\nEqual employment opportunity information\n\nKPMG India has a policy of providing equal opportunity for all applicants and employees regardless of their color, caste, religion, age, sex/gender, national origin, citizenship, sexual orientation, gender identity or expression, disability or other legally protected status. KPMG India values diversity and we request you to submit the details below to support us in our endeavor for diversity. Providing the below information is voluntary and refusal to submit such information will not be prejudicial to you.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-ccr-at-kpmg-india-4157196516?position=24&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=uEl67sAQFtJov2hv4MKdXQ%3D%3D"
}