{
    "job_id": "4157800829",
    "title": "Business Analyst (SAFe)- Remote",
    "company": "Launch by NTT DATA",
    "location": "India",
    "description": "Req ID: 313851\n\nNTT DATA strives to hire exceptional, innovative and passionate individuals who want to grow with us. If you want to be part of an inclusive, adaptable, and forward-thinking organization, apply now.\n\nWe are currently seeking a Business Analyst (SAFe)- Remote to join our team in Remote, Karnātaka (IN-KA), India (IN).\n\nBusiness Analyst (SAFe)- Remote\n\nHow You’ll Help Us\n\nAs a Business Analyst, you’ll support our clients by identifying, analyzing, and implementing efficient business solutions. You’ll work directly with a collaborative project team and client stakeholders to design, develop, and enhance processes and systems, ensuring each solution is optimized for success. If you’re passionate about business analysis, technology, and problem-solving, this role offers an ideal growth opportunity.\n\nHow We Will Help You\n\nAt NTT DATA, we see this position as more than just a job. With opportunities for certifications, professional development, and continuous training, we are committed to your long-term growth. We prioritize work-life balance and provide the flexibility you need to thrive.\n\nWhy The Role Is Important\n\nAs a Business Analyst, you play a key role in bridging technology and business needs, aligning IT systems with client goals. Your insights and strategies drive improvements that maximize efficiency, enhance functionality, and create value for stakeholders. By guiding less experienced team members, you’ll also contribute to the overall growth and strength of the team.\n\nOnce You Are Here, You Will\n\nRequirements Gathering and Analysis\n\n\nLead workshops and stakeholder interviews to capture business and functional requirements.\nDocument objectives, goals, and success criteria to drive project roadmaps.\nPrioritize and manage requirements, ensuring alignment with business needs and addressing scope adjustments as needed.\n\n\nProcess Improvement and Documentation\n\n\nConduct gap analyses to identify inefficiencies and opportunities for improvement.\nCreate detailed user stories, use case diagrams, and acceptance criteria.\nDevelop business analysis plans, contributing to the overall project strategy and documentation.\n\n\nCollaboration and Stakeholder Engagement\n\n\nCollaborate with clients and technical teams to assess systems and support new implementations.\nPartner with stakeholders at all levels to support business case development for new initiatives.\nMaintain open communication and provide regular updates to stakeholders and project teams.\n\n\nProject and Team Management\n\n\nParticipate in agile & SAFe ceremonies and collaborate with other analysts. Will need to coordinate across teams.\nEnsure transparent communication across project phases, providing regular status updates and insights.\n\n\nBasic Qualifications\n\n\n8+ years in a Business Analyst role, with experience in complex software applications and strong business-to-technology translation skills.\nDemonstrated leadership skills, strategic insight, and attention to detail.\nVersatile in both Agile and Waterfall project methods, able to navigate challenging situations effectively.\nCompetent with SAFe framework.\n\n\nPreferred Skills\n\n\nBachelor’s degree in Information Technology, Computer Science, or related field.\nExperience with Microsoft applications like Visio, Project, and tools like SQL, Power BI.\n. Experience as RTE in SAFe framework.\n\n\nIdeal Mindset\n\n\nTeam Player: You help others succeed and enjoy collaboration.\nProblem Solver: Analytical with a client-first approach, always seeking improvement.\nProactive Learner: Dedicated to personal and professional growth.\nOrganized: Able to manage complex information and present it effectively.\nConfident Communicator: Able to speak up respectfully, especially with critical insights.\n\n\nPlease note Shift Timing Requirement: 1:30pm IST -10:30 pm IST\n\n#LaunchJobs #LaunchProduct\n\nAbout NTT DATA\n\nNTT DATA is a $30 billion trusted global innovator of business and technology services. We serve 75% of the Fortune Global 100 and are committed to helping clients innovate, optimize and transform for long term success. As a Global Top Employer, we have diverse experts in more than 50 countries and a robust partner ecosystem of established and start-up companies. Our services include business and technology consulting, data and artificial intelligence, industry solutions, as well as the development, implementation and management of applications, infrastructure and connectivity. We are one of the leading providers of digital and AI infrastructure in the world. NTT DATA is a part of NTT Group, which invests over $3.6 billion each year in R&D to help organizations and society move confidently and sustainably into the digital future. Visit us at us.nttdata.com\n\nNTT DATA endeavors to make https://us.nttdata.com accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact us at https://us.nttdata.com/en/contact-us . This contact information is for accommodation requests only and cannot be used to inquire about the status of applications. NTT DATA is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. For our EEO Policy Statement, please click here . If you'd like more information on your EEO rights under the law, please click here . For Pay Transparency information, please click here .\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-safe-remote-at-launch-by-ntt-data-4157800829?position=6&pageNum=90&refId=%2Bkyw8zwbzHgObrojL52nxA%3D%3D&trackingId=gufQm7MUD0Q%2Bq3yxjDnYAw%3D%3D"
}