{
    "job_id": "4157799896",
    "title": "Business Analyst",
    "company": "The Depository Trust & Clearing Corporation (DTCC)",
    "location": "Chennai, Tamil Nadu, India",
    "description": "Job Description\n\nAre you ready to make an impact at DTCC?\n\nDo you want to work on innovative projects, collaborate with a dynamic and supportive team, and receive investment in your professional development? At DTCC, we are at the forefront of innovation in the financial markets. We're committed to helping our employees grow and succeed. We believe that you have the skills and drive to make a real impact. We foster a thriving internal community and are committed to creating a workplace that looks like the world that we serve.\n\nPay And Benefits\n\n\nCompetitive compensation, including base pay and annual incentive\nComprehensive health and life insurance and well-being benefits, based on location\nPension / Retirement benefits\nPaid Time Off and Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.\nDTCC offers a flexible/hybrid model of 3 days onsite and 2 days remote (onsite Tuesdays, Wednesdays and a third day unique to each team or employee).\n\n\nThe Impact You Will Have In This Role\n\nBeing a member of the Enterprise Data Tribe, you will support the leadership team in establishing, maturing, and scaling enterprise scale data capabilities, as well as driving the implementation of industry-leading data practices. The ideal candidate for this position is a self-starter with a strong ability to prioritize, own and drive projects, and quickly learn new concepts and frameworks.  Success in this role demands the ability to work in a fast-paced environment and adapt to shifting priorities, while demonstrating a high degree of accuracy and attention to detail to deliver high-quality outputs within deadlines. Position Summary Enterprise Data Tribe Senior Associate – The individual is part of the Enterprise Data Tribe Product team and reports directly with Product Manager. They work with the business units to gather and refine functional analysis and documentation and conduct reviews to prioritize work for the development team. The work supports the Enterprise Data Tribe delivery roadmap which spans across the organization for delivery of data capabilities.\n\nYour Primary Responsibilities\n\n\nThe BA is part of the Product team and work directly with PO and aligned to the Product roadmap deliverables\nBusiness management skills to understand the Product structures, business activities and processes in support of those\nAnalyzes current state of Security Master product integrations in order to define future state modernized business processes\nRefines and documents scope of project deliverables\nDevelops business requirements in collaboration with Data Stewards, Product Management, business lines and operations provide input to Product demos.\nDocuments actionable business requirements by creating Jira stories\nWorks with AD to further refine requirements that have been captured and ensures story meets the definition of done.\nOrganizes business and functional requirements into Epic’s and groomed stories and maintains the product backlog in collaboration with the product owner.\nParticipates meaningfully as a core member of one or more agile squads, including attending daily stand-up, grooming sessions and other agile ceremonies, documenting user stories, and tracking and reporting on relevant project metrics.\nUnderstands priority for delivery and can achieve agreement with Business and Technology.\nConducts review sessions with subject matter experts (functional/technical) turning session feedback into groomed stories for Agile Development Delivery.\nProduces training materials (when necessary) and product documentation / slides to illustrate the value and scope of the delivery.\nManages independently assigned projects, through the life cycle from initiation to closing.\nDevelop and deliver clear and concise, high-quality presentations to partners and leadership that provide the appropriate level of detail for the intended audience.\nAligns risk and control processes into day to day responsibilities to monitor and mitigate risk; escalates appropriately\nExpertise in financial services and specifically in Security Reference Reference data and how business utilize data is preferred\n\n\nQualifications\n\n\nMinimum of 6 years of related experience\nBachelor's degree preferred or equivalent experience\n\n\nTalents Needed For Success\n\n\nDemonstrate business analysis and/or process improvement skills necessary to provide business-engineering, analytical, and architectural services to transition business requirements into enterprise solutions\nExpertise in enterprise data transformation programs is preferred\nExperience working in Agile environment and knowledge of the Jira\nStrong written/oral communication and presentation skills. Articulates information clearly and presents information effectively and confidently when working with others.\nDemonstrated ability to think strategically to develop processes, tools and frameworks that help ensure effectiveness across a variety of customers\nConvinces others by making a strong case, bringing others along to their viewpoint; maintains strong, trusting relationships while at the same time is comfortable challenging ideas and being challenged\nThinks boldly and out of the box, generates new ideas and processes, and confidently pursues challenges as new avenues of opportunity.\n\n\nActual salary is determined based on the role, location, individual experience, skills, and other considerations. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\n\nAbout Us\n\nDTCC safeguards the financial markets and helps them run efficiently, in times of prosperity and crisis. We are uniquely positioned at the center of global trading activity, processing over 100 million financial transactions every day, pioneering industry-wide, post-trade solutions and maintaining multiple data and operating centers worldwide. From where we stand, we can anticipate the industry’s needs and we’re working to continually improve the world’s most resilient, secure and efficient market infrastructure. Our employees are driven to deliver innovative technologies that improve efficiency, lower cost and bring stability and certainty to the post-trade lifecycle.\n\nDTCC proudly supports Flexible Work Arrangements favoring openness and gives people freedom to do their jobs well, by encouraging diverse opinions and emphasizing teamwork. When you join our team, you’ll have an opportunity to make meaningful contributions at a company that is recognized as a thought leader in both the financial services and technology industries. A DTCC career is more than a good way to earn a living. It’s the chance to make a difference at a company that’s truly one of a kind.\n\nLearn more about Clearance and Settlement by clicking here .\n\nAbout The Team\n\nEnterprise Services comprises of multiple business platforms including Client Services, Global Business Operations, Business Architecture, Data Strategy and Analytics, and Digital Services, which report into the Chief of Enterprise Services.\n\nThese grouped platforms enable the business to optimize delivery for clients, generate efficiencies and resilience, and enable consistency in the business digitization strategy, processes and end-to-end best practices.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-the-depository-trust-clearing-corporation-dtcc-4157799896?position=7&pageNum=85&refId=ohmj3hU0l5bjBc1GtOJ2OA%3D%3D&trackingId=ZXv9TKcglP6gFUiQ0kBAHA%3D%3D"
}