{
    "job_id": "4157930984",
    "title": "Business Analyst, Account Integrity",
    "company": "Amazon",
    "location": "Bengaluru, Karnataka, India",
    "description": "Description\n\nHave you ever thought about what it takes to detect and prevent unauthorized activity among hundreds of millions of eCommerce transactions across the globe? What would you do to increase trust in an online marketplace where millions of buyers create and sign in to shop at Amazon? How would you build systems that evolve over time to proactively identify and neutralize new and emerging MO?\n\nAmazon’s Buyer Risk Prevention (BRP) team is looking for a passionate, results-oriented Business Analyst to support Account Integrity’s mission is to prevent bad actors from taking over existing good Customer accounts (events referred to as ATOs), and from creating new Amazon accounts (bad actor accounts, or BAAs).\n\nAs a Business Analyst in BRP, you will be responsible for analyzing terabytes of data to identify specific instances of risk, broader risk trends and points of customer friction, developing scalable solutions for prevention. In addition you will be responsible for building a robust set of operational and business metrics and will utilize metrics to determine improvement opportunities.\n\nKey job responsibilities\n\nUnderstand the various operations across BRP\n\nUnderstand the requirements of stakeholders and map them with the data sources/data warehouse\n\nDesign and develop highly available dashboards and metrics using Tableau, Excel and SQL.\n\nProvide wing-to-wing project lifecycle execution (project planning, execution, risk assessment and system availability)\n\nExecute high priority (i.e. cross functional, high impact) projects to improve operations performance with the help of Operations Analytics managers\n\nPerform business analysis and data queries using scripting languages like R, Python etc.\n\nExecute analytical projects and understanding of analytical methods (like ANOVA, Distribution theory, regression, forecasting, Machine Learning Techniques, etc.)\n\nIdentify new pattern of abuse and make recommendations for new controls and improved monitoring\n\nDevelop and oversee the initiation of strategy recommendations\n\nBasic Qualifications\n\n\nBachelor's degree in mathematics, engineering, statistics, computer science or a related field\nExperience with SQL or ETL\nExperience defining requirements and using data and metrics to draw business insights\nExperience demonstrating problem solving and root cause analysis\nExperience using Python or R for data analysis or statistical tools such as SAS\n\n\nPreferred Qualifications\n\n\nExperience working with Tableau\nExperience using very large datasets\n\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\n\n\nCompany - ADCI - Karnataka\n\nJob ID: A2846800\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-account-integrity-at-amazon-4157930984?position=2&pageNum=80&refId=A63P04dNUmAIICc%2BzvhEHA%3D%3D&trackingId=Hcnc6ByBZrwcob9ADUVcjA%3D%3D"
}