{
    "job_id": "4157334137",
    "title": "Senior Business Process Analyst",
    "company": "First Brands Group, LLC",
    "location": "Bangalore Urban, Karnataka, India",
    "description": "First Brands Group, LLC is the parent company of many of the automotive industry's most recognizable OEM and Aftermarket brands. First Brands Group is a privately held organization and leader in automotive repair and maintenance products. Headquartered in Cleveland, Ohio with operations found around the globe.\n\n\n\n\nWe are a team of professionals dedicated to building profitable, enduring growth among all our customers with an unrelenting drive to exceed customers expectations. Designed and engineered with Original Equipment rigor and quality, our products serve vehicle manufacturers, technicians and drivers everywhere.\n\n\n\n\nIf you are looking for curious self-starters with a willingness to explore and motivation to find growth opportunities, we have an exciting opportunity for candidates who would like to join a global company in continuous growth!\n\n\n\n\nGeneral Purpose:\n\nRole will be responsible to examine, improve and streamline business processes within an organization. This position will collaborate closely with our US based product owners, product management, product engineering, and program management teams to execute these job duties.\n\n\n\n\nPrimary Job Tasks and Responsibilities\n\nPrimary responsibilities involve systematic approach to examining and evaluating organization's business processes\n\n\n\n\nBusiness Process Development in Integrify: Lead the end-to-end design and development of business processes and feed them into Integrify software, creating automated workflows that enhance operational efficiency and task management.\nAutomation and System Integration: Implement advanced process automation using Integrify Software, ensuring seamless task delegation and execution across cross-functional teams.\nTask Management and Accountability: Establish structured task assignments with clear roles and deadlines, ensuring accountability and timely execution of critical actions for each process step using the Integrify Software.\nContinuous Process Optimization: Drive continuous process improvement initiatives by understanding current processes, discuss updates and implementing enhancements to improve efficiency and proper task allocation.\nCross-Functional Collaboration: Foster strong collaboration between global and cross-functional teams, ensuring alignment, clear communication, and timely delivery of project task assigned.\nProcess Documentation and Standardization: Ensure comprehensive documentation completed and standardization of processes using Integrify, facilitating future scalability and operational consistency.\nDashboard Creation and Analytics: Develop and maintain real-time dashboards in Integrify to track key performance indicators, monitor task progress, and provide insights into process effectiveness.\nPerformance Monitoring and Reporting: Utilize Integrify to track performance metrics, generate actionable reports, and present data-driven insights to senior leadership on process outcomes and areas for improvement.\nDeveloping and implementing optimised processes and procedures to enhance efficiency, productivity.\nCollaborating with stakeholders to design and execute process improvement initiatives aligned with product groups requirements.\nMonitoring and evaluating the effectiveness of implemented process changes, measuring key performance indicators and making necessary adjustments for continuous improvement.\nConduct a thorough data analysis and process mapping to identify obstacles, inefficiencies and opportunities for improvement.\nDevelop and implement relevant processes and technologies to optimise the organisation’s internal operations preferably using Integrify tool.\nCollaborate with cross-functional teams to implement process changes, ensuring smooth transitions and minimal disruption to operations.\nCommunicate with shareholders and stakeholders to ensure alignment on proposed changes.\nMonitor process audits and evaluate the effectiveness of implemented process changes, gathering feedback and making necessary adjustments.\nCreate process documentation and guidelines, including standard operating procedures and workflow diagrams using Integrify tool or similar.\nProvide training and support to team members on new processes and best practices.\n\n\n\n\nKnowledge/Experience\n\nRelevant certification in business process management or a related field.\nMinimum 5 to 10 years of global experience.\nWorking knowledge of process improvement methodologies, such as Lean Six Sigma.\nExperience in project management and change management.\nKnowledge of specific industry regulations and standards.\nExperience in change management methodologies.\nFamiliarity with data analytics and visualisation tools.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-process-analyst-at-first-brands-group-llc-4157334137?position=6&pageNum=10&refId=I3x5Bv9xaOmHYCAjSz8m9w%3D%3D&trackingId=HSBhJ8HadwG%2BWF0Ki6BIaQ%3D%3D"
}