{
    "job_id": "4157755788",
    "title": "Business Analyst",
    "company": "Purplle.com",
    "location": "Mumbai, Maharashtra, India",
    "description": "Founded in 2012, Purplle has quickly become a leading omnichannel beauty destination in India. With over 1,000 brands, 60,000 products, and 7 million monthly active users, we blend online and offline experiences seamlessly. In 2022, our expansion included 6,000+ offline touchpoints and 8 exclusive stores. 🏬✨ We also boost our own D2C brands, including FACES CANADA, Alps Goodness, Derm Doc, NY Bae, Carmesi and Good Vibes.\n\n\n\n\nOur technology-driven platform delivers a personalized shopping experience through virtual trials and tailored recommendations based on user personas. 🎯🤳 Backed by top investors, we achieved unicorn status, becoming India’s 102nd unicorn. 🦄\n\n\n\n\n**Why Join Us?**\n\n- Work on cutting-edge beauty and tech innovation projects. 💻✨\n\n- Thrive in a collaborative and diverse culture. 🌈🤝\n\n- Benefit from unparalleled growth and learning opportunities. 📚🌟\n\n- Engage in exciting, high-impact challenges. 🧩🔥\n\n- Collaborate with a passionate, talented team. ✨🏆\n\n\n\n\n**Role Overview: Business Analyst 📊🔍**\n\nJoin our Operations team to leverage data-driven insights, optimize processes, and enhance efficiency:\n\n\n\n\n**Key Responsibilities:**\n\n- Collaborate with teams to define KPIs and drive operational improvements. 🤝📏\n\n- Analyze data using SQL, Python, and Excel for reporting and decision-making. 💻📊\n\n- Develop dashboards using Power BI, Tableau, and more. 📊🔧\n\n- Identify trends and patterns to enhance business performance. 🔍📈\n\n\n\n\n**Qualifications:**\n\n- Degree in business, data science, or related field. 🎓\n\n- Proficiency in SQL, Python, and Excel. 💻🔍\n\n- Experience with visualization tools like Power BI and Tableau. 📊🔧\n\n- Strong analytical, problem-solving, and communication skills. 🧠🗣️\n\n\n\n\nIf you share our passion for beauty and tech, join us to revolutionize the beauty industry! 💜✨\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-purplle-com-4157755788?position=9&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=JyVeACv%2FyTl45cTYQH9ExA%3D%3D"
}