{
    "job_id": "4157672284",
    "title": "Data Science Manager",
    "company": "Holcim Global Digital Hub",
    "location": "India",
    "description": "About Holcim: As the world’s global leader in innovative and sustainable building materials, Holcim is reinventing the way the world builds. Supported by a 70,000-strong global team spread across 70 countries and four industry segments (Cement, Aggregates, Ready-Mix Concret and Solutions & Products), we are committed to shaping a greener, smarter and healthier world. It’s our ambition to lead the industry in reducing carbon emissions and accelerating the transition towards low-carbon constructions globally. To enable and support our business, Holcim have setup the Group’s Center of Excellence for Advanced Analytics and AI – which encompasses Data Science, Data Engineering, Cloud Platforms Engineering and Business Intelligence. The Group CoE supports Holcim’s Businesses, Functions and OpCos Globally\n\n\n\n\n\n\n\nJob Title: Data Science Manager\n\nJob Location: Remote/Work from home\n\n\n\n\nEducation: Education / Qualification\n\nBE / B. Tech in Computer Science, Engineering or relevant STEM fields\nGraduate degree in Data Science or other quantitative field is preferred\nStrong mathematics skills (e.g. statistics, algebra)\nCertification in Cloud Analytics Platforms – AWS must\n\n\n\n\nThe Manager- Data Science will be part of the Group’s Global Advanced Analytics CoE and will play a key role in enabling our Businesses for Insights Driven Operations and Decision making – leveraging cutting edge Analytics tools and techniques Data Scientist (Individual Contributor initially, with potential to move into a People Management role with strong performance)\n\n\n\n\nResponsibilities:\n\nWork with Business / Domain SMEs, understand pain and opportunity areas and create analytical models to identify patterns and predict outcomes of key business processes\nIdentify the appropriate modeling technique(s) and use Machine Learning and Deep Learning Algorithms to develop self-correcting models and algorithms, validate results from the business perspective and identify levers to improve outcomes\nCollaborate with Product Development teams to industrialize AI / ML models and conduct rapid and iterative prototyping of minimum viable solutions\nTest hypothesis on raw datasets and build meaningful and conclusive insights to identify new opportunity areas.\nWork on all aspects of data including data acquisition, data exploration, feature engineering, building and optimizing models etc.\nDevelop and deploy Gen AI Solutions\nDesign full stack ML solutions in a distributed computing environment -AWS (preferred) and GCP. If needed develop ML solutions to be deployed on the edge (like actuators in plants) or mobiles\n\n\n\n\nYour Experience:\n\nTotal experience of 12-15 years (relevant Analytics experience atleast ~ 8 years) Industry Experience and knowledge especially in Manufacturing/ Operations Functions in a Building Material Industry, Manufacturing, Process or Pharma preferred\nHandson experience in statistical and data sceience techniques\nKnowledge and experience in developing and deploying Gen AI Solutions\n\n\n\n\n\n\n\nRequired Skills:\n\n8+ years of handson experience in advanced Machine Learning & Deep Learning techniques and algorithms such as Decision Trees, Random Forests, SVMs, Regression, Clustering, Neural Networks, CNNs, RNNs, LSTMs, Transformers, etc.\n6+ years of experience in experience in statistical computer languages (Python, PySpark etc.) to manipulate data and draw insights from large data sets\n5+ years of experience in Cloud platforms like AWS with specific experience of leveraging AWS services and deploying AI / ML models on these platforms.\nExperience in DL frameworks such as TensorFlow, Keras or PyTorch\nFamiliarity with business intelligence tools (e.g. Qlikview) and data frameworks will be an added advantage\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-science-manager-at-holcim-global-digital-hub-4157672284?position=4&pageNum=20&refId=BnXhiVGngDlsLf9MWrlaFw%3D%3D&trackingId=NnWmJsEO7m8C3PJDGIC2%2BQ%3D%3D"
}