{
    "job_id": "4157952567",
    "title": "AI Specialist",
    "company": "United Field Services, Inc.",
    "location": "Bengaluru, Karnataka, India",
    "description": "Role Overview\n\nAs an AI Specialist at United Field Services, you will be responsible for designing, building, and implementing AI-driven solutions that enhance our operational efficiency and product offerings. You'll work closely with cross-functional teams—from engineering to product management—to integrate AI models (including large language models like ChatGPT) into our systems. This is an exciting opportunity for someone passionate about leveraging artificial intelligence to solve real-world problems and drive business value.\n\nKey Responsibilities\n\n\nAI Model Integration: Develop and integrate advanced AI models (e.g., ChatGPT) into our existing platforms and workflows to automate and enhance various business processes\nData Pipeline Development: Collaborate with data engineers to design robust data pipelines that support model training, deployment, and real-time inference\nModel Training & Fine-Tuning: Fine-tune language models using proprietary datasets to improve performance, accuracy, and relevance in our specific use cases\nCollaboration & Communication: Work cross-functionally with product managers, software engineers, and stakeholders to identify AI opportunities, define project goals, and deliver innovative solutions\nQuality Assurance & Troubleshooting: Ensure that the AI components are reliable, scalable, and meet strict quality standards. Investigate and resolve technical issues in a timely manner\nResearch & Innovation: Stay up to date with the latest AI and NLP research, tools, and best practices. Propose and implement new AI-driven features and improvements\n\n\n\nRequired Qualifications\n\n\nEducation & Experience:\nBachelor's or Master's degree in Computer Science, Data Science, AI/ML, or related field (or equivalent practical experience)\nDemonstrated experience developing and deploying AI or NLP models in a production environment\nTechnical Expertise:\nProficiency in Python (preferred) or another programming language commonly used for AI/ML\nFamiliarity with machine learning frameworks (e.g., TensorFlow, PyTorch) and NLP libraries\nExperience working with large language models (ChatGPT, GPT-3/4, BERT, etc.) and integrating them into real-world applications\nUnderstanding of data structures, algorithms, and machine learning fundamentals\nProblem-Solving Skills:\nAbility to dissect complex business problems and translate them into actionable AI solutions\nComfort with building proof-of-concepts to validate new ideas and refine solutions iteratively\nCollaboration & Communication:\nExcellent verbal and written communication skills\nAbility to work effectively with cross-functional teams in a remote environment\n\n\nPreferred Qualifications\n\n\nIndustry Background: Familiarity with field services, property inspection, or real estate domains\nCloud Experience: Experience deploying AI solutions on AWS, Azure, or GCP\nMLOps: Knowledge of CI/CD pipelines for machine learning (e.g., containerization, model versioning, and automated deployment)\nSecurity & Compliance: Understanding of data privacy and compliance regulations relevant to AI (e.g., GDPR, CCPA)\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/ai-specialist-at-united-field-services-inc-4157952567?position=6&pageNum=17&refId=rr4SH1GbEVcdwcmKQOXfGg%3D%3D&trackingId=UJbF0pxmbFahCYgJr5imzw%3D%3D"
}