{
    "job_id": "4157753043",
    "title": "Business Analysis Manager - Gurgaon",
    "company": "Cisco",
    "location": "Gurgaon, Haryana, India",
    "description": "Job Summary:\n\nCisco's Global Specialists Organization is seeking a highly motivated and skilled Business Analyst to join our Strategy and Planning team. This role is with the Cloud and AI Infrastructure team in Global Specialists Organization and will support critical initiatives in pursuit of growth in AI infrastructure sales for Cisco. The successful candidate will work closely with cross-functional teams to analyze data, develop insights, and implement strategies that align with Cisco's overarching goals.\n\nKey Responsibilities:\n\n\nData Analysis & Insights: Collect, analyze, and interpret complex data sets to identify trends, patterns, and opportunities that inform strategic business decisions.\nStrategic Planning: Assist in the development and execution of strategic plans that align with the organization's objectives. Provide analytical support for strategic initiatives.\nReporting & Visualization: Develop and maintain comprehensive reports and dashboards that effectively communicate insights and performance metrics to stakeholders.\nCollaboration & Communication: Work collaboratively with internal teams, including marketing, sales, and finance, to ensure alignment and effective implementation of strategic initiatives.\nProcess Improvement: Identify areas for process improvement and recommend solutions to enhance operational efficiency and effectiveness.\nMarket Research: Conduct market research and competitive analysis to support strategic planning efforts and identify new business opportunities.\nSales Acceleration: Support critical initiatives in sales acceleration through data insights, dashboarding etc.\n\n\nQualifications:\n\n\nBachelor's degree in Business Administration, Economics, Finance, or a related field. A Master's degree is a plus.\nProven experience as a Business Analyst or in a similar role, preferably within the technology industry.\nStrong analytical and problem-solving skills with a deep understanding of data analysis techniques and tools.\nExcellent communication and presentation skills, with the ability to convey complex information clearly and concisely.\nProficiency in data visualization tools such as Tableau, Power BI, or similar.\nAbility to work independently and collaboratively in a fast-paced environment.\nFamiliarity with Cisco data sets like bookings and pipeline data and exposure to tools like SAP HANA and FinBI\nKnowledge of Cisco products and services is advantageous.\n\n\nWhy Cisco\n\n\n\n\n\nAt Cisco, we are committed to fostering an inclusive culture that encourages innovation and empowers our employees to achieve their full potential. Join us to make an impact and be part of a team that drives strategic change and growth.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analysis-manager-gurgaon-at-cisco-4157753043?position=40&pageNum=0&refId=QqFlOKlrnyFKzly5T4N%2BOA%3D%3D&trackingId=ON1nPaUJAWRrxArpv6u6og%3D%3D"
}