{
    "job_id": "4157009823",
    "title": "Senior Data Scientist - Predictive Analytics/Business Intelligence - P4",
    "company": "NielsenIQ",
    "location": "Mumbai Metropolitan Region",
    "description": "Company Description\n\nNielsenIQ is a global measurement and data analytics company that provides the most complete and trusted view available of consumers and markets worldwide. We provide consumer packaged goods manufacturers/fast-moving consumer goods and retailers with accurate, actionable information and insights and a complete picture of the complex and changing marketplace that companies need to innovate and grow. Our approach marries proprietary NielsenIQ data with other data sources to help clients around the world understand what’s happening now, what’s happening next, and how to best act on this knowledge. We like to be in the middle of the action. That’s why you can find us at work in over 90 countries, covering more than 90% of the world’s population. For more information, visit www.niq.com.\n\nNielsenIQ is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.\n\nJob Description\n\nAbout the job\n\nHelp our clients-internal and external-understand and use RMS services better by understanding their requirements, queries, and helping address the same through knowledge of data science and RMS.\n\nResponsibilities\n\n\nBuilding knowledge of Nielsen suite of products and demonstrating the same\nUnderstanding client concerns\nAble to put forth ways and means of solving client concerns with supervision\nAutomation and development of solutions for existing processes\nTaking initiative to understand concerns/problems in the RMS product and participating in product improvement initiatives\n\n\nAbout The Job\n\nHelp our clients-internal and external-understand and use RMS services better by understanding their requirements, queries, and helping address the same through knowledge of data science and RMS.\n\nResponsibilities\n\n\nBuilding knowledge of Nielsen suite of products and demonstrating the same\nUnderstanding client concerns\nAble to put forth ways and means of solving client concerns with supervision\nAutomation and development of solutions for existing processes\nTaking initiative to understand concerns/problems in the RMS product and participating in product improvement initiatives\n\n\nQualifications\n\n\nProfessionals with degrees in Maths, Data Science, Statistics, or related fields involving statistical analysis of large data sets\n2-3 years of experience in market research or relevant field\n\n\nMindset and Approach to work:\n\n\nEmbraces change, innovation and iterative processes in order to continuously improve the products value to clients\nContinuously collaborate & support to improve the product\nActive interest in arriving at collaboration and consensus in communication plans, deliverables and deadlines\nPlans and completes assignments independently within an established framework, breaking down complex tasks, making reasonable decisions. Work is reviewed for overall technical soundness.\nParticipates in data experiments and PoCs, setting measurable goals, timelines and reproducible outcomes. Applies critical thinking and takes initiative\nContinuously reviews the latest industry innovations and effectively applies them to their work\nConsistently challenges and analyzes data to ensure accuracy\n\n\nFunctional Skills:\n\n\nAbility to manipulate, analyze and interpret large data sources\nExperienced in high-level programming languages (f.e. Python, R, SQL, Scala), as well as with data visualization tools (e.g. Power BI, Spotfire, Tableau, MicroStrategy)\nAble to work in virtual environment. Familiar with git/Bitbucket processes\nPeople with at least some experience in RMS, NIQ, will have an advantage\nCan use a logical reasoning process to break down and work through increasingly challenging situations or problems to arrive at positive outcomes\nIdentify and use data from various sources to influence decisions\nInterpret effectively the data in relation to business objectives\n\n\nSoft Skills\n\n\nAbility to engage/communicate with team and extended team members\nCan adapt to change and new ideas or ways of working\n\n\nExhibits emotional intelligence when partnering with internal and external stakeholders\n\nAdditional Information\n\nOur Benefits\n\n\nFlexible working environment\nVolunteer time off\nLinkedIn Learning\nEmployee-Assistance-Program (EAP)\n\n\nAbout NIQ\n\nNIQ is the world’s leading consumer intelligence company, delivering the most complete understanding of consumer buying behavior and revealing new pathways to growth. In 2023, NIQ combined with GfK, bringing together the two industry leaders with unparalleled global reach. With a holistic retail read and the most comprehensive consumer insights—delivered with advanced analytics through state-of-the-art platforms—NIQ delivers the Full View™. NIQ is an Advent International portfolio company with operations in 100+ markets, covering more than 90% of the world’s population.\n\nFor more information, visit NIQ.com\n\nWant to keep up with our latest updates?\n\nFollow us on: LinkedIn | Instagram | Twitter | Facebook\n\nOur commitment to Diversity, Equity, and Inclusion\n\nNIQ is committed to reflecting the diversity of the clients, communities, and markets we measure within our own workforce. We exist to count everyone and are on a mission to systematically embed inclusion and diversity into all aspects of our workforce, measurement, and products. We enthusiastically invite candidates who share that mission to join us. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Our global non-discrimination policy covers these protected classes in every market in which we do business worldwide. Learn more about how we are driving diversity and inclusion in everything we do by visiting the NIQ News Center: https://nielseniq.com/global/en/news-center/diversity-inclusion\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-data-scientist-predictive-analytics-business-intelligence-p4-at-nielseniq-4157009823?position=2&pageNum=15&refId=YOJOA8ecJcY65rMZmx6Etg%3D%3D&trackingId=k6InkJyNmlq28ENrBGRnwg%3D%3D"
}