{
    "job_id": "4158191738",
    "title": "Business Analyst",
    "company": "Newpage Solutions",
    "location": "India",
    "description": "Who Are We?\n\nNewPage is a digital health solutions company. We devote ourselves to advancing\n\nthe quality of life by enhancing the health and optimizing the longevity of people.\n\nWe do this by, passionately building futuristic technologies for global organizations\n\nacross the healthcare ecosystem. We partake at every stage from problem\n\ndefinition, strategy & service design, user research, UX design, and agile software\n\ndevelopment – utilizing lean practices to deliver and validate highly innovative\n\ndigital health solutions that drive user value and business transformation.\n\nNewPage is recognized by ‘CIO’s Review’ as “ Top 50 Promising Healthcare\n\nSolution Providers” and “Great Place to Work Certified (GPTW) 2023 and\n\n2024.”\n\n\n\n\nWhat We Offer?\n\nWe are shaping a company that works smart and grows with agility.\n\n▪ We offer you a flexible and remote work environment where you will engage\n\nwith intelligent colleagues, seamlessly collaborating to develop inventive\n\ntechnologies that solve our client’s business challenges.\n\n▪ As part of our team, you will enjoy an employee-centric culture, supportive\n\npeers, work-life balance, generous earnings, and opportunities for growth\n\nand development.\n\n\n\n\nWhom do We Need?\n\nWe are looking for a Business Analyst who will be responsible for analyzing and validating data,\n\nsupport multi-workstream initiatives and facilitate change management and\n\nadoption for our AI-driven solutions.\n\n\n\n\nRoles & Responsibilities\n\n▪ Conduct data analysis and validation to ensure accuracy and reliability\n\nfor AI solution\n\n▪ Facilitate change management processes to promote adoption and\n\nintegration of AI technologies\n\n▪ Provide detailed reports, presentations, and recommendations to\n\nsupport decision-making\n\n▪ Collaborate with stakeholders to gather and analyze data\n\nQualification & Requirements\n\n▪ Demonstrable experience in software Technical Writing: interviewing\n\nsubject matter experts (SMEs), creating user-centric written documentation,\n\narticulating technical content for a range of audiences (work sample\n\nportfolio encouraged)\n\n▪ Strong expertise in data analysis, validation techniques, and business\n\nprocess optimization\n\n▪ Experience managing multi-workstream projects in dynamic environments\n\nDigital Health Solutions\n\n▪ Proven ability to drive change management and ensure adoption of new\n\ntechnologies.\n\n▪ A confident communicator who can effectively work with key stakeholders\n\nacross multiple time zones, with exceptional written and spoken English.\n\n▪ Familiarity with Office 365 suite of tools.\n\n▪ Must be comfortable facilitating working sessions virtually.\n\n▪ Must have experience managing projects at a global scale.\n\n▪ Familiarity with AI technologies and related tools is a plus\n\n\n\n\nHow to reach us?\n\nshilpa.shetty@newpage.io\n\nFind us on – www.newpage.io\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-newpage-solutions-4158191738?position=2&pageNum=32&refId=VFsnRMMnT7hGO1gnBq9n6A%3D%3D&trackingId=JT0QY5OuB59Mo0N6nSnJXw%3D%3D"
}