{
    "job_id": "4158311171",
    "title": "Senior Business Analyst",
    "company": "BNP Paribas",
    "location": "Bengaluru, Karnataka, India",
    "description": "Position Purpose\n\nThe Regulatory Reporting team is ramping up to about 20 members to address the ambitious project of standardizing the activity for APAC region. This long-term project involves the reporting of Balance Sheet, P&L, Capital and a more recent and intense focus on liquidity, especially Basel III LCR requirement.\n\n\n\n\nOur team captures reporting requirements from the users located all across APAC, comes up with efficient propositions, implements solution and follows up to guarantee user comfort on the long run.\n\n\n\n\nTo operate efficiently, the team is constituted of complementing profiles: business analysts understand the logic from the users and develop the reports, data managers are the reference for data sourcing, SMEs develop complex logic components and enhance the solution framework and project managers orchestrate the work and communication on the progress. Collective discussions on the design/strategy and agile approach to project ensure the best compromise between long term robustness and immediate usability of the solution.\n\n\n\n\nThis position is for the Assistant Manager to work on business solutions and/or contribute on people management when necessary.\n\n\n\n\nExperience Level - 7 to 10 Yrs\n\n\n\n\nResponsibilities\n\nDirect Responsibilities\n\nRegional Regulatory Reporting Project :\n\n· Hand on experience of BA working model and knowledge of SDLC cycles.\n\n· Delivery of projects & activities for the FRESH LRR organization\n\n· Able to pick up and implement the Fresh/ FLEXEL project methodology in the ISPL team\n\n· To drive the user requirement gathering process and the analysis accordingly.\n\n· To identify the project priority/ constraint for the project plan.\n\n· To keep the solution’s global functional design documentation and data dictionary up to date.\n\n· To guide various project actors through the functional documentation and participate in the architecture decision.\n\n· To streamline processes and challenge practices in front of entity CFOs.\n\n· To contribute to a long-term sustainable design\n\n· To perform/support system testing (e.g. SIT & UAT)\n\n· Exposure to Agile model, Scrum and Kanban processes\n\n· Participate in Whiteboard, and Follow Jira Workflows etc.\n\n· To help Project Manager by providing expertise on the complexity of proposed design, estimation on workload/timelines for our team as well as other contributors, insight on issues faced and related remediation\n\n· To provide functional support to users and APS on incidents and user queries for timely resolution\n\n\n\n\nContributing Responsibilities\n\n· Engage Regional Stakeholders ensure operational objectives & oversight\n\n· Establish processes, governance & analysis, work practices to achieve objectives and ensure delivery\n\n· Review activities & work performed by team members\n\n· Evaluate, establish & execute controls on the functional & technical processes\n\n· Team management & development - capacity planning, hiring, work allocation, monitoring, skill evaluation, development, training, coaching\n\n· Anticipate changes to business processes and demands from stakeholders and events\n\n· Set-up processes and ensure compliance with OPC, Risk Management, Quality requirements\n\n\n\n\nTechnical & Behavioural Competencies\n\nKnowledge of\n\n\n\n\nFunctional\n\nBanking Experience\n\n\n\n\nTechnical (Mandatory)\n\nSQL\n\nMS Excel\n\n\n\n\n(Good to have)\n\n\n\n\nFunctional\n\nFinancial Markets\n\nBanking Fundamentals\n\nRegulatory Reporting\n\n\n\n\nTechnical\n\nAlteryx (similar Work Flow management tools), INFOMATICA BA/Dev\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-bnp-paribas-4158311171?position=2&pageNum=22&refId=0jgrzIiQy2IEpj2UlbmQnQ%3D%3D&trackingId=3JyOphpkEJnNgfaPSM9dtQ%3D%3D"
}