{
    "job_id": "4158556121",
    "title": "Data Science Fresher (AI/ML)",
    "company": "Wave Hire",
    "location": "Greater Kolkata Area",
    "description": "We are hiring for Pitangent Analytics & Software.\n\nOverview\n\nThe Data Science Fresher (AI/ML) role is a pivotal entry-level position designed for recent graduates aspiring to launch their careers in the fields of Artificial Intelligence (AI) and Machine Learning (ML). In this role, you will support the development and implementation of data-driven solutions that enhance our organizational capabilities. You will work alongside experienced data scientists and engineers, gaining invaluable hands-on experience with various data sets and methodologies.\n\nThe importance of this role cannot be understated, as you will contribute to projects that leverage AI and ML to optimize decision-making processes and provide innovative solutions. This position not only helps in building a strong foundation in data science but also enables you to participate in transformative projects that have real-world impacts.\n\nKey Responsibilities\n\n\nAssist in the collection and preprocessing of structured and unstructured data.\nUtilize statistical methods to analyze data and validate results.\nImplement machine learning models to solve business problems.\nCollaborate with senior data scientists on project requirements and data interpretations.\nVisualize data insights using tools such as Matplotlib or Seaborn.\nParticipate in code reviews and ensure code quality.\nSupport the development of documentation for data processes and techniques.\nEngage in ongoing learning and development related to AI and ML technologies.\nContribute ideas and suggestions in team meetings.\nAssist with model deployment and monitoring performance metrics.\nPerform exploratory data analysis to discover trends and patterns\nSolid grasp of statistical analysis techniques.\nExperience with Git for version control.\nStrong analytical and problem-solving skills.\nAbility to communicate complex technical concepts to non-technical stakeholders.\nA keen interest in AI and ML developments.\nStrong attention to detail and commitment to quality.\nAbility to work independently as well as collaboratively in a team environment.\nEagerness to learn new technologies and methodologies.\nFamiliarity with cloud platforms (AWS, Google Cloud) is a plus.\nInternship or project experience in data science is desirable but not mandatory.\n\n\nSkills: python for data analysis,data visualization,artificial intelligence (ai),statistical analysis,machine learning,data preprocessing,git,problem solving,critical thinking,exploratory data analysis,machine learning (ml),data collection,data analysis,cloud platforms (aws, google cloud)\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-science-fresher-ai-ml-at-wave-hire-4158556121?position=7&pageNum=2&refId=fu9yO4Vys8B6RoczaQM7bg%3D%3D&trackingId=iRzQlzG2X2VdoIVqNyh3yA%3D%3D"
}