{
    "job_id": "4158193679",
    "title": "Business Analyst",
    "company": "Fusion Practices",
    "location": "Chennai, Tamil Nadu, India",
    "description": "About Us:\n\nFusion Practices is a leading consultancy specializing in delivering data-driven projects and finance transformations in partnership with Oracle and Microsoft. We offer consulting and advisory solutions to clients worldwide. Our expertise in Oracle Applications, Microsoft Azure Data Hub, and PaaS enables us to deliver best-in-class solutions.\n\nJob Overview:\n\nWe are seeking a detail-oriented and analytical Business Analyst to join our team. The ideal candidate will be responsible for gathering and analyzing business requirements, managing data collection, handling end-to-end User Acceptance Testing (UAT), and performing system configurations to align with business needs.\n\nKey Responsibilities:\n\n\nCollaborate with stakeholders to collect, analyze, and document business requirements.\nDefine and translate business needs into functional specifications.\nEnsure clear communication between business teams and technical teams.\nIdentify key data sources and extract insights to support business decision-making.\nDevelop UAT plans, test cases, and scripts based on business requirements.\nCoordinate with users for UAT execution, track defects, and ensure issue resolution and Validate system changes before final implementation.\nPerform system configurations as per business needs.\nEnsure proper setup and customization of applications and workflows.\n\n\nRequirements\n\nSkills & Qualifications:\n\n\n3-5 years in business analysis, requirement gathering, and UAT.\nStrong understanding of business processes, data analysis, and system configurations.\nProficiency in using business analysis tools like JIRA, Confluence, SQL, and reporting tools.\nAbility to work with stakeholders across departments and translate business needs into actionable solutions.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-fusion-practices-4158193679?position=7&pageNum=82&refId=N2DJYUFis9K%2FPRID1uM14Q%3D%3D&trackingId=LbUam9DltG6NKlhRygpZMg%3D%3D"
}