{
    "job_id": "4158549993",
    "title": "Business Analyst Intern",
    "company": "Find Next Hire",
    "location": "Bengaluru, Karnataka, India",
    "description": "We are excited to announce career opportunities at Jar.\n\nIntroducing Jar\n\nJar is a pioneering micro-savings platform that empowers users to begin their saving journey with as little as ₹10 in 24K digital gold. Our platform also allows users to easily convert their savings into cash or physical gold whenever they wish.\n\nAdditionally, Jar promotes seamless investment habits by enabling users to save automatically with our round-off feature, functioning like a digital piggy bank.\n\nFounded by Misbah Ashraf, who previously launched a community-driven e-commerce site, Marsplay, and Nishchay AG, a former director at mobility startup Bounce, our mission at Jar is to dismantle the psychological barriers to both saving and investing, spearheading a Financial Wellness movement for Bharat.\n\nAt Jar, we recognize that savings are just the first step in our customers' financial journey. Hence, we have widened our offerings to accommodate their evolving needs.\n\nOur Services\n\nJar Ready Cash\n\nThis innovative loan product, Jar Ready Cash, features a fully digital process that eliminates paperwork and speeds up disbursement, allowing customers to access credit easily. With flexible repayment options and support only a click away, customers can preserve their savings even in emergencies.\n\nNek\n\nNek, an affordable luxury jewelry line powered by Jar, represents our commitment to blending affordability with the intrinsic value of gold, creating meaningful connections. Our extensive collection includes exquisitely crafted silver and gold pieces that celebrate every occasion.\n\nKey Responsibilities\n\n\nDesign and refine strategies to enhance in-app engagement utilizing Plotline and Clevertap, continually iterating to boost user interaction.\nEvaluate A/B tests and assess product features, transforming data into actionable insights for product and business development teams.\nValidate data accuracy through event testing and manual verification, collaborating with tech teams to rectify data discrepancies.\nKeep trackers updated, execute quantitative analyses, and contribute to data-driven strategic decisions.\nSupport Product Managers and Business teams in spotting new opportunities and fostering innovation through data insights.\nLeverage Python and Excel for advanced data reporting and analysis.\n\n\nWhat We Seek\n\n\nEducation: A Bachelor's degree in Engineering, Mathematics, Statistics, or a related field; or an MBA from a well-regarded institution.\nTechnical Skills: Strong command of Excel and fundamental knowledge of Python.\nAbility to thrive in a dynamic startup atmosphere.\nA strong desire to learn and delve into product analysis tools.\nCreative flair for developing engagement strategies and user communications.\n\n\nA Note From The Founders\n\nWe take immense pride in Jar's growth, not just in what we've created but also in the remarkable individuals who have joined us on this journey. We aspire to build solutions that can significantly impact over 400 million Indians navigating their financial paths.\n\nAchieving this requires collective effort and creative thought, and thus we seek innovative problem solvers and collaborators who can embrace failure, learn quickly, and provide unique insights when challenges arise.\n\nWe firmly believe that groundbreaking ideas can emerge from anyone, and we work to cultivate an environment where those ideas can flourish and be realized. We want our team to reflect positively on their experience at Jar, feeling they learned, grew, and succeeded alongside us. If this sounds daunting yet intriguing and inspiring, you may just be the right fit.\n\nWhy Join Us at Jar?\n\nJar prides itself on being a diverse and inclusive workplace that appreciates all employees' ideas and contributions, regardless of their background. Our team is a dynamic blend of youth and experience, fostering a culture of transparency and minimal micromanagement. We offer flexible working hours and provide comprehensive medical insurance for all team members.\n\nPlease Note: This position is a paid internship.\n\nSkills: excel,business analysis,a/b experiments,high-level analysis,python,tech teams collaboration,data analysis,event testing,analysis reports,quantitative analysis,data maintenance\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-intern-at-find-next-hire-4158549993?position=5&pageNum=57&refId=a19Gt2bufEipNHhOPT%2FEtw%3D%3D&trackingId=PwQqohGgWHGIGlLPuoLYwQ%3D%3D"
}