{
    "job_id": "4158152516",
    "title": "Customer Business Analyst",
    "company": "Expeditors",
    "location": "Chennai, Tamil Nadu, India",
    "description": "Company Description\n\nWe take care of our employees, and they take care of our customers!\n\nBecome a member of a global community! The international logistics industry is an integral piece of the global trade puzzle; we make the world go round. Global supply chain management is what we do, and at the heart of Expeditors you will find professionalism, leadership, and a friendly environment, all of which foster an innovative, customer service-based approach to logistics.Expeditors is a global logistics company headquartered in Seattle, Washington.As a Fortune 500 company, we employ over 19,000 trained professionals in a worldwide network of over 350+ locations across six continents. Expeditors satisfies the increasingly sophisticated needs of international trade through customized solutions and seamless, integrated information systems.\n\nOur Mission\n\nWe recruit, train, and retain the very best logistics and technical experts the world over.We love to promote from within— more than 50 percent of our employees have been at Expeditors for five years or more. Our high retention rate is influenced by a unique compensation program for positions that are more than just jobs — they’re chances to grow, do what you love and build a career with us!\n\nJob Description\n\nSUMMARY DESCRIPTION\n\nExpeditors’ is seeking a curious and self-motivated business intelligence analyst to execute on our technical roadmap and build scalable, sustainable data solutions. This role will support the Account Management department and Expeditors’ largest Global Accounts by sourcing and shaping data to bring our stakeholders’ visions to reality.\n\n\nCommunication\nPartner closely with Account Managers and understand their needs in order to build intelligent data solutions.\nDemonstrate solutions in a customer-facing environment.\nEffectively bridge the gap between technical and non-technical users.\nIntake project requests and grasp both the big picture and fine details.\nMaintain project list and successfully convey status, timelines, priorities, and future projects.\nCollaborate with the team to deliver best practice sharing and ongoing improvements.\nDeliver excellent customer service.\nExpeditors Business Acumen\nBuild knowledge of the logistics industry and Expeditors' specific business.\nBuild relationships with various stakeholders across departments.\nAnalytical Mindset\nUnderstand stakeholder’s business needs and processes and translate them into requirements for data solutions to help provide insights for customers.\nAbility to use logic to problem solve and troubleshoot and clearly relay issues to stakeholders.\nEnsure data quality and data integrity.\nKeep up with new and emerging tools.\nWrite SQL to source data from Expeditors’ data warehouse.\nUse business intelligence tools to:\nCombine data from multiple sources\nTransform the structure of data to meet business needs.\nBuild formulas and measures for calculations.\nVisualize data to tell effective data stories and unlock actionable insights.\n\n\nQualifications\n\nQualifications\n\n\nRequired Skills and Attributes\nBachelor’s degree required\nMinimum 5 to 10 Years\nEffective communication and interpersonal skills – ability to relate to employees at all levels\nStrong analytical skills\nStrong technical skills (Advanced Excel, Power BI)\nAbility to design creative solutions to meet business needs\nDesired Skill-Sets and Characteristics\n4 Year degree in a quantitative field, business, or similar concentration\nProficient in SQL, preferred but not necessary\nExperience with data visualization tool (Power BI or Tableau)\nComfortable presenting data to non-data users\n\nAdditional Information\n\nAdditional Information\n\n\nConstantly improve knowledge of Expeditors’ operational procedures, systems, and technologies.\nMaintain a minimum of 52 hours of training annually with a focus on systems training and operations.\nCross-training on other areas of personal development.\nPersonal goals communicated to gain support from leadership.\n\n\nREPORTING STRUCTURE\n\n\nSenior Manager, IS Global Service Center\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/customer-business-analyst-at-expeditors-4158152516?position=5&pageNum=92&refId=Cg5sPd6Nkk2JaEAHs4OCRg%3D%3D&trackingId=rHGvGjc3gFGI9QgnUDpNlQ%3D%3D"
}