{
    "job_id": "4158129913",
    "title": "Data Scientist",
    "company": "Kline + Company",
    "location": "India",
    "description": "About our Team: At Kline, our Innovation team has rapidly grown from a small three-person setup to a thriving, multi-functional team of twelve in just 3 years. We are now looking for top-tier data science talent to take our capabilities in developing digitized and innovative products to the next level.\n\n\n\n\nIf you are a Data Scientist with 1-2 years of experience, have a curious mindset, and are interested in applying machine learning, AI, and predictive analytics to the Consumer, Personal Care, Energy, and Chemicals market research space, then we want to hear from you!\n\n\n\n\nWhy Join Kline? Life at Kline means working in a collaborative, hands-on, and impact-driven environment where each team member has the freedom to innovate and contribute to the next-generation of market research solutions.\n\n\n\n\nWhy This Role is Exciting\n\n• Hands-on experience with cutting-edge AI, NLP, and machine learning techniques.\n\n• Close mentorship and career growth working directly with the head of Department.\n\n• Real business impact – You will directly influence Kline’s next-gen predictive analytics platform.\n\n• Fast-paced, innovative team – Be part of a growing, high-energy group building the future of digital market research.\n\n\n\n\nKey Responsibilities\n\n\n\n\nMachine Learning & AI Development\n\n• Developing machine learning models and predictive analytics frameworks for consumer insights, industry trend forecasting, and data-driven decision-making.\n\n• Applying NLP (Natural Language Processing) techniques to extract insights from SQL databases. social listening data, market research reports, and industry publications.\n\n• Experimenting with Generative AI solutions to automate and enhance research capabilities.\n\n\n\n\nData Engineering & Automation\n\n• Wrangling, cleaning, and structuring large-scale industry datasets for predictive modeling.\n\n• Building automated data pipelines to improve reporting efficiency.\n\n• Designing and optimizing data models to reduce processing time.\n\n• Working closely with the Engineering Lead to develop fit-for-purpose database structures and schemas.\n\n\n\n\nCollaboration & Product Development\n\n• Supporting the Predictive Analytics and Digital Innovation teams in building scalable data-driven solutions for internal and client use cases.\n\n• Working with internal business teams to prioritize tasks, gather business requirements, and deliver impactful data science solutions.\n\n• Providing input into UX design and dashboard creation to ensure insights are delivered effectively.\n\n\n\n\nRequired Skills & Qualifications\n\n\n\n\nExperience & Technical Skills\n\n• 1-2 years of experience in Data Science, Machine Learning, or AI-driven analytics.\n\n• Proficiency in Python (Pandas, NumPy, Scikit-Learn, TensorFlow/PyTorch).\n\n• Strong experience in machine learning model development, NLP, and social listening analytics.\n\n• Familiarity with consumer insights, industry data models, and trend forecasting techniques.\n\n• Ability to build and optimize automated workflows and ETL pipelines.\n\n• Hands-on experience with cloud platforms (AWS, GCP, or Azure) for data science applications (preferred).\n\n• SQL proficiency for data extraction, processing, and database design.\n\n• Exposure to Generative AI models and LLMs (preferred but not required).\n\n\n\n\nSoft Skills & Mindset\n\n• Strong communication skills – Ability to present complex data findings to non-technical stakeholders.\n\n• Problem-solving mindset – Ability to break down business challenges into data-driven solutions.\n\n• Adaptability – Comfortable working in a fast-paced, evolving environment with multiple projects.\n\n• Curiosity & Innovation – Passion for exploring new AI techniques and data science applications.\n\n• Collaboration – Ability to work closely with cross-functional teams (Tech, Business, and Research).\n\n\n\n\nReporting Structure & Career Growth\n\n• Reports to the Head of Predictive Analytics.\n\n• Works closely with the Engineering Lead and Digital Innovation team.\n\n• Opportunity to contribute directly to AI-driven product development and drive innovation at Kline.\n\n• Exposure to real-world business challenges with high visibility across the organization.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-kline-%2B-company-4158129913?position=5&pageNum=7&refId=7K0A6BY3KVkrDHUGwB%2BKXQ%3D%3D&trackingId=nf6raZCPT%2BQTNRmBJaKdkw%3D%3D"
}