{
    "job_id": "4158535348",
    "title": "Junior Business Analyst",
    "company": "Admaren Tech Private Limited",
    "location": "Kochi, Kerala, India",
    "description": "Job Summary\n\nWe are seeking a dynamic and detail-oriented Business Analyst to join our team in Kochi. This role demands strong analytical skills, excellent communication abilities, and a keen understanding of business operations and client relationship management.\n\n\n\n\nKey Responsibilities\n\nRequirement Gathering and Documentation\nCollaborate with the Senior Business Analysts to understand the product vision and roadmap\nConduct interviews, workshops, and stakeholder surveys to gather detailed business requirements\nTranslate these requirements into well-organized and clear documentation, including use cases, user stories, and acceptance criteria\nWork closely with the product management team to ensure requirements align with the product strategy\nAssist in prioritizing requirements based on business value, technical feasibility, and alignment with the product roadmap\nParticipate in Agile ceremonies such as sprint planning, retrospectives, and stand-ups to provide input and feedback.\nContinuously analyze the performance of the platform against set goals and KPIs.\n\n\n\n\nRequired Skills and Qualifications\n\nBachelor’s degree in business administration, Information Technology, or a related field.\nProven experience as a Business Analyst, preferably in technology or software development\nStrong understanding of SDLC\nExcellent analytical, problem-solving, and documentation skills.\nEffective communication and interpersonal skills.\nFamiliarity with Agile methodologies and tools like JIRA and Confluence.\nWell-versed with Microsoft Office suite\nAbility to work in a fast-paced and dynamic environment.\nProficiency in business analysis tools and software (e.g., Microsoft Visio, Tableau).\n\n\n\n\nKey Competencies\n\nCapable of presenting ideas clearly and collaborating effectively with cross-functional teams and stakeholders.\nProficiency in creating clear and well-organized cases, user stories, and other business documents.\nAbility to work harmoniously with product managers, developers, and senior business analysts.\nAbility to break down complex business problems and identify key insights and solutions.\nWillingness and motivation to learn and adapt to new technologies, tools, and best practices.\n\n\n\n\nWhy Join Us\n\nAt Admaren, you'll have the opportunity to kick-start your career in business analysis within a dynamic and innovative environment. As a Junior Business Analyst, you'll have the opportunity to collaborate with cross-functional teams, contribute to strategic decisions, and help shape product development. Join us to build a rewarding career, develop your expertise, and be part of a forward-thinking company transforming the maritime industry.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/junior-business-analyst-at-admaren-tech-private-limited-4158535348?position=7&pageNum=67&refId=6wIEzwS4x6APeTXACdRUdw%3D%3D&trackingId=67YTh4fkTEV%2BqxiWm%2FgzUQ%3D%3D"
}