{
    "job_id": "4158106268",
    "title": "Senior Business Analyst",
    "company": "Innovan Technologies",
    "location": "Hyderabad, Telangana, India",
    "description": "About Innovan Technologies Private Limited:\n\n\n\n\nInnovan Technologies was founded in 2019 in Hyderabad, Telangana, India. Our name “Innovan” means “Innovation”. At Innovan, we pursue excellence through collaboration, learning and mentorship. Our team closely works and collaborates with our colleagues in US, Canada, Mexico & Philippines. Our strength is mutual respect and trust, and this culture fosters innovation and creativity.\n\nFast-forwading to now, we rapidly grew into a much larger team which helped us to creatine various \"Centers of Excellence (COE)\" in domains such as Low-Code/No-Code, AI/ML, Generative AI, Integration Platform as a Service (iPaaS), Platform as a Service (PaaS) & Software as a Service (SaaS) while working on multi-cloud architecture and creating hybrid cloud solutions.\n\n\n\n\nPosition Summary\n\nThe Senior Business Analyst reports to the Project Manager, responsible for reviewing business processes, identifying opportunities for improvement, and suggesting solutions that correspond with the goals and missions of the organization. The Senior Business Analyst collaborates closely with Clients and Executives such as clients, managers, and IT teams to gather requirements, analyze data, and promote successful business solution implementation.\n\n\n\n\nEssential Job Functions\n\nFacilitate discussions with stakeholders to gather requirements, define project scope, and identify key features and functionalities for child support solutions.\nCollaborate with cross-functional teams, including developers, designers, and junior business analysts, to translate business needs into technical requirements and user stories.\nConduct market research and analysis to identify trends, opportunities, and competitive landscape in the child support industry.\nServe as the primary point of contact for potential clients, engaging in regular meetings to provide updates on project progress, gather feedback, and address any concerns or issues.\nPresent project proposals, deliverables, and recommendations to clients in a clear and compelling manner, ensuring alignment with their goals and objectives.\nCreate implementation roadmap for product delivery  Work closely with the marketing team to develop promotional materials, case studies, and success stories highlighting the impact of child support solutions on clients and end-users.  Participate in child Support conferences to promote eWorld child support solutions and establish product leadership in this field.\nOther duties assigned\n\n\n\n\nRequired Skills and Abilities\n\nAssist in creating marketing campaigns, presentations, and demos to showcase the features and benefits of the products to potential clients and stakeholders.\nBuild and maintain strong relationships with clients, fostering trust and collaboration throughout the project lifecycle.\nExamine the impact of planned changes on company processes, systems, and stakeholders, and develop change management strategies to ensure a seamless transition.\nPrepare comprehensive documentation, including business requirements, functional specifications, process maps, and user manuals, to support system understanding and future maintenance.\nIdentify opportunities for business process optimization, efficiency improvements, and automation on a proactive basis, and give recommendations for continuous improvement programs.\nStrong analytical and problem-solving skills\n\n\n\n\n\n\n\nNote: While forwarding the resume, please mention the position and experience in the subject line.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-innovan-technologies-4158106268?position=7&pageNum=57&refId=a19Gt2bufEipNHhOPT%2FEtw%3D%3D&trackingId=nw3C7L%2FPMjFNLUThbFIbTA%3D%3D"
}