{
    "job_id": "4158462506",
    "title": "Data Scientist",
    "company": "AB InBev GCC India",
    "location": "Bengaluru, Karnataka, India",
    "description": "AB InBev GCC was incorporated in 2014 as a strategic partner for Anheuser-Busch InBev. The center leverages the power of data and analytics to drive growth for critical business functions such as operations, finance, people, and technology. The teams are transforming Operations through Tech and Analytics..\n\n\n\n\nDo You Dream Big?\n\nWe Need You.\n\n\n\n\nJob Title: Data Scientist\n\nLocation: Bangalore\n\nReporting to: Senior Manager Analytics\n\n\n\n\n1. PURPOSE OF ROLE\n\nContributing to the Data Science efforts of AB InBevʼs global commercial analytics capability of Pricing Analytics. Candidate will be required to contribute and may also need to guide the DS team staffed on the area and assess the efforts required to scale and standardize the use of Data Science across multiple ABI markets\n\n\n\n\n\n\n\n2. KEY TASKS AND ACCOUNTABILITIES\n\nPreferred industry exposure CPG, Consulting with 3+ years (in case of consulting the typical profile would be of a Lead consultant with relevant experience mentioned in the point below)\nExperience of working in the domain of Pricing Analytics Analytics preferred (assessment of the pillars to be made on the past companies of the candidate) “preferably in a CPG organization” with a demonstrated capability of successfully deploying analytics solutions and products for internal or external clients.\nHas interacted with Senior internal or external stakeholders around project/ service conceptualization and plan of delivery.\nExposure to AI/ML methodologies with a previous hands-on experience in ML concepts like forecasting, clustering, regression, classification, optimization, deep learning.\nProduct building experience would be a plus.\nHas experience of working on data manipulation using tools such as excel, Python, SQL.\nStrong proficiency in Object-Oriented Programming (OOP) principles and design patterns.\nGood understanding of data structures and algorithms as they relate to machine learning tasks.\nExperience with version control tools such as Git.\nFamiliarity with MLOPS and containerization tools like Docker would be plus.\nConsistently display an intent for problem solving\n\n\n\n\n3. QUALIFICATIONS, EXPERIENCE, SKILLS\n\n\n\n\nLevel of educational attainment required (1 or more of the following)\n\nB.Tech/BE/ Masters in Statistics or Economics/ econometrics, MBA\nMinimum 3 years of relevant experience.\n\n\n\n\nLanguage skills required\n\nEnglish (Fluent)\nHands-on experience in data manipulation using Excel, Python, SQL.\nExpert level proficiency in Python(knowledge of writing end-to-end ML or data pipelines in python)\nProficient in application of ML concepts and optimization techniques to solve end-to-end business problems.\nFamiliarity with Azure Tech Stack, Databricks, ML Flow in any cloud platform.\n\n\n\n\nOther Skills required\n\nPassion for solving problems using data\nDetail oriented, analytical and inquisitive\nAbility to learn on the go\nAbility to effectively communicate and present information at various levels of an organization\nAbility to work independently and with others\n\n\n\n\nAnd above all of this, an undying love for beer!\n\nWe dream big to create future with more cheers\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-ab-inbev-gcc-india-4158462506?position=10&pageNum=20&refId=BnXhiVGngDlsLf9MWrlaFw%3D%3D&trackingId=Dvsd3ZeS1OQ7%2BcrSj86SBg%3D%3D"
}