{
    "job_id": "4159584910",
    "title": "Business Analyst",
    "company": "KoinBX",
    "location": "Bengaluru East, Karnataka, India",
    "description": "Skills:\nBusiness Analysis, Deliverable, Documentation, User Stories, Product Management, Product Development, Product Road Mapping, User Acceptance Testing,\n\nResponsibilities\n\n\nGathering, documenting, and analysing business and user requirements for crypto exchange.\nCollaborating with stakeholders to define project scope, goals, and deliverables.\nConducting market and competitor analysis to identify opportunities for product improvement or new product development.\nCreating and maintaining detailed project documentation, including feature specifications, user stories, and process flows.\nFacilitating communication and collaboration between different teams involved in software development, such as product management, development, and quality assurance.\nIdentifying and addressing issues and risks that may impact project scope, timeline, or budget.\nParticipating in user acceptance testing and providing feedback to the development team.\nSupporting the product management team in strategic planning, product roadmap development, and prioritization of features and enhancements.\nMonitoring and analysing product usage data to identify patterns and trends that can inform product decisions.\nKeeping up-to-date with industry trends and best practices in software development and product management.\n\n\nQualifications\n\nQualifications:\n\n\n1-2 years of experience as a business analyst.\nDemonstrated strong written and verbal communication\nFunctional requirement gathering, documenting, technical requirements for system implementation.\nWorking knowledge of product development life cycle.\nEssential Attributes:\nPositive attitude, team player, and readiness for challenges.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-koinbx-4159584910?position=3&pageNum=90&refId=%2Bkyw8zwbzHgObrojL52nxA%3D%3D&trackingId=iTInqhHXLTfADnvq0LJUrw%3D%3D"
}