{
    "job_id": "4159878748",
    "title": "Data Scientist",
    "company": "PepsiCo",
    "location": "Gurugram, Haryana, India",
    "description": "Overview\n\nWe are PepsiCo\n\nPepsiCo is one of the world's leading food and beverage companies with more than $79 Billion in Net Revenue and a global portfolio of diverse and beloved brands. We have a complementary food and beverage portfolio that includes 22 brands that each generate more than $1 Billion in annual retail sales. PepsiCo's products are sold in more than 200 countries and territories around the world. PepsiCo's strength is its people. We are over 250,000 game changers, mountain movers and history makers, located around the world, and united by a shared set of values and goals.\n\nWe believe that acting ethically and responsibly is not only the right thing to do, but also the right thing to do for our business. At PepsiCo, we aim to deliver top-tier financial performance over the long term by integrating sustainability into our business strategy, leaving a positive imprint on society and the environment. We call this Winning with Pep+ Positive. For more information on PepsiCo and the opportunities it holds, visit www.pepsico.com.\n\nPepsiCo Data Analytics & AI Overview:\n\nWith data deeply embedded in our DNA, PepsiCo Data, Analytics and AI (DA&AI) transforms data into consumer delight. We build and organize business-ready data that allows PepsiCo’s leaders to solve their problems with the highest degree of confidence. Our platform of data products and services ensures data is activated at scale. This enables new revenue streams, deeper partner relationships, new consumer experiences, and innovation across the enterprise.\n\nThe Data Science Pillar in DA&AI will be the organization where Data Scientist and ML Engineers report to in the broader D+A Organization. Also DS will lead, facilitate and collaborate on the larger DS community in PepsiCo. DS will provide the talent for the development and support of DS component and its life cycle within DA&AIProducts. And will support “pre-engagement” activities as requested and validated by the prioritization framework of DA&AI.\n\nData Science Senior Analyst: Hyderabad and Gurugram\n\nYour role will be to be part of growing team based in Hyderabad, to create and support global digital developments for PepsiCo. These developments will be around topics like revenue management, supply chain, manufacturing, logistics. This Role focuses on Demand Forecasting in the Demand Planning functional area.\n\nYou will be part of a collaborative interdisciplinary team around data, where you will be responsible of our continuous delivery of statistical/ML models. You will work closely with process owners, product owners and final business users. This will provide you the correct visibility and understanding of criticality of your developments.\n\nYou will be an internal ambassador of the team’s culture around data and analytics. You will provide stewardship to colleagues in the areas that you are an specialist or you are specializing.\n\n\n\n\nResponsibilities\n\nActive contributor to code development in projects and services\nAct as contributor in innovation activities\nPartner with data scientist working on discovery, prototypes and pilot. Focus on experiment tracking.\nPartner with data engineers regarding data pipelines and data versioning.\nBuild, deploy or publish machine learning models that run efficiently in cloud pipelines.\nHeavy focus on data wrangling implementation, business rules implementation, feature engineering at scale\nHelp drive optimization, testing, and tooling to improve quality (unit tests).\nMonitor model performance (model decay), working with data scientists assessing bias and fairness.\nPrototype new approaches and build solutions at scale.\nSupport large-scale experimentation done by data scientists.\nResearch in state-of-the-art methodologies.\nCreate documentation for learnings and knowledge transfer.\nCreate and audit reusable packages or libraries.\n\n\n\n\nQualifications\n\n8+ years working in a team to deliver production level analytic solutions.\n4+ years’ experience in ETL (ADF and Data bricks) and/or data wrangling\n4+ years’ experience in Statistical/ML techniques to solve supervised (regression, classification) and unsupervised problems. Experiences with Deep Learning are a plus.\n4+ years’ experience in developing business problem related statistical/ML modeling with industry tools with primary focus on Python or Pyspark development.\nStrong communications and organizational skills with the ability to deal with ambiguity while juggling multiple priorities\nExperience with Agile methodology for team work and analytics ‘product’ creation. Fluent in Jira, Confluence.\nExperience in cloud-based development and deployment (Azure preferred)\nFluent with Azure cloud services. Certification is a plus.\nFluent in git (version control)\nFluent in Docker\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-pepsico-4159878748?position=42&pageNum=0&refId=0TjBuuvTuSfYzNBXKQFVLw%3D%3D&trackingId=avbGJOwh%2FMopXQVmT5EsPA%3D%3D"
}