{
    "job_id": "4159540732",
    "title": "Data Science, Tableau/Power BI–Analytics",
    "company": "Modus Enterprise Transformation Platform",
    "location": "Bengaluru, Karnataka, India",
    "description": "Skills:\nData Scientist, Tableau, Microsoft Power BI, Enterprise data analysis, R (Programming Language), Computer Science,\n\nAt Modus ETP, we harness the power of data to drive innovation and efficiency across our advanced enterprise network systems. We are seeking a skilled Data Scientist who is proficient in R language, Tableau, and Power BI to join our dynamic team. This role is ideal for someone passionate about Enterprise data analysis and visual data storytelling with an experience of 3-5 years\n\nResponsibilities\n\n\nDesign and develop statistical analysis models and algorithms specifically for interpreting complex enterprise network data.\nUtilize R language for statistical programming and sophisticated data analysis to support network optimization and anomaly detection.\nCreate, configure, and maintain comprehensive reports and dashboards in Tableau and Power BI, ensuring they meet evolving business needs.\nIntegrate data from diverse network sources to construct cohesive and predictive insights.\nCollaborate with IT and network operations teams to define data requirements and implement systems that support network analytics.\nTranslate complex findings and results into understandable visual reports and presentations that drive strategic decisions.\nMaintain a proactive approach to data quality and predictive accuracy by refining models based on new data and feedback from operational teams.\n\n\nQualifications\n\n\nBachelors or Masters degree in Data Science, Computer Science, Statistics, or a related field.\nProven experience in data science with a strong focus on enterprise network environments.\nExpertise in R language, with substantial experience in statistical analysis and modeling.\nAdvanced proficiency in Tableau and Power BI for developing dynamic visualizations and business intelligence reporting.\nStrong understanding of network systems, data structures, and common data science toolkits.\nExcellent problem-solving skills and the ability to work collaboratively in a team environment.\nStrong communication skills, capable of translating technical findings into strategic recommendations for non-technical stakeholders.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-science-tableau-power-bi%E2%80%93analytics-at-modus-enterprise-transformation-platform-4159540732?position=2&pageNum=25&refId=R2I4huFkAwPkt8eXFWs6Ww%3D%3D&trackingId=p41sAkcV1%2FHn%2FlMHHN2n9w%3D%3D"
}