{
    "job_id": "4159560939",
    "title": "Business Analyst",
    "company": "Modus Enterprise Transformation Platform",
    "location": "Bengaluru, Karnataka, India",
    "description": "Skills:\nProblem Solving, Critical Thinking, Communication Skills, Microsoft Excel, SQL, Documentation, Requirements Gathering, Business Analysis,\n\nJob Description\n\nJob Summary\n\nWe are seeking a highly motivated and talented Techno-Functional Analyst Intern to join our dynamic team. This position is ideal for candidates who have a strong foundation in system requirement specification and a keen interest in bridging the gap between business needs and technical solutions. The ideal candidate will possess strong analytical skills, excellent communication abilities, and a solid understanding of enterprise business processes.\n\nKey Responsibilities\n\n\nRequirement Gathering & Analysis: Collaborate with stakeholders to understand and document business requirements, ensuring that they are accurately translated into functional and technical specifications.\nSystem Requirement Specification (SRS) Development: Develop comprehensive SRS documents to guide the development and implementation of IT solutions.\nProcess Mapping & Design: Utilize process mapping tools like Microsoft Visio to create detailed process maps and system diagrams. Identify areas for improvement and propose innovative solutions.\nData Flow & System Diagramming: Create and analyze data flow diagrams, system architecture, and technical specifications to support business requirements.\nClient Interaction: Communicate effectively with clients in Europe and the US, understanding their needs and delivering solutions that exceed expectations.\nProject Planning & Management: Assist in project planning activities, including timeline estimation, resource allocation, and risk management. Ensure project deliverables are met on time and within scope.\nTechnical Documentation: Prepare clear and concise technical documentation, user manuals, and training materials.\nMicrosoft Office 365 Proficiency: Leverage Microsoft Office tools for reporting, documentation, and presentation of analysis results.\nContinuous Improvement: Stay abreast of industry trends, emerging technologies, and best practices to contribute to the continuous improvement of our processes and solutions.\n\n\nQualifications\n\n\nEducation:\nBachelors Degree in Computer Science, Engineering, Information Systems, or a related field.\nMBA with a focus on Information Systems is a plus.\nStrong foundation in mathematics as a core subject during university education.\nSkills & Experience:\nExperience in creating system requirement specifications and technical documentation.\nStrong analytical skills and attention to detail.\nExcellent written and verbal communication skills in English.\nProficiency in Microsoft Office 365, including Word, Excel, PowerPoint, and Visio.\nExperience or knowledge in process mapping, data flow diagrams, and system diagram builds.\nAbility to work independently and collaboratively in a fast-paced environment.\nPreferred Experience:\nExperience working with clients in Europe and the US.\nUnderstanding of enterprise business processes and systems.\nAny relevant internship or training experience in a techno-functional role.\n\n\nPersonal Attributes\n\n\nAnalytical Thinker: Ability to analyze complex data and processes to provide innovative solutions.\nDetail-Oriented: Keen eye for detail and precision in documentation and analysis.\nCommunication: Excellent interpersonal skills with the ability to convey complex information clearly and effectively.\nProblem-Solver: Creative and strategic thinker with a proactive approach to problem-solving.\nTeam Player: Strong ability to collaborate and work effectively with cross-functional teams.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-modus-enterprise-transformation-platform-4159560939?position=1&pageNum=70&refId=HPHgp9Y9QvXuYD8UMhcuvA%3D%3D&trackingId=zkJgquDVG%2FmviaAjqMslPg%3D%3D"
}