{
    "job_id": "4159350235",
    "title": "Business Analyst",
    "company": "Where U Elevate®",
    "location": "Pune, Maharashtra, India",
    "description": "Experience- 8 to 10 years\n\nLocation- Pune/Bangalore\n\nDomains worked on:\n\nBanking (Wholesale, credit & lending)\nRetail Banking\nWealth and Personal Banking\nUnsecured Lending \nPayments\nData Transformation\n\n\n\n\nProven Expertise in delivering large-scale digital or business or finance transformation programs in the banking domain with expertise on payments, cards, lending, Mobile banking journey, retail banking, and wholesale.\n\n \n\nRequirements:\n\nManaged and Delivered Digital/Business Transformation Projects\nPossess excellent Business Analyst skills\nStrong analytical background with a high degree of attention to detail\nBackground working in cross-functional teams to drive requirements capture\nExperience in business and process analysis, change initiatives & re-engineering\nExperience in planning and deploying both business and IT initiatives\nIndustry recognized technical certifications desired i.e. Change Management, Master Black Belt – Six Sigma\nStrong interpersonal and communication skills with a proven ability to communicate effectively and confidently at all levels across the Group\nChallenge business intent in a constructive manner to accurately define requirements and design detailed business solution and structures\nContinuously look for innovative ways to improve business outcomes and add value to customers/stakeholders/colleagues\nStrong organizational, time management and planning skills in order to cope with multiple large-scale responsibilities\nAbility to build strong relationships across Business, IT and Operations\nFlexible and able to adapt in a fast-paced, changing environment\nConfident and open to challenging existing protocols and processes.\n\n\n\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-where-u-elevate%C2%AE-4159350235?position=6&pageNum=77&refId=x7m7XCf9mecSRbX%2FzrmwDg%3D%3D&trackingId=Ko4kELj%2Bg4VxJ5MgoJijsA%3D%3D"
}