{
    "job_id": "4159572874",
    "title": "AI/ML Engineer",
    "company": "MindInventory",
    "location": "Ahmedabad, Gujarat, India",
    "description": "Skills:\nMachine Learning, Deep Learning, Data Preprocessing, NLP, Model Deployment, corepython, fastapi, AI/ml,\n\n\nMinimum of (1+) years of experience in AI-based application development & 1 year of experience in core python.\nFine-tune pre-existing models to improve performance and accuracy.\nExperience with TensorFlow or PyTorch, Scikit-learn, or similar ML frameworks and familiarity with APIs like OpenAI or vertex AI\nExperience with NLP tools and libraries (e.g., NLTK, SpaCy, GPT, BERT).\nImplement frameworks like LangChain, Anthropics Constitutional AI, OpenAIs, Hugging Face, and Prompt Engineering techniques to build robust and scalable AI applications.\nEvaluate and analyze RAG solution and Utilise the best-in-class LLM to define customer experience solutions (Fine tune Large Language models (LLM)).\nArchitect and develop advanced generative AI solutions leveraging state-of-the-art language models (LLMs) such as GPT, LLaMA, PaLM, BLOOM, and others.\nStrong understanding and experience with open-source multimodal LLM models to customize and create solutions.\nExplore and implement cutting-edge techniques like Few-Shot Learning, Reinforcement Learning, Multi-Task Learning, and Transfer Learning for AI model training and fine-tuning.\nProficiency in data preprocessing, feature engineering, and data visualization using tools like Pandas, NumPy, and Matplotlib.\nOptimize model performance through experimentation, hyperparameter tuning, and advanced optimization techniques.\nProficiency in Python with the ability to get hands-on with coding at a deep level.\nDevelop and maintain APIs using Python's FastAPI, Flask, or Django for integrating AI capabilities into various systems.\nAbility to write optimized and high-performing scripts on relational databases (e.g., MySQL, PostgreSQL) or non-relational database (e.g., MongoDB or Cassandra)\nEnthusiasm for continuous learning and professional developement in AI and leated technologies.\nCollaborate with cross-functional teams to understand business requirements and translate them into technical solutions.\nKnowledge of cloud services like AWS, Google Cloud, or Azure.\nProficiency with version control systems, especially Git.\nFamiliarity with data pre-processing techniques and pipeline development for Al model training.\nExperience with deploying models using Docker, Kubernetes\nExperience with AWS Bedrock, and Sagemaker is a plus\nStrong problem-solving skills with the ability to translate complex business problems into Al solutions.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/ai-ml-engineer-at-mindinventory-4159572874?position=3&pageNum=12&refId=C8%2Bsob%2BWGMHdmBeyzLMkdA%3D%3D&trackingId=mP8uMyoJy%2Bq8WWVnYNtlIg%3D%3D"
}