{
    "job_id": "4159522168",
    "title": "Stanowisko ds. zarządzania obszarem BI i HD-specjalność inżynierii systemów Hurtowni Danych",
    "company": "ZUS",
    "location": "West Bunghmun, Mizoram, India",
    "description": "Nazwa jednostki organizacyjnej\n\n\nZUS Oddział w Biłgoraju\n\n\nNazwa komórki organizacyjnej\n\n\nDepartament Świadczeń Emerytalno-Rentowych\n\n\nMiejsce pracy\n\n\nZUS Oddział w Biłgoraju\n\n\nAdres miejsca pracy\n\n\nul. Kościuszki 103, 23-400 Biłgoraj\n\n\nWojewództwo\n\n\nlubelskie\n\n\nNazwa stanowiska\n\n\nStanowisko ds. zarządzania obszarem BI i HD-specjalność inżynierii systemów Hurtowni Danych\n\n\nZadania\n\n\nZadania\n\n\nzapewniać utrzymanie i rozwój architektury biznesowej i technicznej obszaru Hurtowni Danych\nodpowiadać za proponowanie, budowanie i wdrażanie rozwiązań z zakresu technologii przetwarzania dużych zbiorów danych (Big Data), m.in. modelowania danych, projektowanie modelów ekstrakcji danych, projektowania i utrzymanie systemów magazynowania danych\nodpowiadać za analizowanie wydajności sprzętu i oprogramowania w obszarze Hurtowni Danych\nuczestniczyć w planowaniu inicjatyw i projektów mających na celu rozbudowę i optymalizację wykorzystywanych rozwiązań w obszarze Hurtowni Danych\nwspółpracować przy projektowanie procesów ETL (Extract, Transform, Load), ELT (Extract, Load, Transform) w celu pozyskiwania, przetwarzania i ładowania danych z różnych źródeł do systemów klasy Hurtowni Danych\nuczestniczyć w pracach projektowych, wdrożeniowych i testowych w obszarze Hurtowni Danych\nwspierać użytkowników w ramach wdrożeń systemów i narzędzi w obszarze Hurtowni Danych\nuczestniczyć w przygotowaniu planu rozwoju (roadmapy) dla środowiska Business Intelligence i Hurtowni Danych\nproponować usprawnienia dla realizowanych procesów i zmiany w dokumentacji\nWymagania\n\n\nWymagania Niezbędne\n\n\nwykształcenie wyższe\ndoświadczenie zawodowe minimum 1 rok (w pracy związanej z planowaniem, tworzeniem i rozwojem w obszarach Business Intelligence i\\lub Hurtowni Danych)\nstaż pracy ogółem minimum 2 lata\n\n\nMile Widziane\n\n\nwykształcenie wyższe (matematyka, informatyka, statystyka)\ndoświadczenie zawodowe minimum 2 lata (w pracy związanej z planowaniem, tworzeniem i rozwojem w obszarach Business Intelligence i\\lub Hurtowni Danych)\n\n\nWymagania Dodatkowe\n\n\numiejętność obsługi programów MS Office\nZnajomość języka SQL\norientacja na cel\norientacja na jakość\nkomunikacja\nwspółpraca\nelastyczność\nnastawienie na rozwój\nnegocjowanie i wywieranie wpływu\npodejmowanie decyzji\numiejętność rozwiązywania problemów\ninnowacyjność\n\n\nWymagane Dokumenty\n\n\nCV\nlistu motywacyjnego\nskan dokumentów potwierdzających wykształcenie\nskan dokumentów potwierdzających wymagane doświadczenie zawodowe\nskan świadectw pracy dokumentujących wymagany staż pracy lub zaświadczenie o zatrudnieniu zawierające okresy zatrudnienia, w przypadku pozostania w stosunku pracy\n\n\nDokumenty należy przesyłać poprzez formularz aplikacyjny 'Aplikuj', znajdujący się na dole oferty\n\nDodatkowe Informacje\n\n\nproces rekrutacji obejmować będzie rozmowę kwalifikacyjną (przeprowadzoną w formie zdalnej przez komunikator internetowy - wywiad on-line) lub stacjonarnie\nskontaktujemy się tylko z kandydatami spełniającymi wymagania formalne\noferty niekompletne tj. niezawierające skanu, któregokolwiek wymaganego dokumentu nie będą rozpatrywane\noferty przesłane po terminie nie będą rozpatrywane\nmiejscem świadczenia pracy będzie Centrala ZUS lub dowolny Oddział ZUS\nmożliwość pracy w trybie stacjonarnym, zdalnym lub hybrydowym\nTermin, do którego należy składać dokumenty\n\n\n12-02-2025\n\n\nOferujemy\n\n\nOferujemy\n\n\nstabilne zatrudnienie na podstawie umowy o pracę\nmożliwość rozwoju zawodowego\nbogaty pakiet świadczeń socjalnych\nsystem premiowy\n\n\nZakład Ubezpieczeń Społecznych jest pracodawcą przyjaznym osobom z niepełnosprawnościami. Stwarza pracownikom optymalne środowisko pracy, uwzględniając ich potrzeby. Istnieje możliwość dostosowania stanowiska pracy i jego wyposażenia do indywidualnych potrzeb osób z niepełnosprawnościami\n\nWyposażenie Stanowiska Pracy\n\n\nsprzęt komputerowy,\nsprzęt biurowy.\n\n\nWarunki Wykonywania Pracy\n\n\nspełniają warunki określone wymogami bhp i ppoż.,\npolegają na obsłudze komputera powyżej 4 godzin na dobę,\nkonieczność poruszania się po całym obiekcie,\nkonieczność wykonywania pracy poza biurem,\nkonieczność odbywania podróży służbowych,\nbudynek 3-piętrowy z windą oraz pomieszczeniami sanitarnymi dostosowanymi do potrzeb osób niepełnosprawnych,\nstanowisko pracy zlokalizowane w pomieszczeniach biurowych na 3- piętrze,\nmiejsce pracy dostosowane do osób poruszających się przy pomocy wózka inwalidzkiego,\nwejście do budynku jest zorganizowane z poziomu chodnika,\ndrzwi przy wejściu do budynku otwierają się automatycznie,\nw bezpośrednim sąsiedztwie wejścia do budynku znajdują się miejsca parkingowe dla osób z niepełnosprawnościami\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/stanowisko-ds-zarz%C4%85dzania-obszarem-bi-i-hd-specjalno%C5%9B%C4%87-in%C5%BCynierii-system%C3%B3w-hurtowni-danych-at-zus-4159522168?position=7&pageNum=7&refId=7K0A6BY3KVkrDHUGwB%2BKXQ%3D%3D&trackingId=QHchJ4WYa71YLcQlTVl%2FZg%3D%3D"
}