{
    "job_id": "4159582455",
    "title": "Data Scientist Intern",
    "company": "TwiLearn",
    "location": "Greater Kolkata Area",
    "description": "Skills:\nStatistical Analysis, Machine Learning, Python Programming, Data Visualization, Predictive Modeling, Big Data, SQL, Data Mining,\n\nJob Overview\n\nThe Data Scientist Intern role at TwiLearn offers freshers the opportunity to engage in real-world data analysis while working remotely. Located in major Indian cities, including Hyderabad, Chennai, Kolkata, Pune, Mumbai, Bangalore, and Noida, this internship seeks passionate candidates to assist in advanced data-related projects. The position requires no prior work experience and allows interns to collaborate with professionals from Promentix Software Solutions Pvt Ltd.\n\nQualifications And Skills\n\n\nProficiency in statistical analysis to interpret data efficiently and support informed decision-making.\nStrong understanding of machine learning algorithms and applications (Mandatory skill).\nSolid Python programming skills to develop and optimize data-processing algorithms (Mandatory skill).\nExperience with data visualization tools to effectively communicate insights and trends.\nFamiliarity with predictive modeling techniques to forecast trends and outcomes from large datasets.\nKnowledge of big data technologies to manage and analyze large-scale datasets effectively.\nSQL skills for querying and managing datasets stored in relational databases.\nA keen ability for data mining to extract valuable information from vast quantities of raw data.\n\n\nRoles And Responsibilities\n\n\nAssist in designing and developing data models that help in accurate data interpretation and decision-making.\nParticipate in the preprocessing of structured and unstructured data to prepare it for analysis and modeling.\nContribute to the development and refinement of analytical techniques for effective data interpretation.\nCollaborate with mentors and stakeholders to align data-driven techniques with industry-specific requirements.\nSupport the implementation of machine learning models for predictive analysis and insights generation.\nUtilize data visualization tools to create comprehensive reports and dashboards for stakeholders.\nWork on industry-grade projects that enhance technical skills and industry knowledge.\nDemonstrate the ability to work independently as well as in a team-oriented, collaborative environment.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-intern-at-twilearn-4159582455?position=1&pageNum=25&refId=R2I4huFkAwPkt8eXFWs6Ww%3D%3D&trackingId=UQz1LJgPnuL3UPpDnaPIHA%3D%3D"
}