{
    "job_id": "4159352622",
    "title": "Data Scientist",
    "company": "Yubi",
    "location": "Bangalore Urban, Karnataka, India",
    "description": "Yubi stands for ubiquitous. But Yubi will also stand for transparency, collaboration, and the power of possibility.\n\n\n\n\nFrom being a disruptor in Indias debt market to marching towards global corporate markets from one product to one holistic product suite with seven products\n\n\n\n\nYubi is the place to unleash potential. Freedom, not fear. Avenues, not roadblocks. Opportunity, not obstacles.\n\n\n\n\nRole : Senior Data Scientist\n\n\n\n\nExperience: 3 to 5 years\n\n\n\n\nAbout the Role:\n\n\n\n\nWe seek a skilled Senior Data Scientist to join our team in building a cutting-edge Credit Risk Machine Learning platform. This platform delivers sophisticated credit scoring models and transparent explanations behind each score to support clients\" credit monitoring and management activities.\n\n\n\n\nAs a Senior Data Scientist, you will be key in designing, developing, and deploying machine learning models that assess credit risk, ensuring high accuracy, interpret ability, and compliance with regulatory requirements. Your experience in machine learning, credit risk modelling, and strong Python programming skills will be crucial in driving innovation and business value for our clients.\n\n\n\n\nKey Responsibilities:\n\n\n\n\nBuild and develop credit risk models to assess credit risk, ensuring high accuracy and explainability of the models to comply with regulatory frameworks and requirements.\n\n\n\n\nLead the development of a machine learning platform that empowers clients to build and customize their own credit risk models, enabling more tailored risk management solutions.\n\n\n\n\nAlign data solutions with business objectives and technical constraints, adapting to the evolving market dynamics, regulatory landscape and client requirements.\n\n\n\n\nWork closely with cross-functional teams, including data engineering, product management, and business teams, to manage and lead various aspects of the product lifecycle, from conception to delivery.\n\n\n\n\nMonitor model performance and maintain risk management protocols by retraining models as needed, ensuring ongoing accuracy and regulatory compliance.\n\n\n\n\nStay updated on industry trends, regulations, and emerging technologies to improve the models continuously and the platform.\n\n\n\n\nProvide mentorship and guidance to junior data scientists and engineers within the team.\n\n\n\n\nResponsibilities -\n\n\n\n\n\n\n\nShould have worked on python\nShould be a clean coder\nGithub profiles would help us understand their coding standard or any other repo also if they have worked on RESTful services like Fast API or Flask\nShould have worked on classical models like - regression | classification --> could be tree based models or other models ( would highly prefer if they have experience taking these models to prod and understand their nuances )\nNeed to have cloud dev exposure - AWS is preferred, but not a constrain.\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-yubi-4159352622?position=7&pageNum=10&refId=3OwYoZiMWUBkemlaz%2FA01Q%3D%3D&trackingId=qRLYqpR%2Bhbf%2BTGmB0CRgIg%3D%3D"
}