{
    "job_id": "4159892774",
    "title": "Data Scientist",
    "company": "MetLife",
    "location": "Hyderabad, Telangana, India",
    "description": "Position Summary\n\n\n\n\n\n\n\nWe are looking for highly motivated and enthusiastic individuals looking to build a career in the field of data science and analytics, to be a part of the data science team and work with amazing peer group that truly values data-driven decisions. GARC will deliver data driven decisions across all critical business functions such as customer engagement, distribution, underwriting, claims operations, risk management, products and tackle hard, open-ended problems.\n\n\n\n\nThe position is required to deliver on data science projects under the guidance of Data Scientists and Sr. Data Scientists. Superior problem-solving ability, curiosity, strong coding mindset and attention to detail are the key success factors. Associate Data Scientists are the future of our Analytics Community. We are looking for the smartest folks with insatiable curiosity.\n\n\n\n\n\n\n\nJob Responsibilities\n\n\n\n\n5-8 years of experience in insurance analytics, data science or similar function\n\nExpert-level proficiency in at least one statistical tool language (R, Python) with a strong preference towards Python with excellent debugging skills\n\nExperience with Big Data platforms – Hadoop (Hive, Pig, Map Reduce, HQL)/Spark/H2O-Linux environment\nStrong conceptual understanding of machine learning algorithms including linear regressions, classification algorithms, time series techniques, topic modeling etc.\nGood written, oral communication with ability to communicate effectively with stakeholders\nBasic to mid-level understanding of the insurance risk selection, underwriting practices and experience in analyzing the insurance portfolios is a plus\nMentoring skills are considered as a plus\nExperience in Big Data technologies like Azure, AWS and advanced analytics concepts like Simulation, Deep Learning etc. are considered as a plus\nBachelor’s degree in a quantitative field required; Masters or PHD preferred.\n\n\n\n\nKnowledge, Skills and Abilities\n\n\n\n\n5-8 years of experience in insurance analytics, data science or similar function\nWork with Lead Data Scientist to translate given business problem into analytical use-cases with defined outcomes\nCollaborate with Data Scientists to develop, implement and test most appropriate algorithms for a given use-case; be able to review the work of data scientists and provide guidance\nTranslate statistical analysis to insights and recommendations and work with Data Engineers to automate / production Alize them\nEnsure coding standards as well as designing standards to ensure reusability\nDrive innovation by enhancing existing solutions and designing new ones\nBuild collaboration and awareness in the global analytics community\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/data-scientist-at-metlife-4159892774?position=4&pageNum=7&refId=7K0A6BY3KVkrDHUGwB%2BKXQ%3D%3D&trackingId=y7ibvLY0LtcyE3Ni87LLhQ%3D%3D"
}