{
    "job_id": "4159566429",
    "title": "ML Engineer",
    "company": "Simplismart",
    "location": "Bengaluru, Karnataka, India",
    "description": "Skills:\nMachine Learning, Python, C++, CUDA, Large Language Models (LLM), MLOps, Large Language Model Operations (LLMOps), Kubernetes,\n\nCompany Overview\n\nSimplismart enables businesses to build a scalable production-grade AI system and manage the development lifecycle without writing a single line of code. Our platform allows users, from amateurs to experts, to train and monitor ML models collaboratively on almost any kind of data or use-case. By simplifying the deployment of deep learning models, we help businesses save time and reduce engineering costs significantly. Simplismart is based in Bengaluru and belongs to the Technology, Information, and Internet industry. For more information, visit https://simplismart.ai.\n\nJob Overview\n\nSimplismart is seeking a Mid-Level Machine Learning Engineer to join our team in Bangalore. This full-time role involves developing and optimizing machine learning models and their deployment. The ideal candidate should have a maximum of 6 years of relevant work experience and be proficient in both developing machine learning algorithms and managing MLOps practices.\n\nQualifications And Skills\n\n\nProficient in Machine Learning (Mandatory skill) with a strong understanding of various ML algorithms and techniques.\nStrong programming skills in Python (Mandatory skill) with experience in libraries such as TensorFlow, PyTorch, or Scikit-Learn.\nHands-on experience with MLOps (Mandatory skill) to streamline the deployment and monitoring of ML models.\nProficiency in C++ for performance-focused development and implementing complex algorithms.\nKnowledge of CUDA for optimizing model training on GPUs and improving computational efficiency.\nExperience with Large Language Models (LLM) and their application in natural language processing tasks.\nUnderstanding of Large Language Model Operations (LLMOps) for maintaining and scaling LLM applications.\nFamiliarity with Kubernetes for container orchestration and managing deployed ML models in a cloud environment.\n\n\nRoles And Responsibilities\n\n\nDevelop and fine-tune machine learning models to meet the specific needs of various business use-cases.\nCollaborate with cross-functional teams to integrate ML models into production environments.\nImplement MLOps practices to automate the deployment, monitoring, and management of ML models.\nOptimize ML models using CUDA to enhance training speed and computational efficiency.\nMaintain and update large language models (LLMs) to ensure they perform effectively in real-world applications.\nUtilize Kubernetes for managing containerized applications and scaling ML models in a cloud environment.\nEnsure all ML models adhere to best practices and guidelines for production-grade software development.\nStay updated with the latest advancements in machine learning, MLOps, and related technologies.\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/ml-engineer-at-simplismart-4159566429?position=9&pageNum=15&refId=YOJOA8ecJcY65rMZmx6Etg%3D%3D&trackingId=DZGaZAHlh7vXbQQQd3XlCw%3D%3D"
}