{
    "job_id": "4159569091",
    "title": "Junior Data Scientist",
    "company": "Infraveo Technologies",
    "location": "Mumbai Metropolitan Region",
    "description": "Skills:\nPython programming, Statistical analysis, Data visualization, Machine learning, SQL database management, Data cleaning, Critical thinking, Problem-solving,\n\nWe are seeking a Junior Data Scientist to join our team.\n\nKey Responsibilities\n\n\nAs part of a data team, design, build and improve data science and machine learning models.\nCollaborate with R&D resources to define and scope data science solutions\nManipulate and clean data (exploratory data analysis), build new features (feature engineering), perform feature selection and model selection, and implement production-ready models.\nParticipate in model and code reviews and contribute to a team consistently shipping new or updated analytics solutions.\nDefine and implement metrics that will track model performance over time to identify risks and opportunities.\nCommunicate results and insights from data science initiatives to stakeholders and other internal/external users and customers.\n\n\nRequirements\n\n\nA scientist at heart. You are thoughtful and rigorous about modeling methodology and setting standards for exploration and experimentation. You creatively apply existing methodology to new analytical challenges.\nSkilled in statistics/machine learning. You have applied experience with statistics/machine learning. Python toolkits you may have used recently include stats models, scikit-learn, or tensorflow.\nYou have demonstrated programming expertise with Python and SQL for ML techniques, including feature engineering/selection, model selection, model tuning, and performance measurement.\n2+ years of experience working in an applied data or analytics position, depending on academic background.\nDemonstrated accomplishments in data science or analytics, including: Data wrangling: transformation and cleaning, Feature engineering, Statistical or ML model implementation.\nExperience with data engineering and/or collaborating with data engineers.\nBS or MS degree in Statistics, Data Science, Economics, Computer Science, or a related technical field.\n\n\nBenefits\n\n\nWork Location: Remote\n5 days working\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/junior-data-scientist-at-infraveo-technologies-4159569091?position=3&pageNum=25&refId=R2I4huFkAwPkt8eXFWs6Ww%3D%3D&trackingId=kFAE5RYeY11kVoullU2TDw%3D%3D"
}