{
    "job_id": "4159886506",
    "title": "Business Analyst",
    "company": "Truemeds",
    "location": "Mumbai, Maharashtra, India",
    "description": "Role: Business Analyst\n\nLocation: Truemeds, 1st Floor, 91springboard, Godrej & Boyce, Gate No 2, Plant No. 6, LBS Marg, Opposite Vikhroli Bus Depot, Vikhroli West, Mumbai, Maharashtra 400079\n\nWorking Days: 5 days working (Monday to Friday)\n\nJob Description:\n\nWe are looking for a highly motivated and independent Business Analyst to join us @ Truemeds. As a Business Analyst, you will play a critical role in analyzing data, generating insights, and providing strategic recommendations to drive business growth. The ideal candidate should possess strong data crunching skills, along with proficiency in SQL and Python (preferable). The Ideal candidate is someone who has the ability to work independently and has a strong affinity to get down to the base of the data to drive business intelligent insights, is curious about the various functions of marketing and has a strong grasp of numbers and data.\n\n\n\n\nKey Responsibilities:\n\n1. Data Analysis and Insights:\n\nAnalyze, and interpret large datasets to identify trends, patterns, and insights relevant to the business.\nUtilize statistical techniques and data visualization tools to present findings in a clear and concise manner.\nGenerate actionable recommendations based on data-driven insights to improve operational efficiency, customer experience, and overall business performance.\n\n2. Marketing - Reporting and Dashboards:\n\nDevelop and maintain reports and dashboards to track key performance indicators (KPIs) and monitor business metrics.\nProvide regular updates to stakeholders on business trends, performance, and areas for improvement.\nAutomate reporting processes wherever possible to streamline data analysis and reporting workflows.\nDeep dive into data segmentations, cohortizations, and RCAs. Participate in solutioning discussions with relevant teams with data insights built.\n\n3. SQL & Use of Other Platforms:\n\nExtract, transform from various sources using SQL queries.\nDevelop and optimize SQL queries to perform data analysis and generate reports.\nEnsure data accuracy, integrity, and security by maintaining and managing databases.\nUtilize Python programming skills to automate repetitive tasks, data cleansing, and data processing.\nDevelop scripts and programs to enhance data analysis capabilities and streamline workflows.\nCollaborate with the technical team to integrate data sources and implement data-driven solutions.\nProficiency in these tools - Mixpanel, Metabase, Singular/Appsflyer, Google Analytics\n\n4. Driving Business use cases (Cross functional Teams):\n\nCollaborate with stakeholders to understand business needs and translate them into clear and concise requirements.\nCreate & Document business processes, workflows, and system requirements for new projects and enhancements. Discuss and ideate these requirements with other dependent functions & see end to end implementation of said tasks.\nWork closely with cross-functional teams, including marketing, operations, and product development, to gather insights and align business strategies.\nCollaborate with stakeholders to identify business problems, opportunities, and areas for process improvement.\nAct as a liaison between marketing & technical teams, ensuring effective communication and understanding of requirements.\n\n\n\n\nDesired Skills and Expertise:\n\nMin of 1.5 years of experience in the data domain AND strong affinity for data wrangling.\nAbility to look and understand data patterns, conclusions and the ability to present and translate this data into understandable documents.\nAbility to understand business problems and translate the solutions to SQL and Python.\nAbility to understand large and complex data structures in depth for data modeling.\nAbility to write, optimize, and explain SQL queries that wrangle ~150M rows of data with ease.\nStrong business case understanding and marrying marketing knowledge with data insights to drive projects.\nAbility to use Python for scripting, ETL, and API requests.\nBasic understanding of modern data architecture: data lake, data warehouse, serverless compute, Redshift/BigQuery/Athena/Snowflake etc.\nAbility to visualize insights with the help of a BI tool (example: Tableau / QuickSight / Metabase).\n\nShow more ",
    "link": "https://in.linkedin.com/jobs/view/business-analyst-at-truemeds-4159886506?position=4&pageNum=62&refId=9DAZTOuB47vYA4MZxFKVVA%3D%3D&trackingId=DrJSu0aV8ECHid%2B6UX7ruA%3D%3D"
}